# coding:utf-8
import os
import shutil
import fitz
import difflib
from datetime import datetime
import base64
from PIL import Image
from PIL import ImageDraw
import requests
from concurrent.futures import ThreadPoolExecutor

contrastResult={
    "code": 200,
    "data": {
        "figure": [],
        "prism_rowsInfo": [
            {
                "word": "●思建设银行",
                "rowId": 0
            },
            {
                "word": "编号：",
                "rowId": 1
            },
            {
                "word": "汇率交易申请书",
                "rowId": 2
            },
            {
                "word": "年月日",
                "rowId": 3
            },
            {
                "word": "中国建设银行分(支)行：",
                "rowId": 4
            },
            {
                "word": "本单位(人)",
                "rowId": 5
            },
            {
                "word": "委托你行办理以下汇率交易。",
                "rowId": 6
            },
            {
                "word": "币种1/币种2：方向：口买入/口卖出币种1金额：币种1币种2",
                "rowId": 7
            },
            {
                "word": "即期：资金交割日为_年_月日",
                "rowId": 8
            },
            {
                "word": "口即期远期：口全额交割○固定期限：交割日为_而对方年月日",
                "rowId": 9
            },
            {
                "word": "口远期○择期交易：交割日为年_月_日至年月日",
                "rowId": 10
            },
            {
                "word": "口差额交割交割日为年月日定盘日为年月日定盘汇率",
                "rowId": 11
            },
            {
                "word": "委托汇率：口市价/口(汇率)委托有效期：年月日至年月日",
                "rowId": 12
            },
            {
                "word": "币种1/币种2：交易方向：口近端买入/远端卖出币种1近端卖出/远端买入币种1",
                "rowId": 13
            },
            {
                "word": "近端：币种1金额币种2金额9987543近端汇率交割日年月日",
                "rowId": 14
            },
            {
                "word": "口掉期",
                "rowId": 15
            },
            {
                "word": "远端：币种1金额币种2金额远期点交割日年月日",
                "rowId": 16
            },
            {
                "word": "委托有效期：年月日至年月日",
                "rowId": 17
            },
            {
                "word": "交易展期原因(仅展期委托时填写)：",
                "rowId": 18
            },
            {
                "word": "口择期交割",
                "rowId": 19
            },
            {
                "word": "原交易证实书编号：123456789",
                "rowId": 20
            },
            {
                "word": "提前交割交割/展期日期：年月日",
                "rowId": 21
            },
            {
                "word": "币种：交割/展期金额：",
                "rowId": 22
            },
            {
                "word": "向后展期",
                "rowId": 23
            },
            {
                "word": "第一笔：",
                "rowId": 24
            },
            {
                "word": "第二笔：(如超过两笔可附页)",
                "rowId": 25
            },
            {
                "word": "交易币种：货币1/货币2交易币种：货币1/货币2",
                "rowId": 26
            },
            {
                "word": "交易类型：买入口货币1看涨期权交易类型：口买入口货币1看涨期权",
                "rowId": 27
            },
            {
                "word": "口卖出口货币1看跌期权口卖出口货币1看跌期权",
                "rowId": 28
            },
            {
                "word": "口人民币对外汇期权执行汇率：",
                "rowId": 29
            },
            {
                "word": "执行汇率：",
                "rowId": 30
            },
            {
                "word": "货币1金额：",
                "rowId": 31
            },
            {
                "word": "货币1金额：",
                "rowId": 32
            },
            {
                "word": "口人民币对外汇期权组合",
                "rowId": 33
            },
            {
                "word": "货币2金额：",
                "rowId": 34
            },
            {
                "word": "货币2金额：",
                "rowId": 35
            },
            {
                "word": "起息日：年月日起息日：年月日",
                "rowId": 36
            },
            {
                "word": "到期日：年月",
                "rowId": 37
            },
            {
                "word": "日日",
                "rowId": 39
            },
            {
                "word": "到期日：年1凶日日",
                "rowId": 40
            },
            {
                "word": "交割日：年月",
                "rowId": 42
            },
            {
                "word": "交割日：年月",
                "rowId": 44
            },
            {
                "word": "交割方式：口全额交割/口差额交割交割方式：口全额交割/口差额交割",
                "rowId": 46
            },
            {
                "word": "口人民币对外汇期权交易行权原交易证实书编号：",
                "rowId": 47
            },
            {
                "word": "口全额交割：口结汇口售汇币种交割金额执行汇率资金交割日年月日",
                "rowId": 48
            },
            {
                "word": "口差额交割：差额交割定盘汇率差额交割CNY金额_",
                "rowId": 49
            },
            {
                "word": "账户信息",
                "rowId": 50
            },
            {
                "word": "币种1在",
                "rowId": 51
            },
            {
                "word": "(账号)中扣划，币种2划入",
                "rowId": 52
            },
            {
                "word": "银行，",
                "rowId": 53
            },
            {
                "word": "账号",
                "rowId": 54
            },
            {
                "word": "，收款方为",
                "rowId": 55
            },
            {
                "word": "币种2在",
                "rowId": 56
            },
            {
                "word": "(账号)中扣划，币种1划入",
                "rowId": 57
            },
            {
                "word": "银行，",
                "rowId": 58
            },
            {
                "word": "账号",
                "rowId": 59
            },
            {
                "word": "，收款方为",
                "rowId": 60
            },
            {
                "word": "委托单位言体性质：01银行自身￥02金融机构交易编码：(同涉外收支交易代码)：0000",
                "rowId": 61
            },
            {
                "word": "03中资机构04外资机构",
                "rowId": 62
            },
            {
                "word": "外汇局批件号/备案表号/业务编号：",
                "rowId": 63
            },
            {
                "word": "结汇/售汇交易性展：(代号参见背页选项)结汇用途：(代号参见背页选项)",
                "rowId": 64
            },
            {
                "word": "如为服务贸易，是否为银行卡交易：口是口否如为005、006或099时请填写结汇详细用途",
                "rowId": 65
            },
            {
                "word": "委托单位签字并盖章：",
                "rowId": 66
            },
            {
                "word": "银行审核意见：",
                "rowId": 67
            },
            {
                "word": "银行盖章：",
                "rowId": 68
            },
            {
                "word": "年月日经办人：复核人：",
                "rowId": 69
            }
        ],
        "algo_version": "",
        "orgWidth": 992,
        "content": "● 思建设银行 编号： 汇率交易申请书 年 月 日 中国建设银行 分(支)行： 本单位(人) 委托你行办理以下汇率交易。 币种1/币种2： 方向：口买入/口卖出币种1 金额：币种1 币种2 即期：资金交割日为 _年 _月 日 口即期 远期：口全额交割○固定期限：交割日为_而对方 年月日 口远期 ○择期交易：交割日为 年 _月_日至 年 月 日 口差额交割 交割日为 年 月 日 定盘日为 年 月 日 定盘汇率 委托汇率：口市价/口 (汇率)委托有效期： 年 月 日至 年 月 日 币种1/币种2： 交易方向：口近端买入/远端卖出币种1 近端卖出/远端买入币种1 近端：币种1金额 币种2金额9987543 近端汇率 交割日年月 日 口掉期 远端：币种1金额 币种2金额 远期点 交割日 年 月 日 委托有效期： 年月 日至年月日 交易展期原因(仅展期委托时填写)： 口择期交割 原交易证实书编号：123456789 提前交割 交割/展期日期： 年 月 日 币种： 交割/展期金额： 向后展期 第一笔： 第二笔：(如超过两笔可附页) 交易币种：货币1 /货币2 交易币种：货币1 /货币2 交易类型：买入 口货币1看涨期权 交易类型：口买入 口货币1看涨期权 口卖出 口货币1看跌期权 口卖出 口货币1看跌期权 口人民币对外汇期权 执行汇率： 执行汇率： 货币1金额： 货币1金额： 口人民币对外汇期权组合 货币2金额： 货币2金额： 起息日： 年 月 日 起息日： 年 月 日 到期日： 年 月 日日 到期日： 年 1凶 日日 交割日： 年 月 交割日： 年 月 交割方式：口全额交割/口差额交割 交割方式：口全额交割/口差额交割 口人民币对外汇期权交易行权原交易证实书编号： 口全额交割：口结汇口售汇币种 交割金额 执行汇率 资金交割日 年月日 口差额交割：差额交割定盘汇率 差额交割CNY金额_ 账户信息 币种1在 (账号)中扣划，币种2划入 银行， 账号 ，收款方为 币种2在 (账号)中扣划，币种1划入 银行， 账号 ，收款方为 委托单位言体性质： 01银行自身￥02金融机构 交易编码：(同涉外收支交易代码)：0000 03中资机构04外资机构 外汇局批件号/备案表号/业务编号： 结汇/售汇交易性展： (代号参见背页选项) 结汇用途： (代号参见背页选项) 如为服务贸易，是否为银行卡交易：口是口否 如为005、006或099时请填写结汇详细用途 委托单位签字并盖章： 银行审核意见： 银行盖章： 年 月 日 经办人： 复核人： ",
        "requestId": "DB31947E-065A-57E0-AC4D-A1A27101E252",
        "prism_wnum": 161,
        "width": 992,
        "angle": 0,
        "orgHeight": 1403,
        "prism_version": "1.0.9",
        "prism_wordsInfo": [
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 64,
                        "y": 33
                    },
                    {
                        "x": 83,
                        "y": 33
                    },
                    {
                        "x": 83,
                        "y": 48
                    },
                    {
                        "x": 64,
                        "y": 48
                    }
                ],
                "width": 14,
                "x": 67,
                "angle": -90,
                "y": 31,
                "word": "●",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 21,
                        "h": 13,
                        "x": 64,
                        "y": 33,
                        "word": "●"
                    }
                ],
                "direction": 0,
                "height": 18,
                "rowId": 0
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 84,
                        "y": 29
                    },
                    {
                        "x": 197,
                        "y": 27
                    },
                    {
                        "x": 197,
                        "y": 45
                    },
                    {
                        "x": 85,
                        "y": 47
                    }
                ],
                "width": 112,
                "x": 84,
                "angle": -1,
                "y": 28,
                "word": "思建设银行",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 15,
                        "x": 111,
                        "y": 29,
                        "word": "思"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 127,
                        "y": 29,
                        "word": "建"
                    },
                    {
                        "prob": 100,
                        "w": 15,
                        "h": 15,
                        "x": 144,
                        "y": 28,
                        "word": "设"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 163,
                        "y": 28,
                        "word": "银"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 179,
                        "y": 28,
                        "word": "行"
                    }
                ],
                "direction": 0,
                "height": 16,
                "rowId": 0
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 53,
                        "y": 72
                    },
                    {
                        "x": 101,
                        "y": 72
                    },
                    {
                        "x": 101,
                        "y": 89
                    },
                    {
                        "x": 53,
                        "y": 89
                    }
                ],
                "width": 17,
                "x": 68,
                "angle": -90,
                "y": 56,
                "word": "编号：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 56,
                        "y": 73,
                        "word": "编"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 75,
                        "y": 73,
                        "word": "号"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 91,
                        "y": 73,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 46,
                "rowId": 1
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 408,
                        "y": 67
                    },
                    {
                        "x": 573,
                        "y": 67
                    },
                    {
                        "x": 573,
                        "y": 88
                    },
                    {
                        "x": 408,
                        "y": 88
                    }
                ],
                "width": 19,
                "x": 481,
                "angle": -89,
                "y": -5,
                "word": "汇率交易申请书",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 22,
                        "h": 18,
                        "x": 409,
                        "y": 67,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 19,
                        "h": 18,
                        "x": 436,
                        "y": 67,
                        "word": "率"
                    },
                    {
                        "prob": 99,
                        "w": 19,
                        "h": 18,
                        "x": 460,
                        "y": 67,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 18,
                        "x": 484,
                        "y": 67,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 19,
                        "h": 18,
                        "x": 504,
                        "y": 67,
                        "word": "申"
                    },
                    {
                        "prob": 99,
                        "w": 19,
                        "h": 18,
                        "x": 528,
                        "y": 67,
                        "word": "请"
                    },
                    {
                        "prob": 99,
                        "w": 22,
                        "h": 18,
                        "x": 552,
                        "y": 67,
                        "word": "书"
                    }
                ],
                "direction": 0,
                "height": 165,
                "rowId": 2
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 788,
                        "y": 69
                    },
                    {
                        "x": 813,
                        "y": 69
                    },
                    {
                        "x": 813,
                        "y": 89
                    },
                    {
                        "x": 788,
                        "y": 89
                    }
                ],
                "width": 19,
                "x": 791,
                "angle": -90,
                "y": 67,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 18,
                        "h": 17,
                        "x": 791,
                        "y": 70,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 25,
                "rowId": 3
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 830,
                        "y": 69
                    },
                    {
                        "x": 855,
                        "y": 69
                    },
                    {
                        "x": 855,
                        "y": 90
                    },
                    {
                        "x": 830,
                        "y": 90
                    }
                ],
                "width": 21,
                "x": 833,
                "angle": -90,
                "y": 68,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 18,
                        "x": 835,
                        "y": 70,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 25,
                "rowId": 3
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 876,
                        "y": 69
                    },
                    {
                        "x": 899,
                        "y": 69
                    },
                    {
                        "x": 899,
                        "y": 90
                    },
                    {
                        "x": 876,
                        "y": 90
                    }
                ],
                "width": 21,
                "x": 877,
                "angle": -90,
                "y": 68,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 18,
                        "x": 880,
                        "y": 70,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 24,
                "rowId": 3
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 99
                    },
                    {
                        "x": 152,
                        "y": 102
                    },
                    {
                        "x": 151,
                        "y": 119
                    },
                    {
                        "x": 43,
                        "y": 116
                    }
                ],
                "width": 16,
                "x": 89,
                "angle": -88,
                "y": 54,
                "word": "中国建设银行",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 45,
                        "y": 100,
                        "word": "中"
                    },
                    {
                        "prob": 100,
                        "w": 15,
                        "h": 15,
                        "x": 64,
                        "y": 100,
                        "word": "国"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 83,
                        "y": 100,
                        "word": "建"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 99,
                        "y": 101,
                        "word": "设"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 116,
                        "y": 101,
                        "word": "银"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 135,
                        "y": 102,
                        "word": "行"
                    }
                ],
                "direction": 0,
                "height": 108,
                "rowId": 4
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 287,
                        "y": 102
                    },
                    {
                        "x": 387,
                        "y": 102
                    },
                    {
                        "x": 387,
                        "y": 119
                    },
                    {
                        "x": 287,
                        "y": 119
                    }
                ],
                "width": 18,
                "x": 329,
                "angle": -90,
                "y": 60,
                "word": "分(支)行：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 290,
                        "y": 103,
                        "word": "分"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 317,
                        "y": 103,
                        "word": "("
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 325,
                        "y": 103,
                        "word": "支"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 344,
                        "y": 103,
                        "word": ")"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 359,
                        "y": 103,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 377,
                        "y": 103,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 100,
                "rowId": 4
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 122
                    },
                    {
                        "x": 145,
                        "y": 122
                    },
                    {
                        "x": 145,
                        "y": 140
                    },
                    {
                        "x": 44,
                        "y": 140
                    }
                ],
                "width": 17,
                "x": 86,
                "angle": -90,
                "y": 80,
                "word": "本单位(人)",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 15,
                        "x": 47,
                        "y": 122,
                        "word": "本"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 15,
                        "x": 65,
                        "y": 122,
                        "word": "单"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 82,
                        "y": 122,
                        "word": "位"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 107,
                        "y": 122,
                        "word": "("
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 118,
                        "y": 122,
                        "word": "人"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 135,
                        "y": 122,
                        "word": ")"
                    }
                ],
                "direction": 0,
                "height": 101,
                "rowId": 5
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 429,
                        "y": 122
                    },
                    {
                        "x": 649,
                        "y": 122
                    },
                    {
                        "x": 649,
                        "y": 140
                    },
                    {
                        "x": 429,
                        "y": 140
                    }
                ],
                "width": 17,
                "x": 530,
                "angle": -90,
                "y": 21,
                "word": "委托你行办理以下汇率交易。",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 432,
                        "y": 122,
                        "word": "委"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 450,
                        "y": 122,
                        "word": "托"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 468,
                        "y": 122,
                        "word": "你"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 486,
                        "y": 122,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 502,
                        "y": 122,
                        "word": "办"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 520,
                        "y": 122,
                        "word": "理"
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 15,
                        "x": 538,
                        "y": 122,
                        "word": "以"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 554,
                        "y": 122,
                        "word": "下"
                    },
                    {
                        "prob": 99,
                        "w": 8,
                        "h": 15,
                        "x": 578,
                        "y": 122,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 590,
                        "y": 122,
                        "word": "率"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 608,
                        "y": 122,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 626,
                        "y": 122,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 641,
                        "y": 122,
                        "word": "。"
                    }
                ],
                "direction": 0,
                "height": 219,
                "rowId": 6
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 116,
                        "y": 148
                    },
                    {
                        "x": 221,
                        "y": 148
                    },
                    {
                        "x": 221,
                        "y": 166
                    },
                    {
                        "x": 116,
                        "y": 166
                    }
                ],
                "width": 17,
                "x": 161,
                "angle": -90,
                "y": 104,
                "word": "币种1/币种2：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 117,
                        "y": 148,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 135,
                        "y": 148,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 153,
                        "y": 148,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 8,
                        "h": 15,
                        "x": 160,
                        "y": 148,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 171,
                        "y": 148,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 187,
                        "y": 148,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 205,
                        "y": 148,
                        "word": "2"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 214,
                        "y": 148,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 105,
                "rowId": 7
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 333,
                        "y": 148
                    },
                    {
                        "x": 551,
                        "y": 148
                    },
                    {
                        "x": 551,
                        "y": 166
                    },
                    {
                        "x": 333,
                        "y": 166
                    }
                ],
                "width": 16,
                "x": 434,
                "angle": -89,
                "y": 47,
                "word": "方向：口买入/口卖出币种1",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 336,
                        "y": 148,
                        "word": "方"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 354,
                        "y": 148,
                        "word": "向"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 372,
                        "y": 148,
                        "word": "："
                    },
                    {
                        "prob": 93,
                        "w": 12,
                        "h": 15,
                        "x": 390,
                        "y": 148,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 406,
                        "y": 148,
                        "word": "买"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 423,
                        "y": 148,
                        "word": "入"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 441,
                        "y": 148,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 450,
                        "y": 148,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 466,
                        "y": 148,
                        "word": "卖"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 486,
                        "y": 148,
                        "word": "出"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 502,
                        "y": 148,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 520,
                        "y": 148,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 537,
                        "y": 148,
                        "word": "1"
                    }
                ],
                "direction": 0,
                "height": 219,
                "rowId": 7
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 552,
                        "y": 148
                    },
                    {
                        "x": 660,
                        "y": 148
                    },
                    {
                        "x": 660,
                        "y": 164
                    },
                    {
                        "x": 552,
                        "y": 164
                    }
                ],
                "width": 16,
                "x": 598,
                "angle": -90,
                "y": 103,
                "word": "金额：币种1",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 562,
                        "y": 148,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 579,
                        "y": 148,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 597,
                        "y": 148,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 14,
                        "x": 615,
                        "y": 148,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 630,
                        "y": 148,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 649,
                        "y": 148,
                        "word": "1"
                    }
                ],
                "direction": 0,
                "height": 108,
                "rowId": 7
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 760,
                        "y": 148
                    },
                    {
                        "x": 810,
                        "y": 148
                    },
                    {
                        "x": 810,
                        "y": 164
                    },
                    {
                        "x": 760,
                        "y": 164
                    }
                ],
                "width": 16,
                "x": 778,
                "angle": -90,
                "y": 132,
                "word": "币种2",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 14,
                        "x": 765,
                        "y": 148,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 781,
                        "y": 148,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 14,
                        "x": 798,
                        "y": 148,
                        "word": "2"
                    }
                ],
                "direction": 0,
                "height": 50,
                "rowId": 7
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 113,
                        "y": 169
                    },
                    {
                        "x": 276,
                        "y": 170
                    },
                    {
                        "x": 276,
                        "y": 189
                    },
                    {
                        "x": 113,
                        "y": 187
                    }
                ],
                "width": 18,
                "x": 186,
                "angle": -89,
                "y": 96,
                "word": "即期：资金交割日为",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 116,
                        "y": 170,
                        "word": "即"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 134,
                        "y": 170,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 152,
                        "y": 170,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 170,
                        "y": 170,
                        "word": "资"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 188,
                        "y": 170,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 203,
                        "y": 170,
                        "word": "交"
                    },
                    {
                        "prob": 100,
                        "w": 16,
                        "h": 16,
                        "x": 221,
                        "y": 171,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 242,
                        "y": 171,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 256,
                        "y": 171,
                        "word": "为"
                    }
                ],
                "direction": 0,
                "height": 163,
                "rowId": 8
            },
            {
                "prob": 84,
                "pos": [
                    {
                        "x": 304,
                        "y": 170
                    },
                    {
                        "x": 330,
                        "y": 170
                    },
                    {
                        "x": 330,
                        "y": 186
                    },
                    {
                        "x": 304,
                        "y": 186
                    }
                ],
                "width": 16,
                "x": 309,
                "angle": -90,
                "y": 165,
                "word": "_年",
                "charInfo": [
                    {
                        "prob": 69,
                        "w": 5,
                        "h": 14,
                        "x": 304,
                        "y": 170,
                        "word": "_"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 311,
                        "y": 170,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 26,
                "rowId": 8
            },
            {
                "prob": 81,
                "pos": [
                    {
                        "x": 328,
                        "y": 172
                    },
                    {
                        "x": 380,
                        "y": 170
                    },
                    {
                        "x": 381,
                        "y": 186
                    },
                    {
                        "x": 329,
                        "y": 189
                    }
                ],
                "width": 52,
                "x": 328,
                "angle": -2,
                "y": 169,
                "word": "_月",
                "charInfo": [
                    {
                        "prob": 63,
                        "w": 30,
                        "h": 14,
                        "x": 329,
                        "y": 172,
                        "word": "_"
                    },
                    {
                        "prob": 100,
                        "w": 13,
                        "h": 14,
                        "x": 361,
                        "y": 170,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 17,
                "rowId": 8
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 381,
                        "y": 178
                    },
                    {
                        "x": 431,
                        "y": 168
                    },
                    {
                        "x": 435,
                        "y": 185
                    },
                    {
                        "x": 385,
                        "y": 195
                    }
                ],
                "width": 51,
                "x": 383,
                "angle": -10,
                "y": 172,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 415,
                        "y": 172,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 18,
                "rowId": 8
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 45,
                        "y": 192
                    },
                    {
                        "x": 101,
                        "y": 192
                    },
                    {
                        "x": 101,
                        "y": 210
                    },
                    {
                        "x": 45,
                        "y": 210
                    }
                ],
                "width": 17,
                "x": 64,
                "angle": -90,
                "y": 172,
                "word": "口即期",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 48,
                        "y": 192,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 63,
                        "y": 192,
                        "word": "即"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 81,
                        "y": 192,
                        "word": "期"
                    }
                ],
                "direction": 0,
                "height": 56,
                "rowId": 9
            },
            {
                "prob": 96,
                "pos": [
                    {
                        "x": 113,
                        "y": 192
                    },
                    {
                        "x": 517,
                        "y": 192
                    },
                    {
                        "x": 517,
                        "y": 211
                    },
                    {
                        "x": 113,
                        "y": 211
                    }
                ],
                "width": 18,
                "x": 306,
                "angle": -89,
                "y": 0,
                "word": "远期：口全额交割○固定期限：交割日为_而对方",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 116,
                        "y": 193,
                        "word": "远"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 134,
                        "y": 193,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 16,
                        "x": 152,
                        "y": 193,
                        "word": "："
                    },
                    {
                        "prob": 93,
                        "w": 14,
                        "h": 16,
                        "x": 168,
                        "y": 193,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 186,
                        "y": 193,
                        "word": "全"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 204,
                        "y": 193,
                        "word": "额"
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 16,
                        "x": 222,
                        "y": 193,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 237,
                        "y": 193,
                        "word": "割"
                    },
                    {
                        "prob": 44,
                        "w": 14,
                        "h": 16,
                        "x": 273,
                        "y": 193,
                        "word": "○"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 291,
                        "y": 193,
                        "word": "固"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 307,
                        "y": 193,
                        "word": "定"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 16,
                        "x": 325,
                        "y": 193,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 343,
                        "y": 193,
                        "word": "限"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 361,
                        "y": 193,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 377,
                        "y": 193,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 397,
                        "y": 193,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 415,
                        "y": 193,
                        "word": "日"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 16,
                        "x": 431,
                        "y": 193,
                        "word": "为"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 16,
                        "x": 449,
                        "y": 193,
                        "word": "_"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 457,
                        "y": 193,
                        "word": "而"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 475,
                        "y": 193,
                        "word": "对"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 493,
                        "y": 193,
                        "word": "方"
                    }
                ],
                "direction": 0,
                "height": 404,
                "rowId": 9
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 533,
                        "y": 194
                    },
                    {
                        "x": 624,
                        "y": 194
                    },
                    {
                        "x": 624,
                        "y": 210
                    },
                    {
                        "x": 533,
                        "y": 210
                    }
                ],
                "width": 16,
                "x": 571,
                "angle": -90,
                "y": 156,
                "word": "年月日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 19,
                        "h": 14,
                        "x": 533,
                        "y": 194,
                        "word": "年"
                    },
                    {
                        "prob": 99,
                        "w": 30,
                        "h": 14,
                        "x": 554,
                        "y": 194,
                        "word": "月"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 609,
                        "y": 194,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 92,
                "rowId": 9
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 45,
                        "y": 214
                    },
                    {
                        "x": 101,
                        "y": 214
                    },
                    {
                        "x": 101,
                        "y": 232
                    },
                    {
                        "x": 45,
                        "y": 232
                    }
                ],
                "width": 17,
                "x": 64,
                "angle": -90,
                "y": 194,
                "word": "口远期",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 48,
                        "y": 214,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 63,
                        "y": 214,
                        "word": "远"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 81,
                        "y": 214,
                        "word": "期"
                    }
                ],
                "direction": 0,
                "height": 56,
                "rowId": 10
            },
            {
                "prob": 97,
                "pos": [
                    {
                        "x": 274,
                        "y": 213
                    },
                    {
                        "x": 453,
                        "y": 215
                    },
                    {
                        "x": 453,
                        "y": 234
                    },
                    {
                        "x": 274,
                        "y": 232
                    }
                ],
                "width": 18,
                "x": 354,
                "angle": -89,
                "y": 133,
                "word": "○择期交易：交割日为",
                "charInfo": [
                    {
                        "prob": 78,
                        "w": 12,
                        "h": 16,
                        "x": 275,
                        "y": 214,
                        "word": "○"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 290,
                        "y": 214,
                        "word": "择"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 311,
                        "y": 214,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 326,
                        "y": 214,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 344,
                        "y": 214,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 362,
                        "y": 215,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 378,
                        "y": 215,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 396,
                        "y": 215,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 416,
                        "y": 215,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 432,
                        "y": 216,
                        "word": "为"
                    }
                ],
                "direction": 0,
                "height": 179,
                "rowId": 10
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 463,
                        "y": 217
                    },
                    {
                        "x": 505,
                        "y": 217
                    },
                    {
                        "x": 505,
                        "y": 232
                    },
                    {
                        "x": 463,
                        "y": 232
                    }
                ],
                "width": 15,
                "x": 476,
                "angle": -90,
                "y": 203,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 12,
                        "x": 484,
                        "y": 217,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 42,
                "rowId": 10
            },
            {
                "prob": 98,
                "pos": [
                    {
                        "x": 515,
                        "y": 214
                    },
                    {
                        "x": 593,
                        "y": 214
                    },
                    {
                        "x": 593,
                        "y": 232
                    },
                    {
                        "x": 515,
                        "y": 232
                    }
                ],
                "width": 17,
                "x": 545,
                "angle": -90,
                "y": 184,
                "word": "_月_日至",
                "charInfo": [
                    {
                        "prob": 94,
                        "w": 3,
                        "h": 15,
                        "x": 515,
                        "y": 214,
                        "word": "_"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 15,
                        "x": 520,
                        "y": 214,
                        "word": "月"
                    },
                    {
                        "prob": 52,
                        "w": 17,
                        "h": 15,
                        "x": 536,
                        "y": 214,
                        "word": "_"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 556,
                        "y": 214,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 572,
                        "y": 214,
                        "word": "至"
                    }
                ],
                "direction": 0,
                "height": 78,
                "rowId": 10
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 620,
                        "y": 215
                    },
                    {
                        "x": 652,
                        "y": 215
                    },
                    {
                        "x": 652,
                        "y": 232
                    },
                    {
                        "x": 620,
                        "y": 232
                    }
                ],
                "width": 16,
                "x": 628,
                "angle": -90,
                "y": 208,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 623,
                        "y": 215,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 31,
                "rowId": 10
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 656,
                        "y": 216
                    },
                    {
                        "x": 684,
                        "y": 216
                    },
                    {
                        "x": 684,
                        "y": 233
                    },
                    {
                        "x": 656,
                        "y": 233
                    }
                ],
                "width": 18,
                "x": 661,
                "angle": -90,
                "y": 210,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 18,
                        "h": 15,
                        "x": 656,
                        "y": 217,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 29,
                "rowId": 10
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 691,
                        "y": 214
                    },
                    {
                        "x": 713,
                        "y": 214
                    },
                    {
                        "x": 713,
                        "y": 233
                    },
                    {
                        "x": 691,
                        "y": 233
                    }
                ],
                "width": 18,
                "x": 693,
                "angle": -90,
                "y": 213,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 697,
                        "y": 215,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 22,
                "rowId": 10
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 168,
                        "y": 239
                    },
                    {
                        "x": 261,
                        "y": 239
                    },
                    {
                        "x": 261,
                        "y": 255
                    },
                    {
                        "x": 168,
                        "y": 255
                    }
                ],
                "width": 16,
                "x": 207,
                "angle": -90,
                "y": 199,
                "word": "口差额交割",
                "charInfo": [
                    {
                        "prob": 65,
                        "w": 13,
                        "h": 14,
                        "x": 171,
                        "y": 239,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 188,
                        "y": 239,
                        "word": "差"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 205,
                        "y": 239,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 222,
                        "y": 239,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 18,
                        "h": 14,
                        "x": 239,
                        "y": 239,
                        "word": "割"
                    }
                ],
                "direction": 0,
                "height": 93,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 271,
                        "y": 237
                    },
                    {
                        "x": 372,
                        "y": 237
                    },
                    {
                        "x": 372,
                        "y": 255
                    },
                    {
                        "x": 271,
                        "y": 255
                    }
                ],
                "width": 17,
                "x": 313,
                "angle": -90,
                "y": 195,
                "word": "交割日为",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 274,
                        "y": 238,
                        "word": "交"
                    },
                    {
                        "prob": 100,
                        "w": 15,
                        "h": 15,
                        "x": 293,
                        "y": 238,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 312,
                        "y": 238,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 327,
                        "y": 238,
                        "word": "为"
                    }
                ],
                "direction": 0,
                "height": 101,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 376,
                        "y": 237
                    },
                    {
                        "x": 402,
                        "y": 237
                    },
                    {
                        "x": 402,
                        "y": 254
                    },
                    {
                        "x": 376,
                        "y": 254
                    }
                ],
                "width": 16,
                "x": 382,
                "angle": -90,
                "y": 232,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 378,
                        "y": 238,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 26,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 411,
                        "y": 236
                    },
                    {
                        "x": 436,
                        "y": 236
                    },
                    {
                        "x": 436,
                        "y": 258
                    },
                    {
                        "x": 411,
                        "y": 258
                    }
                ],
                "width": 22,
                "x": 413,
                "angle": -90,
                "y": 235,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 19,
                        "x": 411,
                        "y": 237,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 24,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 444,
                        "y": 236
                    },
                    {
                        "x": 469,
                        "y": 236
                    },
                    {
                        "x": 469,
                        "y": 256
                    },
                    {
                        "x": 444,
                        "y": 256
                    }
                ],
                "width": 19,
                "x": 447,
                "angle": -90,
                "y": 233,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 17,
                        "x": 453,
                        "y": 237,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 26,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 477,
                        "y": 237
                    },
                    {
                        "x": 567,
                        "y": 237
                    },
                    {
                        "x": 567,
                        "y": 255
                    },
                    {
                        "x": 477,
                        "y": 255
                    }
                ],
                "width": 17,
                "x": 513,
                "angle": -90,
                "y": 201,
                "word": "定盘日为",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 493,
                        "y": 238,
                        "word": "定"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 511,
                        "y": 238,
                        "word": "盘"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 531,
                        "y": 238,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 547,
                        "y": 238,
                        "word": "为"
                    }
                ],
                "direction": 0,
                "height": 90,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 593,
                        "y": 236
                    },
                    {
                        "x": 620,
                        "y": 236
                    },
                    {
                        "x": 620,
                        "y": 255
                    },
                    {
                        "x": 593,
                        "y": 255
                    }
                ],
                "width": 18,
                "x": 598,
                "angle": -90,
                "y": 233,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 597,
                        "y": 237,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 26,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 630,
                        "y": 236
                    },
                    {
                        "x": 655,
                        "y": 236
                    },
                    {
                        "x": 655,
                        "y": 255
                    },
                    {
                        "x": 630,
                        "y": 255
                    }
                ],
                "width": 18,
                "x": 634,
                "angle": -90,
                "y": 233,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 16,
                        "x": 633,
                        "y": 237,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 25,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 657,
                        "y": 237
                    },
                    {
                        "x": 686,
                        "y": 237
                    },
                    {
                        "x": 686,
                        "y": 255
                    },
                    {
                        "x": 657,
                        "y": 255
                    }
                ],
                "width": 17,
                "x": 663,
                "angle": -90,
                "y": 232,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 670,
                        "y": 238,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 28,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 709,
                        "y": 239
                    },
                    {
                        "x": 784,
                        "y": 237
                    },
                    {
                        "x": 785,
                        "y": 255
                    },
                    {
                        "x": 710,
                        "y": 256
                    }
                ],
                "width": 75,
                "x": 709,
                "angle": -1,
                "y": 239,
                "word": "定盘汇率",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 711,
                        "y": 239,
                        "word": "定"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 730,
                        "y": 239,
                        "word": "盘"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 746,
                        "y": 238,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 765,
                        "y": 238,
                        "word": "率"
                    }
                ],
                "direction": 0,
                "height": 16,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 115,
                        "y": 262
                    },
                    {
                        "x": 283,
                        "y": 260
                    },
                    {
                        "x": 283,
                        "y": 278
                    },
                    {
                        "x": 115,
                        "y": 280
                    }
                ],
                "width": 169,
                "x": 114,
                "angle": 0,
                "y": 260,
                "word": "委托汇率：口市价/口",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 115,
                        "y": 263,
                        "word": "委"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 133,
                        "y": 263,
                        "word": "托"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 151,
                        "y": 263,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 169,
                        "y": 263,
                        "word": "率"
                    },
                    {
                        "prob": 98,
                        "w": 4,
                        "h": 15,
                        "x": 187,
                        "y": 263,
                        "word": "："
                    },
                    {
                        "prob": 100,
                        "w": 16,
                        "h": 15,
                        "x": 203,
                        "y": 262,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 223,
                        "y": 262,
                        "word": "市"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 239,
                        "y": 262,
                        "word": "价"
                    },
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 15,
                        "x": 257,
                        "y": 262,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 267,
                        "y": 262,
                        "word": "口"
                    }
                ],
                "direction": 0,
                "height": 17,
                "rowId": 12
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 375,
                        "y": 261
                    },
                    {
                        "x": 536,
                        "y": 261
                    },
                    {
                        "x": 536,
                        "y": 278
                    },
                    {
                        "x": 375,
                        "y": 278
                    }
                ],
                "width": 18,
                "x": 447,
                "angle": -90,
                "y": 189,
                "word": "(汇率)委托有效期：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 378,
                        "y": 262,
                        "word": "("
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 388,
                        "y": 262,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 405,
                        "y": 262,
                        "word": "率"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 425,
                        "y": 262,
                        "word": ")"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 440,
                        "y": 262,
                        "word": "委"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 459,
                        "y": 262,
                        "word": "托"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 478,
                        "y": 262,
                        "word": "有"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 493,
                        "y": 262,
                        "word": "效"
                    },
                    {
                        "prob": 100,
                        "w": 13,
                        "h": 15,
                        "x": 512,
                        "y": 262,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 529,
                        "y": 262,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 161,
                "rowId": 12
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 577,
                        "y": 258
                    },
                    {
                        "x": 602,
                        "y": 258
                    },
                    {
                        "x": 602,
                        "y": 277
                    },
                    {
                        "x": 577,
                        "y": 277
                    }
                ],
                "width": 18,
                "x": 580,
                "angle": -90,
                "y": 255,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 21,
                        "h": 16,
                        "x": 577,
                        "y": 259,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 25,
                "rowId": 12
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 611,
                        "y": 258
                    },
                    {
                        "x": 635,
                        "y": 258
                    },
                    {
                        "x": 635,
                        "y": 280
                    },
                    {
                        "x": 611,
                        "y": 280
                    }
                ],
                "width": 22,
                "x": 613,
                "angle": -90,
                "y": 257,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 19,
                        "x": 611,
                        "y": 259,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 24,
                "rowId": 12
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 649,
                        "y": 261
                    },
                    {
                        "x": 687,
                        "y": 261
                    },
                    {
                        "x": 687,
                        "y": 277
                    },
                    {
                        "x": 649,
                        "y": 277
                    }
                ],
                "width": 16,
                "x": 661,
                "angle": -90,
                "y": 250,
                "word": "日至",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 14,
                        "x": 651,
                        "y": 262,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 667,
                        "y": 262,
                        "word": "至"
                    }
                ],
                "direction": 0,
                "height": 38,
                "rowId": 12
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 717,
                        "y": 260
                    },
                    {
                        "x": 743,
                        "y": 260
                    },
                    {
                        "x": 743,
                        "y": 278
                    },
                    {
                        "x": 717,
                        "y": 278
                    }
                ],
                "width": 18,
                "x": 721,
                "angle": -90,
                "y": 255,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 16,
                        "x": 720,
                        "y": 261,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 27,
                "rowId": 12
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 752,
                        "y": 262
                    },
                    {
                        "x": 789,
                        "y": 262
                    },
                    {
                        "x": 789,
                        "y": 277
                    },
                    {
                        "x": 752,
                        "y": 277
                    }
                ],
                "width": 14,
                "x": 763,
                "angle": -90,
                "y": 251,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 19,
                        "h": 12,
                        "x": 752,
                        "y": 262,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 37,
                "rowId": 12
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 786,
                        "y": 258
                    },
                    {
                        "x": 810,
                        "y": 258
                    },
                    {
                        "x": 810,
                        "y": 279
                    },
                    {
                        "x": 786,
                        "y": 279
                    }
                ],
                "width": 20,
                "x": 788,
                "angle": -90,
                "y": 257,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 17,
                        "x": 793,
                        "y": 259,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 23,
                "rowId": 12
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 115,
                        "y": 299
                    },
                    {
                        "x": 229,
                        "y": 299
                    },
                    {
                        "x": 229,
                        "y": 317
                    },
                    {
                        "x": 115,
                        "y": 317
                    }
                ],
                "width": 16,
                "x": 164,
                "angle": -90,
                "y": 249,
                "word": "币种1/币种2：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 118,
                        "y": 300,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 135,
                        "y": 300,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 158,
                        "y": 300,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 164,
                        "y": 300,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 175,
                        "y": 300,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 191,
                        "y": 300,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 212,
                        "y": 300,
                        "word": "2"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 222,
                        "y": 300,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 114,
                "rowId": 13
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 344,
                        "y": 299
                    },
                    {
                        "x": 646,
                        "y": 297
                    },
                    {
                        "x": 646,
                        "y": 316
                    },
                    {
                        "x": 344,
                        "y": 318
                    }
                ],
                "width": 19,
                "x": 486,
                "angle": -90,
                "y": 156,
                "word": "交易方向：口近端买入/远端卖出币种1",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 345,
                        "y": 300,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 363,
                        "y": 300,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 378,
                        "y": 300,
                        "word": "方"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 399,
                        "y": 300,
                        "word": "向"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 414,
                        "y": 300,
                        "word": "："
                    },
                    {
                        "prob": 88,
                        "w": 12,
                        "h": 16,
                        "x": 432,
                        "y": 300,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 448,
                        "y": 300,
                        "word": "近"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 468,
                        "y": 299,
                        "word": "端"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 486,
                        "y": 299,
                        "word": "买"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 504,
                        "y": 299,
                        "word": "入"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 520,
                        "y": 299,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 529,
                        "y": 299,
                        "word": "远"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 544,
                        "y": 299,
                        "word": "端"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 565,
                        "y": 299,
                        "word": "卖"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 582,
                        "y": 299,
                        "word": "出"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 598,
                        "y": 299,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 618,
                        "y": 299,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 639,
                        "y": 299,
                        "word": "1"
                    }
                ],
                "direction": 0,
                "height": 303,
                "rowId": 13
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 679,
                        "y": 299
                    },
                    {
                        "x": 895,
                        "y": 299
                    },
                    {
                        "x": 895,
                        "y": 317
                    },
                    {
                        "x": 679,
                        "y": 317
                    }
                ],
                "width": 17,
                "x": 779,
                "angle": -90,
                "y": 200,
                "word": "近端卖出/远端买入币种1",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 697,
                        "y": 300,
                        "word": "近"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 715,
                        "y": 300,
                        "word": "端"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 733,
                        "y": 300,
                        "word": "卖"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 753,
                        "y": 300,
                        "word": "出"
                    },
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 15,
                        "x": 769,
                        "y": 300,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 779,
                        "y": 300,
                        "word": "远"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 795,
                        "y": 300,
                        "word": "端"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 813,
                        "y": 300,
                        "word": "买"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 831,
                        "y": 300,
                        "word": "入"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 849,
                        "y": 300,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 865,
                        "y": 300,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 15,
                        "x": 887,
                        "y": 300,
                        "word": "1"
                    }
                ],
                "direction": 0,
                "height": 216,
                "rowId": 13
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 115,
                        "y": 322
                    },
                    {
                        "x": 260,
                        "y": 322
                    },
                    {
                        "x": 260,
                        "y": 340
                    },
                    {
                        "x": 115,
                        "y": 340
                    }
                ],
                "width": 17,
                "x": 179,
                "angle": -90,
                "y": 258,
                "word": "近端：币种1金额",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 116,
                        "y": 322,
                        "word": "近"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 134,
                        "y": 322,
                        "word": "端"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 152,
                        "y": 322,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 15,
                        "x": 172,
                        "y": 322,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 185,
                        "y": 322,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 208,
                        "y": 322,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 221,
                        "y": 322,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 239,
                        "y": 322,
                        "word": "额"
                    }
                ],
                "direction": 0,
                "height": 145,
                "rowId": 14
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 370,
                        "y": 322
                    },
                    {
                        "x": 541,
                        "y": 322
                    },
                    {
                        "x": 541,
                        "y": 340
                    },
                    {
                        "x": 370,
                        "y": 340
                    }
                ],
                "width": 17,
                "x": 447,
                "angle": -90,
                "y": 246,
                "word": "币种2金额9987543",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 371,
                        "y": 322,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 386,
                        "y": 322,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 15,
                        "x": 409,
                        "y": 322,
                        "word": "2"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 422,
                        "y": 322,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 442,
                        "y": 322,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 21,
                        "h": 15,
                        "x": 460,
                        "y": 322,
                        "word": "9"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 485,
                        "y": 322,
                        "word": "9"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 493,
                        "y": 322,
                        "word": "8"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 502,
                        "y": 322,
                        "word": "7"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 511,
                        "y": 322,
                        "word": "5"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 520,
                        "y": 322,
                        "word": "4"
                    },
                    {
                        "prob": 98,
                        "w": 7,
                        "h": 15,
                        "x": 528,
                        "y": 322,
                        "word": "3"
                    }
                ],
                "direction": 0,
                "height": 171,
                "rowId": 14
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 539,
                        "y": 324
                    },
                    {
                        "x": 643,
                        "y": 320
                    },
                    {
                        "x": 644,
                        "y": 339
                    },
                    {
                        "x": 540,
                        "y": 343
                    }
                ],
                "width": 104,
                "x": 539,
                "angle": -2,
                "y": 321,
                "word": "近端汇率",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 17,
                        "x": 571,
                        "y": 322,
                        "word": "近"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 17,
                        "x": 591,
                        "y": 321,
                        "word": "端"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 17,
                        "x": 608,
                        "y": 321,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 17,
                        "x": 626,
                        "y": 320,
                        "word": "率"
                    }
                ],
                "direction": 0,
                "height": 19,
                "rowId": 14
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 702,
                        "y": 323
                    },
                    {
                        "x": 863,
                        "y": 323
                    },
                    {
                        "x": 863,
                        "y": 341
                    },
                    {
                        "x": 702,
                        "y": 341
                    }
                ],
                "width": 18,
                "x": 773,
                "angle": -90,
                "y": 251,
                "word": "交割日年月",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 16,
                        "x": 703,
                        "y": 324,
                        "word": "交"
                    },
                    {
                        "prob": 100,
                        "w": 16,
                        "h": 16,
                        "x": 721,
                        "y": 324,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 16,
                        "x": 741,
                        "y": 324,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 790,
                        "y": 324,
                        "word": "年"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 826,
                        "y": 324,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 161,
                "rowId": 14
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 863,
                        "y": 324
                    },
                    {
                        "x": 875,
                        "y": 324
                    },
                    {
                        "x": 875,
                        "y": 338
                    },
                    {
                        "x": 863,
                        "y": 338
                    }
                ],
                "width": 14,
                "x": 862,
                "angle": -90,
                "y": 325,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 12,
                        "x": 863,
                        "y": 324,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 12,
                "rowId": 14
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 336
                    },
                    {
                        "x": 101,
                        "y": 336
                    },
                    {
                        "x": 101,
                        "y": 352
                    },
                    {
                        "x": 44,
                        "y": 352
                    }
                ],
                "width": 16,
                "x": 64,
                "angle": -90,
                "y": 315,
                "word": "口掉期",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 14,
                        "x": 48,
                        "y": 336,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 63,
                        "y": 336,
                        "word": "掉"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 14,
                        "x": 82,
                        "y": 336,
                        "word": "期"
                    }
                ],
                "direction": 0,
                "height": 57,
                "rowId": 15
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 115,
                        "y": 346
                    },
                    {
                        "x": 260,
                        "y": 346
                    },
                    {
                        "x": 260,
                        "y": 363
                    },
                    {
                        "x": 115,
                        "y": 363
                    }
                ],
                "width": 18,
                "x": 178,
                "angle": -90,
                "y": 281,
                "word": "远端：币种1金额",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 116,
                        "y": 346,
                        "word": "远"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 134,
                        "y": 346,
                        "word": "端"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 152,
                        "y": 346,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 15,
                        "x": 172,
                        "y": 346,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 185,
                        "y": 346,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 208,
                        "y": 346,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 221,
                        "y": 346,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 19,
                        "h": 15,
                        "x": 239,
                        "y": 346,
                        "word": "额"
                    }
                ],
                "direction": 0,
                "height": 145,
                "rowId": 16
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 368,
                        "y": 346
                    },
                    {
                        "x": 460,
                        "y": 344
                    },
                    {
                        "x": 460,
                        "y": 362
                    },
                    {
                        "x": 368,
                        "y": 363
                    }
                ],
                "width": 91,
                "x": 368,
                "angle": 0,
                "y": 345,
                "word": "币种2金额",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 374,
                        "y": 347,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 389,
                        "y": 347,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 9,
                        "h": 15,
                        "x": 410,
                        "y": 346,
                        "word": "2"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 425,
                        "y": 346,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 440,
                        "y": 346,
                        "word": "额"
                    }
                ],
                "direction": 0,
                "height": 17,
                "rowId": 16
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 563,
                        "y": 346
                    },
                    {
                        "x": 625,
                        "y": 346
                    },
                    {
                        "x": 625,
                        "y": 363
                    },
                    {
                        "x": 563,
                        "y": 363
                    }
                ],
                "width": 18,
                "x": 585,
                "angle": -90,
                "y": 323,
                "word": "远期点",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 570,
                        "y": 347,
                        "word": "远"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 589,
                        "y": 347,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 606,
                        "y": 347,
                        "word": "点"
                    }
                ],
                "direction": 0,
                "height": 63,
                "rowId": 16
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 702,
                        "y": 346
                    },
                    {
                        "x": 754,
                        "y": 346
                    },
                    {
                        "x": 754,
                        "y": 359
                    },
                    {
                        "x": 702,
                        "y": 359
                    }
                ],
                "width": 13,
                "x": 721,
                "angle": -90,
                "y": 326,
                "word": "交割日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 11,
                        "x": 702,
                        "y": 346,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 11,
                        "x": 720,
                        "y": 346,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 11,
                        "x": 740,
                        "y": 346,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 52,
                "rowId": 16
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 788,
                        "y": 346
                    },
                    {
                        "x": 809,
                        "y": 346
                    },
                    {
                        "x": 809,
                        "y": 358
                    },
                    {
                        "x": 788,
                        "y": 358
                    }
                ],
                "width": 12,
                "x": 793,
                "angle": -90,
                "y": 342,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 10,
                        "x": 793,
                        "y": 346,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 21,
                "rowId": 16
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 826,
                        "y": 347
                    },
                    {
                        "x": 841,
                        "y": 347
                    },
                    {
                        "x": 841,
                        "y": 359
                    },
                    {
                        "x": 826,
                        "y": 359
                    }
                ],
                "width": 12,
                "x": 827,
                "angle": -90,
                "y": 345,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 10,
                        "x": 827,
                        "y": 347,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 15,
                "rowId": 16
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 862,
                        "y": 347
                    },
                    {
                        "x": 875,
                        "y": 347
                    },
                    {
                        "x": 875,
                        "y": 359
                    },
                    {
                        "x": 862,
                        "y": 359
                    }
                ],
                "width": 12,
                "x": 862,
                "angle": -90,
                "y": 346,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 10,
                        "x": 863,
                        "y": 347,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 13,
                "rowId": 16
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 113,
                        "y": 367
                    },
                    {
                        "x": 212,
                        "y": 366
                    },
                    {
                        "x": 212,
                        "y": 384
                    },
                    {
                        "x": 113,
                        "y": 385
                    }
                ],
                "width": 98,
                "x": 113,
                "angle": -1,
                "y": 366,
                "word": "委托有效期：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 117,
                        "y": 368,
                        "word": "委"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 134,
                        "y": 368,
                        "word": "托"
                    },
                    {
                        "prob": 100,
                        "w": 13,
                        "h": 15,
                        "x": 152,
                        "y": 367,
                        "word": "有"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 169,
                        "y": 367,
                        "word": "效"
                    },
                    {
                        "prob": 100,
                        "w": 15,
                        "h": 15,
                        "x": 186,
                        "y": 367,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 205,
                        "y": 367,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 17,
                "rowId": 17
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 253,
                        "y": 368
                    },
                    {
                        "x": 309,
                        "y": 368
                    },
                    {
                        "x": 309,
                        "y": 386
                    },
                    {
                        "x": 253,
                        "y": 386
                    }
                ],
                "width": 18,
                "x": 272,
                "angle": -90,
                "y": 348,
                "word": "年月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 258,
                        "y": 369,
                        "word": "年"
                    },
                    {
                        "prob": 99,
                        "w": 29,
                        "h": 16,
                        "x": 276,
                        "y": 369,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 54,
                "rowId": 17
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 326,
                        "y": 366
                    },
                    {
                        "x": 484,
                        "y": 368
                    },
                    {
                        "x": 484,
                        "y": 388
                    },
                    {
                        "x": 326,
                        "y": 386
                    }
                ],
                "width": 19,
                "x": 395,
                "angle": -88,
                "y": 296,
                "word": "日至年月日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 17,
                        "x": 329,
                        "y": 367,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 17,
                        "x": 345,
                        "y": 367,
                        "word": "至"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 17,
                        "x": 397,
                        "y": 367,
                        "word": "年"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 17,
                        "x": 433,
                        "y": 368,
                        "word": "月"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 17,
                        "x": 468,
                        "y": 368,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 159,
                "rowId": 17
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 406
                    },
                    {
                        "x": 900,
                        "y": 406
                    },
                    {
                        "x": 900,
                        "y": 423
                    },
                    {
                        "x": 619,
                        "y": 423
                    }
                ],
                "width": 18,
                "x": 751,
                "angle": -90,
                "y": 275,
                "word": "交易展期原因(仅展期委托时填写)：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 620,
                        "y": 407,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 637,
                        "y": 407,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 654,
                        "y": 407,
                        "word": "展"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 673,
                        "y": 407,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 690,
                        "y": 407,
                        "word": "原"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 707,
                        "y": 407,
                        "word": "因"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 732,
                        "y": 407,
                        "word": "("
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 741,
                        "y": 407,
                        "word": "仅"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 760,
                        "y": 407,
                        "word": "展"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 777,
                        "y": 407,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 794,
                        "y": 407,
                        "word": "委"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 811,
                        "y": 407,
                        "word": "托"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 830,
                        "y": 407,
                        "word": "时"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 847,
                        "y": 407,
                        "word": "填"
                    },
                    {
                        "prob": 100,
                        "w": 13,
                        "h": 15,
                        "x": 864,
                        "y": 407,
                        "word": "写"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 883,
                        "y": 407,
                        "word": ")"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 892,
                        "y": 407,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 280,
                "rowId": 18
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 101,
                        "y": 443
                    },
                    {
                        "x": 193,
                        "y": 443
                    },
                    {
                        "x": 193,
                        "y": 460
                    },
                    {
                        "x": 101,
                        "y": 460
                    }
                ],
                "width": 18,
                "x": 138,
                "angle": -90,
                "y": 405,
                "word": "口择期交割",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 15,
                        "x": 102,
                        "y": 443,
                        "word": "口"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 15,
                        "x": 120,
                        "y": 443,
                        "word": "择"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 138,
                        "y": 443,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 155,
                        "y": 443,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 19,
                        "h": 15,
                        "x": 171,
                        "y": 443,
                        "word": "割"
                    }
                ],
                "direction": 0,
                "height": 91,
                "rowId": 19
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 456
                    },
                    {
                        "x": 523,
                        "y": 458
                    },
                    {
                        "x": 523,
                        "y": 476
                    },
                    {
                        "x": 263,
                        "y": 475
                    }
                ],
                "width": 18,
                "x": 383,
                "angle": -89,
                "y": 336,
                "word": "原交易证实书编号：123456789",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 16,
                        "x": 266,
                        "y": 457,
                        "word": "原"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 16,
                        "x": 285,
                        "y": 457,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 16,
                        "x": 302,
                        "y": 457,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 16,
                        "x": 318,
                        "y": 457,
                        "word": "证"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 16,
                        "x": 337,
                        "y": 457,
                        "word": "实"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 16,
                        "x": 356,
                        "y": 457,
                        "word": "书"
                    },
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 16,
                        "x": 380,
                        "y": 457,
                        "word": "编"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 16,
                        "x": 389,
                        "y": 457,
                        "word": "号"
                    },
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 16,
                        "x": 406,
                        "y": 457,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 25,
                        "h": 16,
                        "x": 423,
                        "y": 457,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 16,
                        "x": 451,
                        "y": 458,
                        "word": "2"
                    },
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 16,
                        "x": 458,
                        "y": 458,
                        "word": "3"
                    },
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 16,
                        "x": 468,
                        "y": 458,
                        "word": "4"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 16,
                        "x": 477,
                        "y": 458,
                        "word": "5"
                    },
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 16,
                        "x": 484,
                        "y": 458,
                        "word": "6"
                    },
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 16,
                        "x": 494,
                        "y": 458,
                        "word": "7"
                    },
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 16,
                        "x": 503,
                        "y": 458,
                        "word": "8"
                    },
                    {
                        "prob": 99,
                        "w": 1,
                        "h": 16,
                        "x": 515,
                        "y": 458,
                        "word": "9"
                    }
                ],
                "direction": 0,
                "height": 260,
                "rowId": 20
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 101,
                        "y": 478
                    },
                    {
                        "x": 193,
                        "y": 478
                    },
                    {
                        "x": 193,
                        "y": 496
                    },
                    {
                        "x": 101,
                        "y": 496
                    }
                ],
                "width": 18,
                "x": 138,
                "angle": -90,
                "y": 441,
                "word": "提前交割",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 118,
                        "y": 479,
                        "word": "提"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 137,
                        "y": 479,
                        "word": "前"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 156,
                        "y": 479,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 173,
                        "y": 479,
                        "word": "割"
                    }
                ],
                "direction": 0,
                "height": 91,
                "rowId": 21
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 264,
                        "y": 478
                    },
                    {
                        "x": 388,
                        "y": 478
                    },
                    {
                        "x": 388,
                        "y": 496
                    },
                    {
                        "x": 264,
                        "y": 496
                    }
                ],
                "width": 17,
                "x": 318,
                "angle": -89,
                "y": 425,
                "word": "交割/展期日期：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 267,
                        "y": 478,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 285,
                        "y": 478,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 300,
                        "y": 478,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 312,
                        "y": 478,
                        "word": "展"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 327,
                        "y": 478,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 347,
                        "y": 478,
                        "word": "日"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 15,
                        "x": 363,
                        "y": 478,
                        "word": "期"
                    },
                    {
                        "prob": 97,
                        "w": 3,
                        "h": 15,
                        "x": 381,
                        "y": 478,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 124,
                "rowId": 21
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 437,
                        "y": 477
                    },
                    {
                        "x": 462,
                        "y": 477
                    },
                    {
                        "x": 462,
                        "y": 497
                    },
                    {
                        "x": 437,
                        "y": 497
                    }
                ],
                "width": 20,
                "x": 440,
                "angle": -90,
                "y": 475,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 17,
                        "x": 440,
                        "y": 478,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 25,
                "rowId": 21
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 489,
                        "y": 479
                    },
                    {
                        "x": 514,
                        "y": 479
                    },
                    {
                        "x": 514,
                        "y": 497
                    },
                    {
                        "x": 489,
                        "y": 497
                    }
                ],
                "width": 19,
                "x": 493,
                "angle": -90,
                "y": 476,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 16,
                        "x": 494,
                        "y": 480,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 25,
                "rowId": 21
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 542,
                        "y": 478
                    },
                    {
                        "x": 566,
                        "y": 478
                    },
                    {
                        "x": 566,
                        "y": 497
                    },
                    {
                        "x": 542,
                        "y": 497
                    }
                ],
                "width": 18,
                "x": 545,
                "angle": -90,
                "y": 476,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 549,
                        "y": 479,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 23,
                "rowId": 21
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 266,
                        "y": 503
                    },
                    {
                        "x": 321,
                        "y": 503
                    },
                    {
                        "x": 321,
                        "y": 519
                    },
                    {
                        "x": 266,
                        "y": 519
                    }
                ],
                "width": 17,
                "x": 285,
                "angle": -90,
                "y": 483,
                "word": "币种：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 14,
                        "x": 269,
                        "y": 503,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 284,
                        "y": 503,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 14,
                        "x": 304,
                        "y": 503,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 56,
                "rowId": 22
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 369,
                        "y": 502
                    },
                    {
                        "x": 492,
                        "y": 501
                    },
                    {
                        "x": 493,
                        "y": 519
                    },
                    {
                        "x": 370,
                        "y": 521
                    }
                ],
                "width": 123,
                "x": 369,
                "angle": 0,
                "y": 501,
                "word": "交割/展期金额：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 371,
                        "y": 503,
                        "word": "交"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 16,
                        "x": 389,
                        "y": 503,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 407,
                        "y": 503,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 416,
                        "y": 503,
                        "word": "展"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 432,
                        "y": 502,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 450,
                        "y": 502,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 468,
                        "y": 502,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 486,
                        "y": 502,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 18,
                "rowId": 22
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 101,
                        "y": 515
                    },
                    {
                        "x": 193,
                        "y": 515
                    },
                    {
                        "x": 193,
                        "y": 533
                    },
                    {
                        "x": 101,
                        "y": 533
                    }
                ],
                "width": 18,
                "x": 138,
                "angle": -90,
                "y": 478,
                "word": "向后展期",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 120,
                        "y": 516,
                        "word": "向"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 137,
                        "y": 516,
                        "word": "后"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 156,
                        "y": 516,
                        "word": "展"
                    },
                    {
                        "prob": 100,
                        "w": 15,
                        "h": 15,
                        "x": 173,
                        "y": 516,
                        "word": "期"
                    }
                ],
                "direction": 0,
                "height": 91,
                "rowId": 23
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 264,
                        "y": 585
                    },
                    {
                        "x": 327,
                        "y": 585
                    },
                    {
                        "x": 327,
                        "y": 603
                    },
                    {
                        "x": 264,
                        "y": 603
                    }
                ],
                "width": 17,
                "x": 287,
                "angle": -90,
                "y": 563,
                "word": "第一笔：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 265,
                        "y": 586,
                        "word": "第"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 284,
                        "y": 586,
                        "word": "一"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 301,
                        "y": 586,
                        "word": "笔"
                    },
                    {
                        "prob": 98,
                        "w": 3,
                        "h": 15,
                        "x": 319,
                        "y": 586,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 62,
                "rowId": 24
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 585
                    },
                    {
                        "x": 850,
                        "y": 585
                    },
                    {
                        "x": 850,
                        "y": 603
                    },
                    {
                        "x": 619,
                        "y": 603
                    }
                ],
                "width": 17,
                "x": 727,
                "angle": -90,
                "y": 479,
                "word": "第二笔：(如超过两笔可附页)",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 620,
                        "y": 585,
                        "word": "第"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 638,
                        "y": 585,
                        "word": "二"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 656,
                        "y": 585,
                        "word": "笔"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 674,
                        "y": 585,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 690,
                        "y": 585,
                        "word": "("
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 699,
                        "y": 585,
                        "word": "如"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 717,
                        "y": 585,
                        "word": "超"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 735,
                        "y": 585,
                        "word": "过"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 750,
                        "y": 585,
                        "word": "两"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 771,
                        "y": 585,
                        "word": "笔"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 786,
                        "y": 585,
                        "word": "可"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 804,
                        "y": 585,
                        "word": "附"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 822,
                        "y": 585,
                        "word": "页"
                    },
                    {
                        "prob": 99,
                        "w": 8,
                        "h": 15,
                        "x": 840,
                        "y": 585,
                        "word": ")"
                    }
                ],
                "direction": 0,
                "height": 231,
                "rowId": 25
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 610
                    },
                    {
                        "x": 403,
                        "y": 608
                    },
                    {
                        "x": 404,
                        "y": 626
                    },
                    {
                        "x": 263,
                        "y": 628
                    }
                ],
                "width": 141,
                "x": 262,
                "angle": 0,
                "y": 609,
                "word": "交易币种：货币1",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 16,
                        "x": 266,
                        "y": 610,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 284,
                        "y": 610,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 302,
                        "y": 610,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 318,
                        "y": 610,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 336,
                        "y": 609,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 354,
                        "y": 609,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 372,
                        "y": 609,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 391,
                        "y": 609,
                        "word": "1"
                    }
                ],
                "direction": 0,
                "height": 17,
                "rowId": 26
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 435,
                        "y": 610
                    },
                    {
                        "x": 498,
                        "y": 610
                    },
                    {
                        "x": 498,
                        "y": 626
                    },
                    {
                        "x": 435,
                        "y": 626
                    }
                ],
                "width": 16,
                "x": 459,
                "angle": -90,
                "y": 587,
                "word": "/货币2",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 438,
                        "y": 610,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 446,
                        "y": 610,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 463,
                        "y": 610,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 484,
                        "y": 610,
                        "word": "2"
                    }
                ],
                "direction": 0,
                "height": 63,
                "rowId": 26
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 610
                    },
                    {
                        "x": 760,
                        "y": 610
                    },
                    {
                        "x": 760,
                        "y": 628
                    },
                    {
                        "x": 619,
                        "y": 628
                    }
                ],
                "width": 17,
                "x": 681,
                "angle": -90,
                "y": 549,
                "word": "交易币种：货币1",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 620,
                        "y": 610,
                        "word": "交"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 15,
                        "x": 638,
                        "y": 610,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 656,
                        "y": 610,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 672,
                        "y": 610,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 692,
                        "y": 610,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 708,
                        "y": 610,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 728,
                        "y": 610,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 747,
                        "y": 610,
                        "word": "1"
                    }
                ],
                "direction": 0,
                "height": 140,
                "rowId": 26
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 789,
                        "y": 610
                    },
                    {
                        "x": 852,
                        "y": 610
                    },
                    {
                        "x": 852,
                        "y": 626
                    },
                    {
                        "x": 789,
                        "y": 626
                    }
                ],
                "width": 16,
                "x": 812,
                "angle": -90,
                "y": 587,
                "word": "/货币2",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 792,
                        "y": 610,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 800,
                        "y": 610,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 819,
                        "y": 610,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 14,
                        "x": 838,
                        "y": 610,
                        "word": "2"
                    }
                ],
                "direction": 0,
                "height": 63,
                "rowId": 26
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 632
                    },
                    {
                        "x": 395,
                        "y": 632
                    },
                    {
                        "x": 395,
                        "y": 649
                    },
                    {
                        "x": 263,
                        "y": 649
                    }
                ],
                "width": 18,
                "x": 320,
                "angle": -90,
                "y": 574,
                "word": "交易类型：买入",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 266,
                        "y": 633,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 285,
                        "y": 633,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 302,
                        "y": 633,
                        "word": "类"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 319,
                        "y": 633,
                        "word": "型"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 338,
                        "y": 633,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 360,
                        "y": 633,
                        "word": "买"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 380,
                        "y": 633,
                        "word": "入"
                    }
                ],
                "direction": 0,
                "height": 133,
                "rowId": 27
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 448,
                        "y": 632
                    },
                    {
                        "x": 590,
                        "y": 632
                    },
                    {
                        "x": 590,
                        "y": 649
                    },
                    {
                        "x": 448,
                        "y": 649
                    }
                ],
                "width": 18,
                "x": 510,
                "angle": -90,
                "y": 570,
                "word": "口货币1看涨期权",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 451,
                        "y": 633,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 468,
                        "y": 633,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 486,
                        "y": 633,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 507,
                        "y": 633,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 518,
                        "y": 633,
                        "word": "看"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 537,
                        "y": 633,
                        "word": "涨"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 556,
                        "y": 633,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 573,
                        "y": 633,
                        "word": "权"
                    }
                ],
                "direction": 0,
                "height": 142,
                "rowId": 27
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 632
                    },
                    {
                        "x": 752,
                        "y": 632
                    },
                    {
                        "x": 752,
                        "y": 649
                    },
                    {
                        "x": 619,
                        "y": 649
                    }
                ],
                "width": 18,
                "x": 677,
                "angle": -90,
                "y": 575,
                "word": "交易类型：口买入",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 620,
                        "y": 633,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 639,
                        "y": 633,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 656,
                        "y": 633,
                        "word": "类"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 675,
                        "y": 633,
                        "word": "型"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 692,
                        "y": 633,
                        "word": "："
                    },
                    {
                        "prob": 100,
                        "w": 13,
                        "h": 15,
                        "x": 700,
                        "y": 633,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 716,
                        "y": 633,
                        "word": "买"
                    },
                    {
                        "prob": 99,
                        "w": 18,
                        "h": 15,
                        "x": 733,
                        "y": 633,
                        "word": "入"
                    }
                ],
                "direction": 0,
                "height": 132,
                "rowId": 27
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 803,
                        "y": 632
                    },
                    {
                        "x": 945,
                        "y": 632
                    },
                    {
                        "x": 945,
                        "y": 649
                    },
                    {
                        "x": 803,
                        "y": 649
                    }
                ],
                "width": 18,
                "x": 865,
                "angle": -90,
                "y": 570,
                "word": "口货币1看涨期权",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 804,
                        "y": 632,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 822,
                        "y": 632,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 842,
                        "y": 632,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 862,
                        "y": 632,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 873,
                        "y": 632,
                        "word": "看"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 891,
                        "y": 632,
                        "word": "涨"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 911,
                        "y": 632,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 926,
                        "y": 632,
                        "word": "权"
                    }
                ],
                "direction": 0,
                "height": 142,
                "rowId": 27
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 337,
                        "y": 654
                    },
                    {
                        "x": 394,
                        "y": 654
                    },
                    {
                        "x": 394,
                        "y": 670
                    },
                    {
                        "x": 337,
                        "y": 670
                    }
                ],
                "width": 17,
                "x": 357,
                "angle": -90,
                "y": 634,
                "word": "口卖出",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 13,
                        "h": 14,
                        "x": 340,
                        "y": 655,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 14,
                        "x": 356,
                        "y": 655,
                        "word": "卖"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 376,
                        "y": 655,
                        "word": "出"
                    }
                ],
                "direction": 0,
                "height": 57,
                "rowId": 28
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 444,
                        "y": 654
                    },
                    {
                        "x": 586,
                        "y": 654
                    },
                    {
                        "x": 586,
                        "y": 671
                    },
                    {
                        "x": 444,
                        "y": 671
                    }
                ],
                "width": 18,
                "x": 506,
                "angle": -90,
                "y": 592,
                "word": "口货币1看跌期权",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 445,
                        "y": 654,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 463,
                        "y": 654,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 480,
                        "y": 654,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 503,
                        "y": 654,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 514,
                        "y": 654,
                        "word": "看"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 532,
                        "y": 654,
                        "word": "跌"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 550,
                        "y": 654,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 567,
                        "y": 654,
                        "word": "权"
                    }
                ],
                "direction": 0,
                "height": 142,
                "rowId": 28
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 693,
                        "y": 653
                    },
                    {
                        "x": 748,
                        "y": 655
                    },
                    {
                        "x": 747,
                        "y": 672
                    },
                    {
                        "x": 693,
                        "y": 670
                    }
                ],
                "width": 16,
                "x": 712,
                "angle": -87,
                "y": 635,
                "word": "口卖出",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 696,
                        "y": 655,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 14,
                        "x": 712,
                        "y": 655,
                        "word": "卖"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 732,
                        "y": 656,
                        "word": "出"
                    }
                ],
                "direction": 0,
                "height": 55,
                "rowId": 28
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 798,
                        "y": 654
                    },
                    {
                        "x": 941,
                        "y": 654
                    },
                    {
                        "x": 941,
                        "y": 671
                    },
                    {
                        "x": 798,
                        "y": 671
                    }
                ],
                "width": 18,
                "x": 861,
                "angle": -90,
                "y": 592,
                "word": "口货币1看跌期权",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 799,
                        "y": 654,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 817,
                        "y": 654,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 837,
                        "y": 654,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 857,
                        "y": 654,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 868,
                        "y": 654,
                        "word": "看"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 886,
                        "y": 654,
                        "word": "跌"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 904,
                        "y": 654,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 921,
                        "y": 654,
                        "word": "权"
                    }
                ],
                "direction": 0,
                "height": 142,
                "rowId": 28
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 677
                    },
                    {
                        "x": 205,
                        "y": 677
                    },
                    {
                        "x": 205,
                        "y": 695
                    },
                    {
                        "x": 44,
                        "y": 695
                    }
                ],
                "width": 17,
                "x": 116,
                "angle": -90,
                "y": 605,
                "word": "口人民币对外汇期权",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 15,
                        "x": 48,
                        "y": 677,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 66,
                        "y": 677,
                        "word": "人"
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 15,
                        "x": 84,
                        "y": 677,
                        "word": "民"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 100,
                        "y": 677,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 115,
                        "y": 677,
                        "word": "对"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 136,
                        "y": 677,
                        "word": "外"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 152,
                        "y": 677,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 170,
                        "y": 677,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 188,
                        "y": 677,
                        "word": "权"
                    }
                ],
                "direction": 0,
                "height": 161,
                "rowId": 29
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 677
                    },
                    {
                        "x": 346,
                        "y": 677
                    },
                    {
                        "x": 346,
                        "y": 695
                    },
                    {
                        "x": 263,
                        "y": 695
                    }
                ],
                "width": 16,
                "x": 295,
                "angle": -90,
                "y": 644,
                "word": "执行汇率：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 266,
                        "y": 678,
                        "word": "执"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 285,
                        "y": 678,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 301,
                        "y": 678,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 318,
                        "y": 678,
                        "word": "率"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 337,
                        "y": 678,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 82,
                "rowId": 29
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 618,
                        "y": 677
                    },
                    {
                        "x": 701,
                        "y": 677
                    },
                    {
                        "x": 701,
                        "y": 695
                    },
                    {
                        "x": 618,
                        "y": 695
                    }
                ],
                "width": 16,
                "x": 650,
                "angle": -90,
                "y": 644,
                "word": "执行汇率：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 621,
                        "y": 678,
                        "word": "执"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 640,
                        "y": 678,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 654,
                        "y": 678,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 673,
                        "y": 678,
                        "word": "率"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 692,
                        "y": 678,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 82,
                "rowId": 30
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 700
                    },
                    {
                        "x": 361,
                        "y": 700
                    },
                    {
                        "x": 361,
                        "y": 718
                    },
                    {
                        "x": 263,
                        "y": 718
                    }
                ],
                "width": 17,
                "x": 304,
                "angle": -90,
                "y": 660,
                "word": "货币1金额：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 266,
                        "y": 700,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 284,
                        "y": 700,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 306,
                        "y": 700,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 318,
                        "y": 700,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 336,
                        "y": 700,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 356,
                        "y": 700,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 99,
                "rowId": 31
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 700
                    },
                    {
                        "x": 719,
                        "y": 700
                    },
                    {
                        "x": 719,
                        "y": 718
                    },
                    {
                        "x": 619,
                        "y": 718
                    }
                ],
                "width": 17,
                "x": 661,
                "angle": -90,
                "y": 660,
                "word": "货币1金额：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 620,
                        "y": 701,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 641,
                        "y": 701,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 662,
                        "y": 701,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 672,
                        "y": 701,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 691,
                        "y": 701,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 709,
                        "y": 701,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 99,
                "rowId": 32
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 710
                    },
                    {
                        "x": 239,
                        "y": 710
                    },
                    {
                        "x": 239,
                        "y": 728
                    },
                    {
                        "x": 44,
                        "y": 728
                    }
                ],
                "width": 16,
                "x": 133,
                "angle": -89,
                "y": 620,
                "word": "口人民币对外汇期权组合",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 47,
                        "y": 711,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 66,
                        "y": 711,
                        "word": "人"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 85,
                        "y": 711,
                        "word": "民"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 102,
                        "y": 711,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 117,
                        "y": 711,
                        "word": "对"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 136,
                        "y": 711,
                        "word": "外"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 153,
                        "y": 711,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 170,
                        "y": 711,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 185,
                        "y": 711,
                        "word": "权"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 205,
                        "y": 711,
                        "word": "组"
                    },
                    {
                        "prob": 99,
                        "w": 18,
                        "h": 15,
                        "x": 221,
                        "y": 711,
                        "word": "合"
                    }
                ],
                "direction": 0,
                "height": 197,
                "rowId": 33
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 722
                    },
                    {
                        "x": 361,
                        "y": 722
                    },
                    {
                        "x": 361,
                        "y": 740
                    },
                    {
                        "x": 263,
                        "y": 740
                    }
                ],
                "width": 17,
                "x": 304,
                "angle": -90,
                "y": 682,
                "word": "货币2金额：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 266,
                        "y": 723,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 285,
                        "y": 723,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 306,
                        "y": 723,
                        "word": "2"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 318,
                        "y": 723,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 335,
                        "y": 723,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 354,
                        "y": 723,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 99,
                "rowId": 34
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 722
                    },
                    {
                        "x": 717,
                        "y": 722
                    },
                    {
                        "x": 717,
                        "y": 739
                    },
                    {
                        "x": 619,
                        "y": 739
                    }
                ],
                "width": 16,
                "x": 661,
                "angle": -90,
                "y": 682,
                "word": "货币2金额：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 620,
                        "y": 722,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 639,
                        "y": 722,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 9,
                        "h": 14,
                        "x": 660,
                        "y": 722,
                        "word": "2"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 672,
                        "y": 722,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 689,
                        "y": 722,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 708,
                        "y": 722,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 98,
                "rowId": 35
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 746
                    },
                    {
                        "x": 330,
                        "y": 746
                    },
                    {
                        "x": 330,
                        "y": 762
                    },
                    {
                        "x": 263,
                        "y": 762
                    }
                ],
                "width": 16,
                "x": 288,
                "angle": -90,
                "y": 720,
                "word": "起息日：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 266,
                        "y": 746,
                        "word": "起"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 285,
                        "y": 746,
                        "word": "息"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 304,
                        "y": 746,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 14,
                        "x": 320,
                        "y": 746,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 67,
                "rowId": 36
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 357,
                        "y": 743
                    },
                    {
                        "x": 384,
                        "y": 743
                    },
                    {
                        "x": 384,
                        "y": 765
                    },
                    {
                        "x": 357,
                        "y": 765
                    }
                ],
                "width": 22,
                "x": 360,
                "angle": -90,
                "y": 741,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 19,
                        "x": 364,
                        "y": 744,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 27,
                "rowId": 36
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 412,
                        "y": 745
                    },
                    {
                        "x": 432,
                        "y": 745
                    },
                    {
                        "x": 432,
                        "y": 763
                    },
                    {
                        "x": 412,
                        "y": 763
                    }
                ],
                "width": 18,
                "x": 414,
                "angle": -90,
                "y": 744,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 414,
                        "y": 746,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 20,
                "rowId": 36
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 464,
                        "y": 743
                    },
                    {
                        "x": 487,
                        "y": 743
                    },
                    {
                        "x": 487,
                        "y": 764
                    },
                    {
                        "x": 464,
                        "y": 764
                    }
                ],
                "width": 21,
                "x": 465,
                "angle": -90,
                "y": 743,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 18,
                        "x": 468,
                        "y": 744,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 22,
                "rowId": 36
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 744
                    },
                    {
                        "x": 686,
                        "y": 744
                    },
                    {
                        "x": 686,
                        "y": 762
                    },
                    {
                        "x": 619,
                        "y": 762
                    }
                ],
                "width": 17,
                "x": 644,
                "angle": -90,
                "y": 720,
                "word": "起息日：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 620,
                        "y": 745,
                        "word": "起"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 640,
                        "y": 745,
                        "word": "息"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 658,
                        "y": 745,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 675,
                        "y": 745,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 66,
                "rowId": 36
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 712,
                        "y": 743
                    },
                    {
                        "x": 738,
                        "y": 743
                    },
                    {
                        "x": 738,
                        "y": 764
                    },
                    {
                        "x": 712,
                        "y": 764
                    }
                ],
                "width": 21,
                "x": 715,
                "angle": -90,
                "y": 742,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 20,
                        "h": 18,
                        "x": 712,
                        "y": 744,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 25,
                "rowId": 36
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 770,
                        "y": 746
                    },
                    {
                        "x": 786,
                        "y": 746
                    },
                    {
                        "x": 786,
                        "y": 762
                    },
                    {
                        "x": 770,
                        "y": 762
                    }
                ],
                "width": 16,
                "x": 770,
                "angle": -90,
                "y": 746,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 14,
                        "x": 770,
                        "y": 747,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 16,
                "rowId": 36
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 820,
                        "y": 746
                    },
                    {
                        "x": 839,
                        "y": 746
                    },
                    {
                        "x": 839,
                        "y": 769
                    },
                    {
                        "x": 820,
                        "y": 769
                    }
                ],
                "width": 23,
                "x": 819,
                "angle": -90,
                "y": 748,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 20,
                        "x": 825,
                        "y": 747,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 19,
                "rowId": 36
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 768
                    },
                    {
                        "x": 331,
                        "y": 768
                    },
                    {
                        "x": 331,
                        "y": 785
                    },
                    {
                        "x": 263,
                        "y": 785
                    }
                ],
                "width": 18,
                "x": 288,
                "angle": -90,
                "y": 743,
                "word": "到期日：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 266,
                        "y": 768,
                        "word": "到"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 284,
                        "y": 768,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 304,
                        "y": 768,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 326,
                        "y": 768,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 68,
                "rowId": 37
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 359,
                        "y": 764
                    },
                    {
                        "x": 384,
                        "y": 764
                    },
                    {
                        "x": 384,
                        "y": 786
                    },
                    {
                        "x": 359,
                        "y": 786
                    }
                ],
                "width": 23,
                "x": 360,
                "angle": -90,
                "y": 762,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 19,
                        "x": 364,
                        "y": 765,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 26,
                "rowId": 37
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 415,
                        "y": 769
                    },
                    {
                        "x": 431,
                        "y": 769
                    },
                    {
                        "x": 431,
                        "y": 784
                    },
                    {
                        "x": 415,
                        "y": 784
                    }
                ],
                "width": 15,
                "x": 415,
                "angle": -90,
                "y": 768,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 12,
                        "x": 415,
                        "y": 769,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 16,
                "rowId": 37
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 466,
                        "y": 764
                    },
                    {
                        "x": 484,
                        "y": 764
                    },
                    {
                        "x": 484,
                        "y": 809
                    },
                    {
                        "x": 466,
                        "y": 809
                    }
                ],
                "width": 45,
                "x": 453,
                "angle": -90,
                "y": 779,
                "word": "日日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 469,
                        "y": 771,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 16,
                        "x": 467,
                        "y": 792,
                        "word": "日"
                    }
                ],
                "direction": 1,
                "height": 17,
                "rowId": 39
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 768
                    },
                    {
                        "x": 686,
                        "y": 768
                    },
                    {
                        "x": 686,
                        "y": 785
                    },
                    {
                        "x": 619,
                        "y": 785
                    }
                ],
                "width": 18,
                "x": 644,
                "angle": -90,
                "y": 744,
                "word": "到期日：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 622,
                        "y": 769,
                        "word": "到"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 639,
                        "y": 769,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 658,
                        "y": 769,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 674,
                        "y": 769,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 66,
                "rowId": 40
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 714,
                        "y": 765
                    },
                    {
                        "x": 738,
                        "y": 765
                    },
                    {
                        "x": 738,
                        "y": 786
                    },
                    {
                        "x": 714,
                        "y": 786
                    }
                ],
                "width": 21,
                "x": 715,
                "angle": -90,
                "y": 764,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 18,
                        "x": 717,
                        "y": 766,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 24,
                "rowId": 40
            },
            {
                "prob": 91,
                "pos": [
                    {
                        "x": 767,
                        "y": 789
                    },
                    {
                        "x": 776,
                        "y": 764
                    },
                    {
                        "x": 788,
                        "y": 768
                    },
                    {
                        "x": 780,
                        "y": 794
                    }
                ],
                "width": 26,
                "x": 765,
                "angle": -72,
                "y": 772,
                "word": "1凶",
                "charInfo": [
                    {
                        "prob": 92,
                        "w": 5,
                        "h": 11,
                        "x": 768,
                        "y": 789,
                        "word": "1"
                    },
                    {
                        "prob": 90,
                        "w": 18,
                        "h": 11,
                        "x": 775,
                        "y": 783,
                        "word": "凶"
                    }
                ],
                "direction": 0,
                "height": 13,
                "rowId": 40
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 822,
                        "y": 763
                    },
                    {
                        "x": 837,
                        "y": 763
                    },
                    {
                        "x": 837,
                        "y": 809
                    },
                    {
                        "x": 822,
                        "y": 809
                    }
                ],
                "width": 46,
                "x": 807,
                "angle": -90,
                "y": 778,
                "word": "日日",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 15,
                        "h": 16,
                        "x": 823,
                        "y": 770,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 16,
                        "x": 823,
                        "y": 792,
                        "word": "日"
                    }
                ],
                "direction": 1,
                "height": 14,
                "rowId": 40
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 790
                    },
                    {
                        "x": 339,
                        "y": 790
                    },
                    {
                        "x": 339,
                        "y": 807
                    },
                    {
                        "x": 263,
                        "y": 807
                    }
                ],
                "width": 18,
                "x": 292,
                "angle": -90,
                "y": 760,
                "word": "交割日：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 265,
                        "y": 791,
                        "word": "交"
                    },
                    {
                        "prob": 100,
                        "w": 16,
                        "h": 15,
                        "x": 283,
                        "y": 791,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 15,
                        "x": 305,
                        "y": 791,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 2,
                        "h": 15,
                        "x": 321,
                        "y": 791,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 77,
                "rowId": 42
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 358,
                        "y": 787
                    },
                    {
                        "x": 384,
                        "y": 787
                    },
                    {
                        "x": 384,
                        "y": 807
                    },
                    {
                        "x": 358,
                        "y": 807
                    }
                ],
                "width": 19,
                "x": 362,
                "angle": -90,
                "y": 784,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 21,
                        "h": 17,
                        "x": 358,
                        "y": 788,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 27,
                "rowId": 42
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 412,
                        "y": 788
                    },
                    {
                        "x": 433,
                        "y": 788
                    },
                    {
                        "x": 433,
                        "y": 807
                    },
                    {
                        "x": 412,
                        "y": 807
                    }
                ],
                "width": 18,
                "x": 414,
                "angle": -90,
                "y": 787,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 16,
                        "x": 413,
                        "y": 789,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 21,
                "rowId": 42
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 791
                    },
                    {
                        "x": 686,
                        "y": 791
                    },
                    {
                        "x": 686,
                        "y": 807
                    },
                    {
                        "x": 619,
                        "y": 807
                    }
                ],
                "width": 17,
                "x": 644,
                "angle": -90,
                "y": 766,
                "word": "交割日：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 620,
                        "y": 791,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 639,
                        "y": 791,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 658,
                        "y": 791,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 674,
                        "y": 791,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 66,
                "rowId": 44
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 711,
                        "y": 788
                    },
                    {
                        "x": 738,
                        "y": 788
                    },
                    {
                        "x": 738,
                        "y": 808
                    },
                    {
                        "x": 711,
                        "y": 808
                    }
                ],
                "width": 20,
                "x": 715,
                "angle": -90,
                "y": 786,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 17,
                        "x": 717,
                        "y": 789,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 26,
                "rowId": 44
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 767,
                        "y": 788
                    },
                    {
                        "x": 789,
                        "y": 788
                    },
                    {
                        "x": 789,
                        "y": 806
                    },
                    {
                        "x": 767,
                        "y": 806
                    }
                ],
                "width": 19,
                "x": 768,
                "angle": -90,
                "y": 786,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 769,
                        "y": 789,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 22,
                "rowId": 44
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 813
                    },
                    {
                        "x": 531,
                        "y": 813
                    },
                    {
                        "x": 531,
                        "y": 832
                    },
                    {
                        "x": 263,
                        "y": 832
                    }
                ],
                "width": 19,
                "x": 387,
                "angle": -90,
                "y": 688,
                "word": "交割方式：口全额交割/口差额交割",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 266,
                        "y": 814,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 284,
                        "y": 814,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 302,
                        "y": 814,
                        "word": "方"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 320,
                        "y": 814,
                        "word": "式"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 16,
                        "x": 338,
                        "y": 814,
                        "word": "："
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 16,
                        "x": 344,
                        "y": 814,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 362,
                        "y": 814,
                        "word": "全"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 380,
                        "y": 814,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 398,
                        "y": 814,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 416,
                        "y": 814,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 16,
                        "x": 432,
                        "y": 814,
                        "word": "/"
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 16,
                        "x": 443,
                        "y": 814,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 459,
                        "y": 814,
                        "word": "差"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 477,
                        "y": 814,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 494,
                        "y": 814,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 19,
                        "h": 16,
                        "x": 510,
                        "y": 814,
                        "word": "割"
                    }
                ],
                "direction": 0,
                "height": 269,
                "rowId": 46
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 813
                    },
                    {
                        "x": 886,
                        "y": 813
                    },
                    {
                        "x": 886,
                        "y": 832
                    },
                    {
                        "x": 619,
                        "y": 832
                    }
                ],
                "width": 19,
                "x": 743,
                "angle": -90,
                "y": 689,
                "word": "交割方式：口全额交割/口差额交割",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 620,
                        "y": 814,
                        "word": "交"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 16,
                        "x": 638,
                        "y": 814,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 656,
                        "y": 814,
                        "word": "方"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 674,
                        "y": 814,
                        "word": "式"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 16,
                        "x": 692,
                        "y": 814,
                        "word": "："
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 16,
                        "x": 701,
                        "y": 814,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 717,
                        "y": 814,
                        "word": "全"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 735,
                        "y": 814,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 753,
                        "y": 814,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 768,
                        "y": 814,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 786,
                        "y": 814,
                        "word": "/"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 16,
                        "x": 795,
                        "y": 814,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 813,
                        "y": 814,
                        "word": "差"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 831,
                        "y": 814,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 848,
                        "y": 814,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 16,
                        "x": 864,
                        "y": 814,
                        "word": "割"
                    }
                ],
                "direction": 0,
                "height": 266,
                "rowId": 46
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 861
                    },
                    {
                        "x": 441,
                        "y": 861
                    },
                    {
                        "x": 441,
                        "y": 880
                    },
                    {
                        "x": 44,
                        "y": 880
                    }
                ],
                "width": 18,
                "x": 232,
                "angle": -89,
                "y": 671,
                "word": "口人民币对外汇期权交易行权原交易证实书编号：",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 16,
                        "h": 16,
                        "x": 45,
                        "y": 862,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 65,
                        "y": 862,
                        "word": "人"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 83,
                        "y": 862,
                        "word": "民"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 99,
                        "y": 862,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 117,
                        "y": 862,
                        "word": "对"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 135,
                        "y": 862,
                        "word": "外"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 150,
                        "y": 862,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 168,
                        "y": 862,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 186,
                        "y": 862,
                        "word": "权"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 204,
                        "y": 862,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 222,
                        "y": 862,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 238,
                        "y": 862,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 256,
                        "y": 862,
                        "word": "权"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 292,
                        "y": 862,
                        "word": "原"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 310,
                        "y": 862,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 326,
                        "y": 862,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 344,
                        "y": 862,
                        "word": "证"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 16,
                        "x": 362,
                        "y": 862,
                        "word": "实"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 380,
                        "y": 862,
                        "word": "书"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 395,
                        "y": 862,
                        "word": "编"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 413,
                        "y": 862,
                        "word": "号"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 430,
                        "y": 862,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 397,
                "rowId": 47
            },
            {
                "prob": 95,
                "pos": [
                    {
                        "x": 97,
                        "y": 883
                    },
                    {
                        "x": 356,
                        "y": 883
                    },
                    {
                        "x": 356,
                        "y": 900
                    },
                    {
                        "x": 97,
                        "y": 900
                    }
                ],
                "width": 17,
                "x": 216,
                "angle": -89,
                "y": 761,
                "word": "口全额交割：口结汇口售汇币种",
                "charInfo": [
                    {
                        "prob": 75,
                        "w": 14,
                        "h": 15,
                        "x": 98,
                        "y": 883,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 116,
                        "y": 883,
                        "word": "全"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 134,
                        "y": 883,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 151,
                        "y": 883,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 167,
                        "y": 883,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 185,
                        "y": 883,
                        "word": "："
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 15,
                        "x": 203,
                        "y": 883,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 221,
                        "y": 883,
                        "word": "结"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 239,
                        "y": 883,
                        "word": "汇"
                    },
                    {
                        "prob": 65,
                        "w": 12,
                        "h": 15,
                        "x": 257,
                        "y": 883,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 272,
                        "y": 883,
                        "word": "售"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 289,
                        "y": 883,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 318,
                        "y": 883,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 334,
                        "y": 883,
                        "word": "种"
                    }
                ],
                "direction": 0,
                "height": 259,
                "rowId": 48
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 408,
                        "y": 884
                    },
                    {
                        "x": 488,
                        "y": 884
                    },
                    {
                        "x": 488,
                        "y": 900
                    },
                    {
                        "x": 408,
                        "y": 900
                    }
                ],
                "width": 16,
                "x": 440,
                "angle": -90,
                "y": 853,
                "word": "交割金额",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 411,
                        "y": 884,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 431,
                        "y": 884,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 14,
                        "x": 449,
                        "y": 884,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 465,
                        "y": 884,
                        "word": "额"
                    }
                ],
                "direction": 0,
                "height": 80,
                "rowId": 48
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 560,
                        "y": 884
                    },
                    {
                        "x": 634,
                        "y": 884
                    },
                    {
                        "x": 634,
                        "y": 900
                    },
                    {
                        "x": 560,
                        "y": 900
                    }
                ],
                "width": 16,
                "x": 589,
                "angle": -90,
                "y": 856,
                "word": "执行汇率",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 563,
                        "y": 884,
                        "word": "执"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 581,
                        "y": 884,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 598,
                        "y": 884,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 14,
                        "x": 614,
                        "y": 884,
                        "word": "率"
                    }
                ],
                "direction": 0,
                "height": 73,
                "rowId": 48
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 690,
                        "y": 883
                    },
                    {
                        "x": 806,
                        "y": 883
                    },
                    {
                        "x": 806,
                        "y": 900
                    },
                    {
                        "x": 690,
                        "y": 900
                    }
                ],
                "width": 18,
                "x": 740,
                "angle": -90,
                "y": 834,
                "word": "资金交割日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 693,
                        "y": 884,
                        "word": "资"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 712,
                        "y": 884,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 729,
                        "y": 884,
                        "word": "交"
                    },
                    {
                        "prob": 97,
                        "w": 9,
                        "h": 15,
                        "x": 746,
                        "y": 884,
                        "word": "割"
                    },
                    {
                        "prob": 100,
                        "w": 13,
                        "h": 15,
                        "x": 765,
                        "y": 884,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 116,
                "rowId": 48
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 812,
                        "y": 883
                    },
                    {
                        "x": 904,
                        "y": 883
                    },
                    {
                        "x": 904,
                        "y": 902
                    },
                    {
                        "x": 812,
                        "y": 902
                    }
                ],
                "width": 19,
                "x": 849,
                "angle": -90,
                "y": 847,
                "word": "年月日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 21,
                        "h": 16,
                        "x": 812,
                        "y": 884,
                        "word": "年"
                    },
                    {
                        "prob": 99,
                        "w": 30,
                        "h": 16,
                        "x": 835,
                        "y": 884,
                        "word": "月"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 889,
                        "y": 884,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 91,
                "rowId": 48
            },
            {
                "prob": 98,
                "pos": [
                    {
                        "x": 97,
                        "y": 906
                    },
                    {
                        "x": 349,
                        "y": 906
                    },
                    {
                        "x": 349,
                        "y": 924
                    },
                    {
                        "x": 97,
                        "y": 924
                    }
                ],
                "width": 17,
                "x": 213,
                "angle": -89,
                "y": 788,
                "word": "口差额交割：差额交割定盘汇率",
                "charInfo": [
                    {
                        "prob": 81,
                        "w": 14,
                        "h": 15,
                        "x": 98,
                        "y": 906,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 116,
                        "y": 906,
                        "word": "差"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 134,
                        "y": 906,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 151,
                        "y": 906,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 167,
                        "y": 906,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 187,
                        "y": 906,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 203,
                        "y": 906,
                        "word": "差"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 221,
                        "y": 906,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 239,
                        "y": 906,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 257,
                        "y": 906,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 274,
                        "y": 906,
                        "word": "定"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 290,
                        "y": 906,
                        "word": "盘"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 307,
                        "y": 906,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 325,
                        "y": 906,
                        "word": "率"
                    }
                ],
                "direction": 0,
                "height": 252,
                "rowId": 49
            },
            {
                "prob": 96,
                "pos": [
                    {
                        "x": 401,
                        "y": 906
                    },
                    {
                        "x": 542,
                        "y": 906
                    },
                    {
                        "x": 542,
                        "y": 924
                    },
                    {
                        "x": 401,
                        "y": 924
                    }
                ],
                "width": 17,
                "x": 462,
                "angle": -90,
                "y": 844,
                "word": "差额交割CNY金额_",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 406,
                        "y": 907,
                        "word": "差"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 423,
                        "y": 907,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 442,
                        "y": 907,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 457,
                        "y": 907,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 476,
                        "y": 907,
                        "word": "C"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 484,
                        "y": 907,
                        "word": "N"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 495,
                        "y": 907,
                        "word": "Y"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 503,
                        "y": 907,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 18,
                        "h": 15,
                        "x": 517,
                        "y": 907,
                        "word": "额"
                    },
                    {
                        "prob": 72,
                        "w": 1,
                        "h": 15,
                        "x": 538,
                        "y": 907,
                        "word": "_"
                    }
                ],
                "direction": 0,
                "height": 140,
                "rowId": 49
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 959
                    },
                    {
                        "x": 116,
                        "y": 959
                    },
                    {
                        "x": 116,
                        "y": 976
                    },
                    {
                        "x": 44,
                        "y": 976
                    }
                ],
                "width": 16,
                "x": 71,
                "angle": -90,
                "y": 931,
                "word": "账户信息",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 44,
                        "y": 960,
                        "word": "账"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 64,
                        "y": 960,
                        "word": "户"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 82,
                        "y": 960,
                        "word": "信"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 14,
                        "x": 100,
                        "y": 960,
                        "word": "息"
                    }
                ],
                "direction": 0,
                "height": 72,
                "rowId": 50
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 983
                    },
                    {
                        "x": 109,
                        "y": 983
                    },
                    {
                        "x": 109,
                        "y": 999
                    },
                    {
                        "x": 44,
                        "y": 999
                    }
                ],
                "width": 16,
                "x": 67,
                "angle": -90,
                "y": 957,
                "word": "币种1在",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 14,
                        "x": 47,
                        "y": 983,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 62,
                        "y": 983,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 82,
                        "y": 983,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 14,
                        "x": 91,
                        "y": 983,
                        "word": "在"
                    }
                ],
                "direction": 0,
                "height": 65,
                "rowId": 51
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 413,
                        "y": 981
                    },
                    {
                        "x": 628,
                        "y": 981
                    },
                    {
                        "x": 628,
                        "y": 999
                    },
                    {
                        "x": 413,
                        "y": 999
                    }
                ],
                "width": 17,
                "x": 512,
                "angle": -90,
                "y": 882,
                "word": "(账号)中扣划，币种2划入",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 416,
                        "y": 982,
                        "word": "("
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 424,
                        "y": 982,
                        "word": "账"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 443,
                        "y": 982,
                        "word": "号"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 460,
                        "y": 982,
                        "word": ")"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 477,
                        "y": 982,
                        "word": "中"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 494,
                        "y": 982,
                        "word": "扣"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 513,
                        "y": 982,
                        "word": "划"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 530,
                        "y": 982,
                        "word": "，"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 549,
                        "y": 982,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 566,
                        "y": 982,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 584,
                        "y": 982,
                        "word": "2"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 593,
                        "y": 982,
                        "word": "划"
                    },
                    {
                        "prob": 99,
                        "w": 18,
                        "h": 15,
                        "x": 609,
                        "y": 982,
                        "word": "入"
                    }
                ],
                "direction": 0,
                "height": 216,
                "rowId": 52
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 890,
                        "y": 983
                    },
                    {
                        "x": 937,
                        "y": 983
                    },
                    {
                        "x": 937,
                        "y": 999
                    },
                    {
                        "x": 890,
                        "y": 999
                    }
                ],
                "width": 16,
                "x": 906,
                "angle": -90,
                "y": 968,
                "word": "银行，",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 890,
                        "y": 984,
                        "word": "银"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 908,
                        "y": 984,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 14,
                        "x": 928,
                        "y": 984,
                        "word": "，"
                    }
                ],
                "direction": 0,
                "height": 46,
                "rowId": 53
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 42,
                        "y": 1005
                    },
                    {
                        "x": 83,
                        "y": 1005
                    },
                    {
                        "x": 83,
                        "y": 1022
                    },
                    {
                        "x": 42,
                        "y": 1022
                    }
                ],
                "width": 18,
                "x": 53,
                "angle": -90,
                "y": 993,
                "word": "账号",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 45,
                        "y": 1006,
                        "word": "账"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 65,
                        "y": 1006,
                        "word": "号"
                    }
                ],
                "direction": 0,
                "height": 40,
                "rowId": 54
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 366,
                        "y": 1005
                    },
                    {
                        "x": 451,
                        "y": 1005
                    },
                    {
                        "x": 451,
                        "y": 1022
                    },
                    {
                        "x": 366,
                        "y": 1022
                    }
                ],
                "width": 18,
                "x": 399,
                "angle": -90,
                "y": 971,
                "word": "，收款方为",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 366,
                        "y": 1005,
                        "word": "，"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 378,
                        "y": 1005,
                        "word": "收"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 398,
                        "y": 1005,
                        "word": "款"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 416,
                        "y": 1005,
                        "word": "方"
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 15,
                        "x": 433,
                        "y": 1005,
                        "word": "为"
                    }
                ],
                "direction": 0,
                "height": 86,
                "rowId": 55
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 1027
                    },
                    {
                        "x": 109,
                        "y": 1027
                    },
                    {
                        "x": 109,
                        "y": 1044
                    },
                    {
                        "x": 44,
                        "y": 1044
                    }
                ],
                "width": 18,
                "x": 66,
                "angle": -90,
                "y": 1002,
                "word": "币种2在",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 47,
                        "y": 1027,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 62,
                        "y": 1027,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 82,
                        "y": 1027,
                        "word": "2"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 91,
                        "y": 1027,
                        "word": "在"
                    }
                ],
                "direction": 0,
                "height": 65,
                "rowId": 56
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 412,
                        "y": 1027
                    },
                    {
                        "x": 625,
                        "y": 1027
                    },
                    {
                        "x": 625,
                        "y": 1044
                    },
                    {
                        "x": 412,
                        "y": 1044
                    }
                ],
                "width": 17,
                "x": 510,
                "angle": -89,
                "y": 928,
                "word": "(账号)中扣划，币种1划入",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 413,
                        "y": 1027,
                        "word": "("
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 420,
                        "y": 1027,
                        "word": "账"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 438,
                        "y": 1027,
                        "word": "号"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 458,
                        "y": 1027,
                        "word": ")"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 474,
                        "y": 1027,
                        "word": "中"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 489,
                        "y": 1027,
                        "word": "扣"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 507,
                        "y": 1027,
                        "word": "划"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 525,
                        "y": 1027,
                        "word": "，"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 546,
                        "y": 1027,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 561,
                        "y": 1027,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 579,
                        "y": 1027,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 588,
                        "y": 1027,
                        "word": "划"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 606,
                        "y": 1027,
                        "word": "入"
                    }
                ],
                "direction": 0,
                "height": 214,
                "rowId": 57
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 883,
                        "y": 1028
                    },
                    {
                        "x": 928,
                        "y": 1028
                    },
                    {
                        "x": 928,
                        "y": 1043
                    },
                    {
                        "x": 883,
                        "y": 1043
                    }
                ],
                "width": 15,
                "x": 899,
                "angle": -90,
                "y": 1013,
                "word": "银行，",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 13,
                        "x": 886,
                        "y": 1028,
                        "word": "银"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 13,
                        "x": 902,
                        "y": 1028,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 13,
                        "x": 921,
                        "y": 1028,
                        "word": "，"
                    }
                ],
                "direction": 0,
                "height": 45,
                "rowId": 58
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 42,
                        "y": 1050
                    },
                    {
                        "x": 83,
                        "y": 1050
                    },
                    {
                        "x": 83,
                        "y": 1067
                    },
                    {
                        "x": 42,
                        "y": 1067
                    }
                ],
                "width": 18,
                "x": 53,
                "angle": -90,
                "y": 1038,
                "word": "账号",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 45,
                        "y": 1051,
                        "word": "账"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 65,
                        "y": 1051,
                        "word": "号"
                    }
                ],
                "direction": 0,
                "height": 40,
                "rowId": 59
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 360,
                        "y": 1050
                    },
                    {
                        "x": 450,
                        "y": 1050
                    },
                    {
                        "x": 450,
                        "y": 1067
                    },
                    {
                        "x": 360,
                        "y": 1067
                    }
                ],
                "width": 18,
                "x": 396,
                "angle": -90,
                "y": 1013,
                "word": "，收款方为",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 363,
                        "y": 1050,
                        "word": "，"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 377,
                        "y": 1050,
                        "word": "收"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 398,
                        "y": 1050,
                        "word": "款"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 414,
                        "y": 1050,
                        "word": "方"
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 15,
                        "x": 433,
                        "y": 1050,
                        "word": "为"
                    }
                ],
                "direction": 0,
                "height": 90,
                "rowId": 60
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 1094
                    },
                    {
                        "x": 176,
                        "y": 1094
                    },
                    {
                        "x": 176,
                        "y": 1110
                    },
                    {
                        "x": 44,
                        "y": 1110
                    }
                ],
                "width": 16,
                "x": 101,
                "angle": -90,
                "y": 1034,
                "word": "委托单位言体性质：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 46,
                        "y": 1095,
                        "word": "委"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 63,
                        "y": 1095,
                        "word": "托"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 78,
                        "y": 1095,
                        "word": "单"
                    },
                    {
                        "prob": 100,
                        "w": 11,
                        "h": 14,
                        "x": 92,
                        "y": 1095,
                        "word": "位"
                    },
                    {
                        "prob": 100,
                        "w": 11,
                        "h": 14,
                        "x": 107,
                        "y": 1095,
                        "word": "言"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 122,
                        "y": 1095,
                        "word": "体"
                    },
                    {
                        "prob": 100,
                        "w": 11,
                        "h": 14,
                        "x": 138,
                        "y": 1095,
                        "word": "性"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 152,
                        "y": 1095,
                        "word": "质"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 14,
                        "x": 167,
                        "y": 1095,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 133,
                "rowId": 61
            },
            {
                "prob": 98,
                "pos": [
                    {
                        "x": 181,
                        "y": 1095
                    },
                    {
                        "x": 377,
                        "y": 1094
                    },
                    {
                        "x": 378,
                        "y": 1111
                    },
                    {
                        "x": 181,
                        "y": 1112
                    }
                ],
                "width": 197,
                "x": 179,
                "angle": 0,
                "y": 1094,
                "word": "01银行自身￥02金融机构",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 204,
                        "y": 1096,
                        "word": "0"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 212,
                        "y": 1096,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 220,
                        "y": 1096,
                        "word": "银"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 235,
                        "y": 1096,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 14,
                        "x": 251,
                        "y": 1096,
                        "word": "自"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 264,
                        "y": 1095,
                        "word": "身"
                    },
                    {
                        "prob": 79,
                        "w": 10,
                        "h": 14,
                        "x": 288,
                        "y": 1095,
                        "word": "￥"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 14,
                        "x": 301,
                        "y": 1095,
                        "word": "0"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 14,
                        "x": 311,
                        "y": 1095,
                        "word": "2"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 317,
                        "y": 1095,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 332,
                        "y": 1095,
                        "word": "融"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 346,
                        "y": 1095,
                        "word": "机"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 362,
                        "y": 1095,
                        "word": "构"
                    }
                ],
                "direction": 0,
                "height": 16,
                "rowId": 61
            },
            {
                "prob": 98,
                "pos": [
                    {
                        "x": 483,
                        "y": 1094
                    },
                    {
                        "x": 815,
                        "y": 1092
                    },
                    {
                        "x": 815,
                        "y": 1110
                    },
                    {
                        "x": 483,
                        "y": 1111
                    }
                ],
                "width": 332,
                "x": 482,
                "angle": 0,
                "y": 1093,
                "word": "交易编码：(同涉外收支交易代码)：0000",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 484,
                        "y": 1095,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 500,
                        "y": 1095,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 514,
                        "y": 1095,
                        "word": "编"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 530,
                        "y": 1095,
                        "word": "码"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 544,
                        "y": 1095,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 558,
                        "y": 1095,
                        "word": "("
                    },
                    {
                        "prob": 100,
                        "w": 11,
                        "h": 15,
                        "x": 568,
                        "y": 1095,
                        "word": "同"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 582,
                        "y": 1095,
                        "word": "涉"
                    },
                    {
                        "prob": 100,
                        "w": 11,
                        "h": 15,
                        "x": 598,
                        "y": 1094,
                        "word": "外"
                    },
                    {
                        "prob": 100,
                        "w": 13,
                        "h": 15,
                        "x": 612,
                        "y": 1094,
                        "word": "收"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 628,
                        "y": 1094,
                        "word": "支"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 642,
                        "y": 1094,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 658,
                        "y": 1094,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 672,
                        "y": 1094,
                        "word": "代"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 688,
                        "y": 1094,
                        "word": "码"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 704,
                        "y": 1094,
                        "word": ")"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 710,
                        "y": 1094,
                        "word": "："
                    },
                    {
                        "prob": 93,
                        "w": 13,
                        "h": 15,
                        "x": 754,
                        "y": 1094,
                        "word": "0"
                    },
                    {
                        "prob": 93,
                        "w": 11,
                        "h": 15,
                        "x": 770,
                        "y": 1094,
                        "word": "0"
                    },
                    {
                        "prob": 98,
                        "w": 13,
                        "h": 15,
                        "x": 784,
                        "y": 1094,
                        "word": "0"
                    },
                    {
                        "prob": 88,
                        "w": 13,
                        "h": 15,
                        "x": 800,
                        "y": 1094,
                        "word": "0"
                    }
                ],
                "direction": 0,
                "height": 17,
                "rowId": 61
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 186,
                        "y": 1113
                    },
                    {
                        "x": 379,
                        "y": 1113
                    },
                    {
                        "x": 379,
                        "y": 1129
                    },
                    {
                        "x": 186,
                        "y": 1129
                    }
                ],
                "width": 17,
                "x": 273,
                "angle": -90,
                "y": 1024,
                "word": "03中资机构04外资机构",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 14,
                        "x": 203,
                        "y": 1114,
                        "word": "0"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 14,
                        "x": 212,
                        "y": 1114,
                        "word": "3"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 220,
                        "y": 1114,
                        "word": "中"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 14,
                        "x": 235,
                        "y": 1114,
                        "word": "资"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 248,
                        "y": 1114,
                        "word": "机"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 264,
                        "y": 1114,
                        "word": "构"
                    },
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 14,
                        "x": 302,
                        "y": 1114,
                        "word": "0"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 14,
                        "x": 311,
                        "y": 1114,
                        "word": "4"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 14,
                        "x": 318,
                        "y": 1114,
                        "word": "外"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 331,
                        "y": 1114,
                        "word": "资"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 346,
                        "y": 1114,
                        "word": "机"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 362,
                        "y": 1114,
                        "word": "构"
                    }
                ],
                "direction": 0,
                "height": 192,
                "rowId": 62
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 556,
                        "y": 1117
                    },
                    {
                        "x": 793,
                        "y": 1117
                    },
                    {
                        "x": 793,
                        "y": 1132
                    },
                    {
                        "x": 556,
                        "y": 1132
                    }
                ],
                "width": 14,
                "x": 666,
                "angle": -90,
                "y": 1005,
                "word": "外汇局批件号/备案表号/业务编号：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 12,
                        "x": 558,
                        "y": 1117,
                        "word": "外"
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 12,
                        "x": 575,
                        "y": 1117,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 12,
                        "x": 590,
                        "y": 1117,
                        "word": "局"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 12,
                        "x": 605,
                        "y": 1117,
                        "word": "批"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 12,
                        "x": 620,
                        "y": 1117,
                        "word": "件"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 12,
                        "x": 635,
                        "y": 1117,
                        "word": "号"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 12,
                        "x": 650,
                        "y": 1117,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 12,
                        "x": 657,
                        "y": 1117,
                        "word": "备"
                    },
                    {
                        "prob": 100,
                        "w": 10,
                        "h": 12,
                        "x": 674,
                        "y": 1117,
                        "word": "案"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 12,
                        "x": 687,
                        "y": 1117,
                        "word": "表"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 12,
                        "x": 704,
                        "y": 1117,
                        "word": "号"
                    },
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 12,
                        "x": 717,
                        "y": 1117,
                        "word": "/"
                    },
                    {
                        "prob": 100,
                        "w": 10,
                        "h": 12,
                        "x": 726,
                        "y": 1117,
                        "word": "业"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 12,
                        "x": 738,
                        "y": 1117,
                        "word": "务"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 12,
                        "x": 753,
                        "y": 1117,
                        "word": "编"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 12,
                        "x": 770,
                        "y": 1117,
                        "word": "号"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 12,
                        "x": 783,
                        "y": 1117,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 236,
                "rowId": 63
            },
            {
                "prob": 97,
                "pos": [
                    {
                        "x": 43,
                        "y": 1133
                    },
                    {
                        "x": 183,
                        "y": 1131
                    },
                    {
                        "x": 183,
                        "y": 1148
                    },
                    {
                        "x": 44,
                        "y": 1150
                    }
                ],
                "width": 139,
                "x": 42,
                "angle": 0,
                "y": 1131,
                "word": "结汇/售汇交易性展：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 45,
                        "y": 1133,
                        "word": "结"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 63,
                        "y": 1133,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 77,
                        "y": 1133,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 85,
                        "y": 1133,
                        "word": "售"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 99,
                        "y": 1133,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 115,
                        "y": 1132,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 131,
                        "y": 1132,
                        "word": "易"
                    },
                    {
                        "prob": 95,
                        "w": 13,
                        "h": 15,
                        "x": 145,
                        "y": 1132,
                        "word": "性"
                    },
                    {
                        "prob": 85,
                        "w": 11,
                        "h": 15,
                        "x": 161,
                        "y": 1132,
                        "word": "展"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 175,
                        "y": 1132,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 17,
                "rowId": 64
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 283,
                        "y": 1132
                    },
                    {
                        "x": 423,
                        "y": 1132
                    },
                    {
                        "x": 423,
                        "y": 1148
                    },
                    {
                        "x": 283,
                        "y": 1148
                    }
                ],
                "width": 16,
                "x": 344,
                "angle": -90,
                "y": 1070,
                "word": "(代号参见背页选项)",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 13,
                        "x": 285,
                        "y": 1133,
                        "word": "("
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 13,
                        "x": 294,
                        "y": 1133,
                        "word": "代"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 13,
                        "x": 309,
                        "y": 1133,
                        "word": "号"
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 13,
                        "x": 323,
                        "y": 1133,
                        "word": "参"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 13,
                        "x": 339,
                        "y": 1133,
                        "word": "见"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 13,
                        "x": 355,
                        "y": 1133,
                        "word": "背"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 13,
                        "x": 369,
                        "y": 1133,
                        "word": "页"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 13,
                        "x": 382,
                        "y": 1133,
                        "word": "选"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 13,
                        "x": 398,
                        "y": 1133,
                        "word": "项"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 13,
                        "x": 416,
                        "y": 1133,
                        "word": ")"
                    }
                ],
                "direction": 0,
                "height": 139,
                "rowId": 64
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 482,
                        "y": 1139
                    },
                    {
                        "x": 554,
                        "y": 1139
                    },
                    {
                        "x": 554,
                        "y": 1155
                    },
                    {
                        "x": 482,
                        "y": 1155
                    }
                ],
                "width": 17,
                "x": 509,
                "angle": -90,
                "y": 1110,
                "word": "结汇用途：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 482,
                        "y": 1140,
                        "word": "结"
                    },
                    {
                        "prob": 100,
                        "w": 11,
                        "h": 14,
                        "x": 499,
                        "y": 1140,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 514,
                        "y": 1140,
                        "word": "用"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 529,
                        "y": 1140,
                        "word": "途"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 14,
                        "x": 543,
                        "y": 1140,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 74,
                "rowId": 64
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 653,
                        "y": 1140
                    },
                    {
                        "x": 793,
                        "y": 1140
                    },
                    {
                        "x": 793,
                        "y": 1155
                    },
                    {
                        "x": 653,
                        "y": 1155
                    }
                ],
                "width": 15,
                "x": 716,
                "angle": -90,
                "y": 1079,
                "word": "(代号参见背页选项)",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 12,
                        "x": 655,
                        "y": 1140,
                        "word": "("
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 12,
                        "x": 664,
                        "y": 1140,
                        "word": "代"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 12,
                        "x": 681,
                        "y": 1140,
                        "word": "号"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 12,
                        "x": 694,
                        "y": 1140,
                        "word": "参"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 12,
                        "x": 711,
                        "y": 1140,
                        "word": "见"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 12,
                        "x": 726,
                        "y": 1140,
                        "word": "背"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 12,
                        "x": 741,
                        "y": 1140,
                        "word": "页"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 12,
                        "x": 754,
                        "y": 1140,
                        "word": "选"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 12,
                        "x": 770,
                        "y": 1140,
                        "word": "项"
                    },
                    {
                        "prob": 98,
                        "w": 4,
                        "h": 12,
                        "x": 787,
                        "y": 1140,
                        "word": ")"
                    }
                ],
                "direction": 0,
                "height": 139,
                "rowId": 64
            },
            {
                "prob": 97,
                "pos": [
                    {
                        "x": 113,
                        "y": 1158
                    },
                    {
                        "x": 424,
                        "y": 1158
                    },
                    {
                        "x": 424,
                        "y": 1176
                    },
                    {
                        "x": 113,
                        "y": 1176
                    }
                ],
                "width": 17,
                "x": 260,
                "angle": -90,
                "y": 1011,
                "word": "如为服务贸易，是否为银行卡交易：口是口否",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 115,
                        "y": 1159,
                        "word": "如"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 130,
                        "y": 1159,
                        "word": "为"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 145,
                        "y": 1159,
                        "word": "服"
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 15,
                        "x": 160,
                        "y": 1159,
                        "word": "务"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 175,
                        "y": 1159,
                        "word": "贸"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 190,
                        "y": 1159,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 15,
                        "x": 205,
                        "y": 1159,
                        "word": "，"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 220,
                        "y": 1159,
                        "word": "是"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 234,
                        "y": 1159,
                        "word": "否"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 249,
                        "y": 1159,
                        "word": "为"
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 15,
                        "x": 264,
                        "y": 1159,
                        "word": "银"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 279,
                        "y": 1159,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 294,
                        "y": 1159,
                        "word": "卡"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 309,
                        "y": 1159,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 326,
                        "y": 1159,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 2,
                        "h": 15,
                        "x": 341,
                        "y": 1159,
                        "word": "："
                    },
                    {
                        "prob": 65,
                        "w": 10,
                        "h": 15,
                        "x": 355,
                        "y": 1159,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 368,
                        "y": 1159,
                        "word": "是"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 392,
                        "y": 1159,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 407,
                        "y": 1159,
                        "word": "否"
                    }
                ],
                "direction": 0,
                "height": 311,
                "rowId": 65
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 512,
                        "y": 1162
                    },
                    {
                        "x": 793,
                        "y": 1162
                    },
                    {
                        "x": 793,
                        "y": 1178
                    },
                    {
                        "x": 512,
                        "y": 1178
                    }
                ],
                "width": 16,
                "x": 644,
                "angle": -90,
                "y": 1031,
                "word": "如为005、006或099时请填写结汇详细用途",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 513,
                        "y": 1162,
                        "word": "如"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 528,
                        "y": 1162,
                        "word": "为"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 551,
                        "y": 1162,
                        "word": "0"
                    },
                    {
                        "prob": 99,
                        "w": 1,
                        "h": 14,
                        "x": 555,
                        "y": 1162,
                        "word": "0"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 559,
                        "y": 1162,
                        "word": "5"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 14,
                        "x": 568,
                        "y": 1162,
                        "word": "、"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 581,
                        "y": 1162,
                        "word": "0"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 589,
                        "y": 1162,
                        "word": "0"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 14,
                        "x": 598,
                        "y": 1162,
                        "word": "6"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 604,
                        "y": 1162,
                        "word": "或"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 619,
                        "y": 1162,
                        "word": "0"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 14,
                        "x": 628,
                        "y": 1162,
                        "word": "9"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 634,
                        "y": 1162,
                        "word": "9"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 642,
                        "y": 1162,
                        "word": "时"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 657,
                        "y": 1162,
                        "word": "请"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 672,
                        "y": 1162,
                        "word": "填"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 687,
                        "y": 1162,
                        "word": "写"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 702,
                        "y": 1162,
                        "word": "结"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 717,
                        "y": 1162,
                        "word": "汇"
                    },
                    {
                        "prob": 100,
                        "w": 11,
                        "h": 14,
                        "x": 732,
                        "y": 1162,
                        "word": "详"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 747,
                        "y": 1162,
                        "word": "细"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 762,
                        "y": 1162,
                        "word": "用"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 776,
                        "y": 1162,
                        "word": "途"
                    }
                ],
                "direction": 0,
                "height": 280,
                "rowId": 65
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 1195
                    },
                    {
                        "x": 212,
                        "y": 1195
                    },
                    {
                        "x": 212,
                        "y": 1213
                    },
                    {
                        "x": 44,
                        "y": 1213
                    }
                ],
                "width": 17,
                "x": 118,
                "angle": -90,
                "y": 1119,
                "word": "委托单位签字并盖章：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 47,
                        "y": 1196,
                        "word": "委"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 64,
                        "y": 1196,
                        "word": "托"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 83,
                        "y": 1196,
                        "word": "单"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 102,
                        "y": 1196,
                        "word": "位"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 116,
                        "y": 1196,
                        "word": "签"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 135,
                        "y": 1196,
                        "word": "字"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 152,
                        "y": 1196,
                        "word": "并"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 169,
                        "y": 1196,
                        "word": "盖"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 188,
                        "y": 1196,
                        "word": "章"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 205,
                        "y": 1196,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 168,
                "rowId": 66
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 482,
                        "y": 1196
                    },
                    {
                        "x": 599,
                        "y": 1196
                    },
                    {
                        "x": 599,
                        "y": 1214
                    },
                    {
                        "x": 482,
                        "y": 1214
                    }
                ],
                "width": 17,
                "x": 531,
                "angle": -90,
                "y": 1146,
                "word": "银行审核意见：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 483,
                        "y": 1196,
                        "word": "银"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 503,
                        "y": 1196,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 518,
                        "y": 1196,
                        "word": "审"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 536,
                        "y": 1196,
                        "word": "核"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 554,
                        "y": 1196,
                        "word": "意"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 572,
                        "y": 1196,
                        "word": "见"
                    },
                    {
                        "prob": 98,
                        "w": 3,
                        "h": 15,
                        "x": 592,
                        "y": 1196,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 118,
                "rowId": 67
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 640,
                        "y": 1331
                    },
                    {
                        "x": 721,
                        "y": 1331
                    },
                    {
                        "x": 721,
                        "y": 1347
                    },
                    {
                        "x": 640,
                        "y": 1347
                    }
                ],
                "width": 15,
                "x": 671,
                "angle": -90,
                "y": 1297,
                "word": "银行盖章：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 642,
                        "y": 1332,
                        "word": "银"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 660,
                        "y": 1332,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 678,
                        "y": 1332,
                        "word": "盖"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 696,
                        "y": 1332,
                        "word": "章"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 14,
                        "x": 713,
                        "y": 1332,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 81,
                "rowId": 68
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 341,
                        "y": 1354
                    },
                    {
                        "x": 366,
                        "y": 1354
                    },
                    {
                        "x": 366,
                        "y": 1375
                    },
                    {
                        "x": 341,
                        "y": 1375
                    }
                ],
                "width": 22,
                "x": 342,
                "angle": -90,
                "y": 1352,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 21,
                        "h": 18,
                        "x": 341,
                        "y": 1355,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 24,
                "rowId": 69
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 393,
                        "y": 1355
                    },
                    {
                        "x": 416,
                        "y": 1355
                    },
                    {
                        "x": 416,
                        "y": 1374
                    },
                    {
                        "x": 393,
                        "y": 1374
                    }
                ],
                "width": 18,
                "x": 395,
                "angle": -90,
                "y": 1352,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 16,
                        "x": 396,
                        "y": 1356,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 23,
                "rowId": 69
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 447,
                        "y": 1354
                    },
                    {
                        "x": 469,
                        "y": 1354
                    },
                    {
                        "x": 469,
                        "y": 1373
                    },
                    {
                        "x": 447,
                        "y": 1373
                    }
                ],
                "width": 17,
                "x": 448,
                "angle": -87,
                "y": 1351,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 452,
                        "y": 1355,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 23,
                "rowId": 69
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 640,
                        "y": 1355
                    },
                    {
                        "x": 704,
                        "y": 1357
                    },
                    {
                        "x": 703,
                        "y": 1373
                    },
                    {
                        "x": 639,
                        "y": 1371
                    }
                ],
                "width": 16,
                "x": 662,
                "angle": -89,
                "y": 1332,
                "word": "经办人：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 643,
                        "y": 1356,
                        "word": "经"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 662,
                        "y": 1356,
                        "word": "办"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 678,
                        "y": 1357,
                        "word": "人"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 695,
                        "y": 1357,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 64,
                "rowId": 69
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 790,
                        "y": 1355
                    },
                    {
                        "x": 853,
                        "y": 1355
                    },
                    {
                        "x": 853,
                        "y": 1372
                    },
                    {
                        "x": 790,
                        "y": 1372
                    }
                ],
                "width": 16,
                "x": 813,
                "angle": -90,
                "y": 1333,
                "word": "复核人：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 791,
                        "y": 1356,
                        "word": "复"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 809,
                        "y": 1356,
                        "word": "核"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 827,
                        "y": 1356,
                        "word": "人"
                    },
                    {
                        "prob": 97,
                        "w": 5,
                        "h": 14,
                        "x": 844,
                        "y": 1356,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 62,
                "rowId": 69
            }
        ],
        "height": 1403
    },
    "requestId": "0349d624-1f56-4e2d-a373-69bf5a1b2bf1"
}

originResult={
    "code": 200,
    "data": {
        "figure": [],
        "prism_rowsInfo": [
            {
                "word": "●思建设银行",
                "rowId": 0
            },
            {
                "word": "编号：",
                "rowId": 1
            },
            {
                "word": "汇率交易申请书",
                "rowId": 2
            },
            {
                "word": "年月日",
                "rowId": 3
            },
            {
                "word": "中国建设银行分(支)行：",
                "rowId": 4
            },
            {
                "word": "本单位(人)",
                "rowId": 5
            },
            {
                "word": "委托你行办理以下汇率交易。",
                "rowId": 6
            },
            {
                "word": "币种1/币种2：方向：口买入/口卖出币种1金额：币种1币种2",
                "rowId": 7
            },
            {
                "word": "即期：资金交割日为_年_月日",
                "rowId": 8
            },
            {
                "word": "口即期远期：口全额交割○固定期限：交割日为_而对方年月日",
                "rowId": 9
            },
            {
                "word": "口远期○择期交易：交割日为年_月_日至年月日",
                "rowId": 10
            },
            {
                "word": "口差额交割交割日为年月日定盘日为年月日定盘汇率",
                "rowId": 11
            },
            {
                "word": "委托汇率：口市价/口(汇率)委托有效期：年月日至年月日",
                "rowId": 12
            },
            {
                "word": "币种1/币种2：交易方向：口近端买入/远端卖出币种1近端卖出/远端买入币种1",
                "rowId": 13
            },
            {
                "word": "近端：币种1金额币种2金额近端汇率交割日年月日",
                "rowId": 14
            },
            {
                "word": "掉期",
                "rowId": 15
            },
            {
                "word": "远端：币种1金额币种2金额远期点交割日年月日",
                "rowId": 16
            },
            {
                "word": "委托有效期：年月日至年月日",
                "rowId": 17
            },
            {
                "word": "交易展期原因(仅展期委托时填写)：",
                "rowId": 18
            },
            {
                "word": "口择期交割",
                "rowId": 19
            },
            {
                "word": "原交易证实书编号：",
                "rowId": 20
            },
            {
                "word": "口提前交割交割/展期日期：年月日",
                "rowId": 21
            },
            {
                "word": "币种：交割/展期金额：",
                "rowId": 22
            },
            {
                "word": "口向后展期",
                "rowId": 23
            },
            {
                "word": "第一笔：",
                "rowId": 24
            },
            {
                "word": "第二笔：(如超过两笔可附页)",
                "rowId": 25
            },
            {
                "word": "交易币种：货币1/货币2交易币种：货币1/货币2",
                "rowId": 26
            },
            {
                "word": "交易类型：买入口货币1看涨期权交易类型：买入口货币1看涨期权",
                "rowId": 27
            },
            {
                "word": "口卖出口货币1看跌期权口卖出口货币1看跌期权",
                "rowId": 28
            },
            {
                "word": "口人民币对外汇期权执行汇率：",
                "rowId": 29
            },
            {
                "word": "执行汇率：",
                "rowId": 30
            },
            {
                "word": "货币1金额：",
                "rowId": 31
            },
            {
                "word": "货币1金额：",
                "rowId": 32
            },
            {
                "word": "口人民币对外汇期权组合",
                "rowId": 33
            },
            {
                "word": "货币2金额：",
                "rowId": 34
            },
            {
                "word": "货币2金额：",
                "rowId": 35
            },
            {
                "word": "起息日：年月日起息日：年月日",
                "rowId": 36
            },
            {
                "word": "到期日：年月",
                "rowId": 37
            },
            {
                "word": "日日",
                "rowId": 39
            },
            {
                "word": "到期日：年",
                "rowId": 40
            },
            {
                "word": "交割日：年月",
                "rowId": 42
            },
            {
                "word": "交割日：年月",
                "rowId": 44
            },
            {
                "word": "日日",
                "rowId": 45
            },
            {
                "word": "交割方式：全额交割/口差额交割交割方式：口全额交割/差额交割",
                "rowId": 47
            },
            {
                "word": "口人民币对外汇期权交易行权原交易证实书编号：",
                "rowId": 48
            },
            {
                "word": "口全额交割：结汇口售汇币种交割金额执行汇率资金交割日年月日",
                "rowId": 49
            },
            {
                "word": "口差额交割：差额交割定盘汇率差额交割CNY金额_",
                "rowId": 50
            },
            {
                "word": "账户信息",
                "rowId": 51
            },
            {
                "word": "币种1在",
                "rowId": 52
            },
            {
                "word": "(账号)中扣划，币种2划入",
                "rowId": 53
            },
            {
                "word": "银行，",
                "rowId": 54
            },
            {
                "word": "账号",
                "rowId": 55
            },
            {
                "word": "，收款方为",
                "rowId": 56
            },
            {
                "word": "币种2在",
                "rowId": 57
            },
            {
                "word": "(账号)中扣划，币种1划入",
                "rowId": 58
            },
            {
                "word": "银行，",
                "rowId": 59
            },
            {
                "word": "账号",
                "rowId": 60
            },
            {
                "word": "，收款方为",
                "rowId": 61
            },
            {
                "word": "委托单位体性质：01银行自身￥02金融机构交易编码：(同涉外收支交易代码)：0000",
                "rowId": 62
            },
            {
                "word": "03中资机构04外资机构",
                "rowId": 63
            },
            {
                "word": "外汇局批件号/备案表号/业务编号：",
                "rowId": 64
            },
            {
                "word": "结汇/售汇交易性展：(代号参见背页选项)结汇用途：(代号参见背页选项)",
                "rowId": 65
            },
            {
                "word": "如为服务贸易，是否为银行卡交易：口是口否如为005、006或099时请填写结汇详细用途",
                "rowId": 66
            },
            {
                "word": "委托单位签字并盖章：",
                "rowId": 67
            },
            {
                "word": "银行审核意见：",
                "rowId": 68
            },
            {
                "word": "银行盖章：",
                "rowId": 69
            },
            {
                "word": "年月日经办人：复核人：",
                "rowId": 70
            }
        ],
        "algo_version": "",
        "orgWidth": 992,
        "content": "● 思建设银行 编号： 汇率交易申请书 年 月 日 中国建设银行 分(支)行： 本单位(人) 委托你行办理以下汇率交易。 币种1/币种2： 方向：口买入/口卖出币种1 金额：币种1 币种2 即期：资金交割日为 _年 _月 日 口即期 远期：口全额交割○固定期限：交割日为_而对方 年月日 口远期 ○择期交易：交割日为 年 _月_日至 年 月 日 口差额交割 交割日为 年 月 日 定盘日为 年 月 日 定盘汇率 委托汇率：口市价/口 (汇率)委托有效期： 年 月 日至 年 月 日 币种1/币种2： 交易方向：口近端买入/远端卖出币种1 近端卖出/远端买入币种1 近端：币种1金额 币种2金额 近端汇率 交割日 年月 日 掉期 远端：币种1金额 币种2金额 远期点 交割日 年 月 日 委托有效期： 年月 日至年月日 交易展期原因(仅展期委托时填写)： 口择期交割 原交易证实书编号： 口提前交割 交割/展期日期： 年 月 日 币种： 交割/展期金额： 口向后展期 第一笔： 第二笔：(如超过两笔可附页) 交易币种：货币1 /货币2 交易币种：货币1 /货币2 交易类型：买入 口货币1看涨期权 交易类型：买入 口货币1看涨期权 口卖出 口货币1看跌期权 口卖出 口货币1看跌期权 口人民币对外汇期权 执行汇率： 执行汇率： 货币1金额： 货币1金额： 口人民币对外汇期权组合 货币2金额： 货币2金额： 起息日： 年 月 日 起息日： 年 月 日 到期日： 年 月 日日 到期日： 年 交割日： 年 月 交割日： 年 月 日日 交割方式：全额交割/口差额交割 交割方式：口全额交割/差额交割 口人民币对外汇期权交易行权原交易证实书编号： 口全额交割：结汇口售汇币种 交割金额 执行汇率 资金交割日 年月日 口差额交割：差额交割定盘汇率 差额交割CNY金额_ 账户信息 币种1在 (账号)中扣划，币种2划入 银行， 账号 ，收款方为 币种2在 (账号)中扣划，币种1划入 银行， 账号 ，收款方为 委托单位体性质： 01银行自身￥02金融机构 交易编码：(同涉外收支交易代码)：0000 03中资机构04外资机构 外汇局批件号/备案表号/业务编号： 结汇/售汇交易性展： (代号参见背页选项) 结汇用途： (代号参见背页选项) 如为服务贸易，是否为银行卡交易：口是口否 如为005、006或099时请填写结汇详细用途 委托单位签字并盖章： 银行审核意见： 银行盖章： 年 月 日 经办人： 复核人： ",
        "requestId": "2F1B7AE4-9EFC-53AD-8899-3165E835A3F5",
        "prism_wnum": 161,
        "width": 992,
        "angle": 0,
        "orgHeight": 1403,
        "prism_version": "1.0.9",
        "prism_wordsInfo": [
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 64,
                        "y": 33
                    },
                    {
                        "x": 83,
                        "y": 33
                    },
                    {
                        "x": 83,
                        "y": 48
                    },
                    {
                        "x": 64,
                        "y": 48
                    }
                ],
                "width": 14,
                "x": 67,
                "angle": -90,
                "y": 31,
                "word": "●",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 21,
                        "h": 13,
                        "x": 64,
                        "y": 33,
                        "word": "●"
                    }
                ],
                "direction": 0,
                "height": 18,
                "rowId": 0
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 84,
                        "y": 29
                    },
                    {
                        "x": 197,
                        "y": 27
                    },
                    {
                        "x": 197,
                        "y": 45
                    },
                    {
                        "x": 85,
                        "y": 47
                    }
                ],
                "width": 112,
                "x": 84,
                "angle": -1,
                "y": 28,
                "word": "思建设银行",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 15,
                        "x": 111,
                        "y": 29,
                        "word": "思"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 127,
                        "y": 29,
                        "word": "建"
                    },
                    {
                        "prob": 100,
                        "w": 15,
                        "h": 15,
                        "x": 144,
                        "y": 28,
                        "word": "设"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 163,
                        "y": 28,
                        "word": "银"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 179,
                        "y": 28,
                        "word": "行"
                    }
                ],
                "direction": 0,
                "height": 16,
                "rowId": 0
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 53,
                        "y": 72
                    },
                    {
                        "x": 101,
                        "y": 72
                    },
                    {
                        "x": 101,
                        "y": 89
                    },
                    {
                        "x": 53,
                        "y": 89
                    }
                ],
                "width": 17,
                "x": 68,
                "angle": -90,
                "y": 56,
                "word": "编号：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 56,
                        "y": 73,
                        "word": "编"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 75,
                        "y": 73,
                        "word": "号"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 91,
                        "y": 73,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 46,
                "rowId": 1
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 408,
                        "y": 67
                    },
                    {
                        "x": 573,
                        "y": 67
                    },
                    {
                        "x": 573,
                        "y": 88
                    },
                    {
                        "x": 408,
                        "y": 88
                    }
                ],
                "width": 19,
                "x": 481,
                "angle": -89,
                "y": -5,
                "word": "汇率交易申请书",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 22,
                        "h": 18,
                        "x": 409,
                        "y": 67,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 19,
                        "h": 18,
                        "x": 436,
                        "y": 67,
                        "word": "率"
                    },
                    {
                        "prob": 99,
                        "w": 19,
                        "h": 18,
                        "x": 460,
                        "y": 67,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 18,
                        "x": 484,
                        "y": 67,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 19,
                        "h": 18,
                        "x": 504,
                        "y": 67,
                        "word": "申"
                    },
                    {
                        "prob": 99,
                        "w": 19,
                        "h": 18,
                        "x": 528,
                        "y": 67,
                        "word": "请"
                    },
                    {
                        "prob": 99,
                        "w": 22,
                        "h": 18,
                        "x": 552,
                        "y": 67,
                        "word": "书"
                    }
                ],
                "direction": 0,
                "height": 165,
                "rowId": 2
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 788,
                        "y": 69
                    },
                    {
                        "x": 813,
                        "y": 69
                    },
                    {
                        "x": 813,
                        "y": 89
                    },
                    {
                        "x": 788,
                        "y": 89
                    }
                ],
                "width": 19,
                "x": 791,
                "angle": -90,
                "y": 67,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 18,
                        "h": 17,
                        "x": 791,
                        "y": 70,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 25,
                "rowId": 3
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 830,
                        "y": 69
                    },
                    {
                        "x": 855,
                        "y": 69
                    },
                    {
                        "x": 855,
                        "y": 90
                    },
                    {
                        "x": 830,
                        "y": 90
                    }
                ],
                "width": 21,
                "x": 833,
                "angle": -90,
                "y": 68,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 18,
                        "x": 835,
                        "y": 70,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 25,
                "rowId": 3
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 876,
                        "y": 69
                    },
                    {
                        "x": 899,
                        "y": 69
                    },
                    {
                        "x": 899,
                        "y": 90
                    },
                    {
                        "x": 876,
                        "y": 90
                    }
                ],
                "width": 21,
                "x": 877,
                "angle": -90,
                "y": 68,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 18,
                        "x": 880,
                        "y": 70,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 24,
                "rowId": 3
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 99
                    },
                    {
                        "x": 152,
                        "y": 102
                    },
                    {
                        "x": 151,
                        "y": 119
                    },
                    {
                        "x": 43,
                        "y": 116
                    }
                ],
                "width": 16,
                "x": 89,
                "angle": -88,
                "y": 54,
                "word": "中国建设银行",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 45,
                        "y": 100,
                        "word": "中"
                    },
                    {
                        "prob": 100,
                        "w": 15,
                        "h": 15,
                        "x": 64,
                        "y": 100,
                        "word": "国"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 83,
                        "y": 100,
                        "word": "建"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 99,
                        "y": 101,
                        "word": "设"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 116,
                        "y": 101,
                        "word": "银"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 135,
                        "y": 102,
                        "word": "行"
                    }
                ],
                "direction": 0,
                "height": 108,
                "rowId": 4
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 287,
                        "y": 102
                    },
                    {
                        "x": 387,
                        "y": 102
                    },
                    {
                        "x": 387,
                        "y": 119
                    },
                    {
                        "x": 287,
                        "y": 119
                    }
                ],
                "width": 18,
                "x": 329,
                "angle": -90,
                "y": 60,
                "word": "分(支)行：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 290,
                        "y": 103,
                        "word": "分"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 317,
                        "y": 103,
                        "word": "("
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 325,
                        "y": 103,
                        "word": "支"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 344,
                        "y": 103,
                        "word": ")"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 359,
                        "y": 103,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 377,
                        "y": 103,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 100,
                "rowId": 4
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 122
                    },
                    {
                        "x": 145,
                        "y": 122
                    },
                    {
                        "x": 145,
                        "y": 140
                    },
                    {
                        "x": 44,
                        "y": 140
                    }
                ],
                "width": 17,
                "x": 86,
                "angle": -90,
                "y": 80,
                "word": "本单位(人)",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 15,
                        "x": 47,
                        "y": 122,
                        "word": "本"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 15,
                        "x": 65,
                        "y": 122,
                        "word": "单"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 82,
                        "y": 122,
                        "word": "位"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 107,
                        "y": 122,
                        "word": "("
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 118,
                        "y": 122,
                        "word": "人"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 135,
                        "y": 122,
                        "word": ")"
                    }
                ],
                "direction": 0,
                "height": 101,
                "rowId": 5
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 429,
                        "y": 122
                    },
                    {
                        "x": 649,
                        "y": 122
                    },
                    {
                        "x": 649,
                        "y": 140
                    },
                    {
                        "x": 429,
                        "y": 140
                    }
                ],
                "width": 17,
                "x": 530,
                "angle": -90,
                "y": 21,
                "word": "委托你行办理以下汇率交易。",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 432,
                        "y": 122,
                        "word": "委"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 450,
                        "y": 122,
                        "word": "托"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 468,
                        "y": 122,
                        "word": "你"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 486,
                        "y": 122,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 502,
                        "y": 122,
                        "word": "办"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 520,
                        "y": 122,
                        "word": "理"
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 15,
                        "x": 538,
                        "y": 122,
                        "word": "以"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 554,
                        "y": 122,
                        "word": "下"
                    },
                    {
                        "prob": 99,
                        "w": 8,
                        "h": 15,
                        "x": 578,
                        "y": 122,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 590,
                        "y": 122,
                        "word": "率"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 608,
                        "y": 122,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 626,
                        "y": 122,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 641,
                        "y": 122,
                        "word": "。"
                    }
                ],
                "direction": 0,
                "height": 219,
                "rowId": 6
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 116,
                        "y": 148
                    },
                    {
                        "x": 221,
                        "y": 148
                    },
                    {
                        "x": 221,
                        "y": 166
                    },
                    {
                        "x": 116,
                        "y": 166
                    }
                ],
                "width": 17,
                "x": 161,
                "angle": -90,
                "y": 104,
                "word": "币种1/币种2：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 117,
                        "y": 148,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 135,
                        "y": 148,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 153,
                        "y": 148,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 8,
                        "h": 15,
                        "x": 160,
                        "y": 148,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 171,
                        "y": 148,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 187,
                        "y": 148,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 205,
                        "y": 148,
                        "word": "2"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 214,
                        "y": 148,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 105,
                "rowId": 7
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 333,
                        "y": 148
                    },
                    {
                        "x": 551,
                        "y": 148
                    },
                    {
                        "x": 551,
                        "y": 166
                    },
                    {
                        "x": 333,
                        "y": 166
                    }
                ],
                "width": 16,
                "x": 434,
                "angle": -89,
                "y": 47,
                "word": "方向：口买入/口卖出币种1",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 336,
                        "y": 148,
                        "word": "方"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 354,
                        "y": 148,
                        "word": "向"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 372,
                        "y": 148,
                        "word": "："
                    },
                    {
                        "prob": 93,
                        "w": 12,
                        "h": 15,
                        "x": 390,
                        "y": 148,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 406,
                        "y": 148,
                        "word": "买"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 423,
                        "y": 148,
                        "word": "入"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 441,
                        "y": 148,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 450,
                        "y": 148,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 466,
                        "y": 148,
                        "word": "卖"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 486,
                        "y": 148,
                        "word": "出"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 502,
                        "y": 148,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 520,
                        "y": 148,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 537,
                        "y": 148,
                        "word": "1"
                    }
                ],
                "direction": 0,
                "height": 219,
                "rowId": 7
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 552,
                        "y": 148
                    },
                    {
                        "x": 660,
                        "y": 148
                    },
                    {
                        "x": 660,
                        "y": 164
                    },
                    {
                        "x": 552,
                        "y": 164
                    }
                ],
                "width": 16,
                "x": 598,
                "angle": -90,
                "y": 103,
                "word": "金额：币种1",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 562,
                        "y": 148,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 579,
                        "y": 148,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 597,
                        "y": 148,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 14,
                        "x": 615,
                        "y": 148,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 630,
                        "y": 148,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 649,
                        "y": 148,
                        "word": "1"
                    }
                ],
                "direction": 0,
                "height": 108,
                "rowId": 7
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 760,
                        "y": 148
                    },
                    {
                        "x": 810,
                        "y": 148
                    },
                    {
                        "x": 810,
                        "y": 164
                    },
                    {
                        "x": 760,
                        "y": 164
                    }
                ],
                "width": 16,
                "x": 778,
                "angle": -90,
                "y": 132,
                "word": "币种2",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 14,
                        "x": 765,
                        "y": 148,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 781,
                        "y": 148,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 14,
                        "x": 798,
                        "y": 148,
                        "word": "2"
                    }
                ],
                "direction": 0,
                "height": 50,
                "rowId": 7
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 113,
                        "y": 169
                    },
                    {
                        "x": 276,
                        "y": 170
                    },
                    {
                        "x": 276,
                        "y": 189
                    },
                    {
                        "x": 113,
                        "y": 187
                    }
                ],
                "width": 18,
                "x": 186,
                "angle": -89,
                "y": 96,
                "word": "即期：资金交割日为",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 116,
                        "y": 170,
                        "word": "即"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 134,
                        "y": 170,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 152,
                        "y": 170,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 170,
                        "y": 170,
                        "word": "资"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 188,
                        "y": 170,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 203,
                        "y": 170,
                        "word": "交"
                    },
                    {
                        "prob": 100,
                        "w": 16,
                        "h": 16,
                        "x": 221,
                        "y": 171,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 242,
                        "y": 171,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 256,
                        "y": 171,
                        "word": "为"
                    }
                ],
                "direction": 0,
                "height": 163,
                "rowId": 8
            },
            {
                "prob": 84,
                "pos": [
                    {
                        "x": 304,
                        "y": 170
                    },
                    {
                        "x": 330,
                        "y": 170
                    },
                    {
                        "x": 330,
                        "y": 186
                    },
                    {
                        "x": 304,
                        "y": 186
                    }
                ],
                "width": 16,
                "x": 309,
                "angle": -90,
                "y": 165,
                "word": "_年",
                "charInfo": [
                    {
                        "prob": 69,
                        "w": 5,
                        "h": 14,
                        "x": 304,
                        "y": 170,
                        "word": "_"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 311,
                        "y": 170,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 26,
                "rowId": 8
            },
            {
                "prob": 81,
                "pos": [
                    {
                        "x": 328,
                        "y": 172
                    },
                    {
                        "x": 380,
                        "y": 170
                    },
                    {
                        "x": 381,
                        "y": 186
                    },
                    {
                        "x": 329,
                        "y": 189
                    }
                ],
                "width": 52,
                "x": 328,
                "angle": -2,
                "y": 169,
                "word": "_月",
                "charInfo": [
                    {
                        "prob": 63,
                        "w": 30,
                        "h": 14,
                        "x": 329,
                        "y": 172,
                        "word": "_"
                    },
                    {
                        "prob": 100,
                        "w": 13,
                        "h": 14,
                        "x": 361,
                        "y": 170,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 17,
                "rowId": 8
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 381,
                        "y": 178
                    },
                    {
                        "x": 431,
                        "y": 168
                    },
                    {
                        "x": 435,
                        "y": 185
                    },
                    {
                        "x": 385,
                        "y": 195
                    }
                ],
                "width": 51,
                "x": 383,
                "angle": -10,
                "y": 172,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 415,
                        "y": 172,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 18,
                "rowId": 8
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 45,
                        "y": 192
                    },
                    {
                        "x": 101,
                        "y": 192
                    },
                    {
                        "x": 101,
                        "y": 210
                    },
                    {
                        "x": 45,
                        "y": 210
                    }
                ],
                "width": 17,
                "x": 64,
                "angle": -90,
                "y": 172,
                "word": "口即期",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 48,
                        "y": 192,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 63,
                        "y": 192,
                        "word": "即"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 81,
                        "y": 192,
                        "word": "期"
                    }
                ],
                "direction": 0,
                "height": 56,
                "rowId": 9
            },
            {
                "prob": 96,
                "pos": [
                    {
                        "x": 113,
                        "y": 192
                    },
                    {
                        "x": 517,
                        "y": 192
                    },
                    {
                        "x": 517,
                        "y": 211
                    },
                    {
                        "x": 113,
                        "y": 211
                    }
                ],
                "width": 18,
                "x": 306,
                "angle": -89,
                "y": 0,
                "word": "远期：口全额交割○固定期限：交割日为_而对方",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 116,
                        "y": 193,
                        "word": "远"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 134,
                        "y": 193,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 16,
                        "x": 152,
                        "y": 193,
                        "word": "："
                    },
                    {
                        "prob": 93,
                        "w": 14,
                        "h": 16,
                        "x": 168,
                        "y": 193,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 186,
                        "y": 193,
                        "word": "全"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 204,
                        "y": 193,
                        "word": "额"
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 16,
                        "x": 222,
                        "y": 193,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 237,
                        "y": 193,
                        "word": "割"
                    },
                    {
                        "prob": 44,
                        "w": 14,
                        "h": 16,
                        "x": 273,
                        "y": 193,
                        "word": "○"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 291,
                        "y": 193,
                        "word": "固"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 307,
                        "y": 193,
                        "word": "定"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 16,
                        "x": 325,
                        "y": 193,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 343,
                        "y": 193,
                        "word": "限"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 361,
                        "y": 193,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 377,
                        "y": 193,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 397,
                        "y": 193,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 415,
                        "y": 193,
                        "word": "日"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 16,
                        "x": 431,
                        "y": 193,
                        "word": "为"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 16,
                        "x": 449,
                        "y": 193,
                        "word": "_"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 457,
                        "y": 193,
                        "word": "而"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 475,
                        "y": 193,
                        "word": "对"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 493,
                        "y": 193,
                        "word": "方"
                    }
                ],
                "direction": 0,
                "height": 404,
                "rowId": 9
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 533,
                        "y": 194
                    },
                    {
                        "x": 624,
                        "y": 194
                    },
                    {
                        "x": 624,
                        "y": 210
                    },
                    {
                        "x": 533,
                        "y": 210
                    }
                ],
                "width": 16,
                "x": 571,
                "angle": -90,
                "y": 156,
                "word": "年月日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 19,
                        "h": 14,
                        "x": 533,
                        "y": 194,
                        "word": "年"
                    },
                    {
                        "prob": 99,
                        "w": 30,
                        "h": 14,
                        "x": 554,
                        "y": 194,
                        "word": "月"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 609,
                        "y": 194,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 92,
                "rowId": 9
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 45,
                        "y": 214
                    },
                    {
                        "x": 101,
                        "y": 214
                    },
                    {
                        "x": 101,
                        "y": 232
                    },
                    {
                        "x": 45,
                        "y": 232
                    }
                ],
                "width": 17,
                "x": 64,
                "angle": -90,
                "y": 194,
                "word": "口远期",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 48,
                        "y": 214,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 63,
                        "y": 214,
                        "word": "远"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 81,
                        "y": 214,
                        "word": "期"
                    }
                ],
                "direction": 0,
                "height": 56,
                "rowId": 10
            },
            {
                "prob": 97,
                "pos": [
                    {
                        "x": 274,
                        "y": 213
                    },
                    {
                        "x": 453,
                        "y": 215
                    },
                    {
                        "x": 453,
                        "y": 234
                    },
                    {
                        "x": 274,
                        "y": 232
                    }
                ],
                "width": 18,
                "x": 354,
                "angle": -89,
                "y": 133,
                "word": "○择期交易：交割日为",
                "charInfo": [
                    {
                        "prob": 78,
                        "w": 12,
                        "h": 16,
                        "x": 275,
                        "y": 214,
                        "word": "○"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 290,
                        "y": 214,
                        "word": "择"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 311,
                        "y": 214,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 326,
                        "y": 214,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 344,
                        "y": 214,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 362,
                        "y": 215,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 378,
                        "y": 215,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 396,
                        "y": 215,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 416,
                        "y": 215,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 432,
                        "y": 216,
                        "word": "为"
                    }
                ],
                "direction": 0,
                "height": 179,
                "rowId": 10
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 463,
                        "y": 217
                    },
                    {
                        "x": 505,
                        "y": 217
                    },
                    {
                        "x": 505,
                        "y": 232
                    },
                    {
                        "x": 463,
                        "y": 232
                    }
                ],
                "width": 15,
                "x": 476,
                "angle": -90,
                "y": 203,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 12,
                        "x": 484,
                        "y": 217,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 42,
                "rowId": 10
            },
            {
                "prob": 98,
                "pos": [
                    {
                        "x": 515,
                        "y": 214
                    },
                    {
                        "x": 593,
                        "y": 214
                    },
                    {
                        "x": 593,
                        "y": 232
                    },
                    {
                        "x": 515,
                        "y": 232
                    }
                ],
                "width": 17,
                "x": 545,
                "angle": -90,
                "y": 184,
                "word": "_月_日至",
                "charInfo": [
                    {
                        "prob": 94,
                        "w": 3,
                        "h": 15,
                        "x": 515,
                        "y": 214,
                        "word": "_"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 15,
                        "x": 520,
                        "y": 214,
                        "word": "月"
                    },
                    {
                        "prob": 52,
                        "w": 17,
                        "h": 15,
                        "x": 536,
                        "y": 214,
                        "word": "_"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 556,
                        "y": 214,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 572,
                        "y": 214,
                        "word": "至"
                    }
                ],
                "direction": 0,
                "height": 78,
                "rowId": 10
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 620,
                        "y": 215
                    },
                    {
                        "x": 652,
                        "y": 215
                    },
                    {
                        "x": 652,
                        "y": 232
                    },
                    {
                        "x": 620,
                        "y": 232
                    }
                ],
                "width": 16,
                "x": 628,
                "angle": -90,
                "y": 208,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 623,
                        "y": 215,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 31,
                "rowId": 10
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 656,
                        "y": 216
                    },
                    {
                        "x": 684,
                        "y": 216
                    },
                    {
                        "x": 684,
                        "y": 233
                    },
                    {
                        "x": 656,
                        "y": 233
                    }
                ],
                "width": 18,
                "x": 661,
                "angle": -90,
                "y": 210,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 18,
                        "h": 15,
                        "x": 656,
                        "y": 217,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 29,
                "rowId": 10
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 691,
                        "y": 214
                    },
                    {
                        "x": 713,
                        "y": 214
                    },
                    {
                        "x": 713,
                        "y": 233
                    },
                    {
                        "x": 691,
                        "y": 233
                    }
                ],
                "width": 18,
                "x": 693,
                "angle": -90,
                "y": 213,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 697,
                        "y": 215,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 22,
                "rowId": 10
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 168,
                        "y": 239
                    },
                    {
                        "x": 261,
                        "y": 239
                    },
                    {
                        "x": 261,
                        "y": 255
                    },
                    {
                        "x": 168,
                        "y": 255
                    }
                ],
                "width": 16,
                "x": 207,
                "angle": -90,
                "y": 199,
                "word": "口差额交割",
                "charInfo": [
                    {
                        "prob": 65,
                        "w": 13,
                        "h": 14,
                        "x": 171,
                        "y": 239,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 188,
                        "y": 239,
                        "word": "差"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 205,
                        "y": 239,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 222,
                        "y": 239,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 18,
                        "h": 14,
                        "x": 239,
                        "y": 239,
                        "word": "割"
                    }
                ],
                "direction": 0,
                "height": 93,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 271,
                        "y": 237
                    },
                    {
                        "x": 372,
                        "y": 237
                    },
                    {
                        "x": 372,
                        "y": 255
                    },
                    {
                        "x": 271,
                        "y": 255
                    }
                ],
                "width": 17,
                "x": 313,
                "angle": -90,
                "y": 195,
                "word": "交割日为",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 274,
                        "y": 238,
                        "word": "交"
                    },
                    {
                        "prob": 100,
                        "w": 15,
                        "h": 15,
                        "x": 293,
                        "y": 238,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 312,
                        "y": 238,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 327,
                        "y": 238,
                        "word": "为"
                    }
                ],
                "direction": 0,
                "height": 101,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 376,
                        "y": 237
                    },
                    {
                        "x": 402,
                        "y": 237
                    },
                    {
                        "x": 402,
                        "y": 254
                    },
                    {
                        "x": 376,
                        "y": 254
                    }
                ],
                "width": 16,
                "x": 382,
                "angle": -90,
                "y": 232,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 378,
                        "y": 238,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 26,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 411,
                        "y": 236
                    },
                    {
                        "x": 436,
                        "y": 236
                    },
                    {
                        "x": 436,
                        "y": 258
                    },
                    {
                        "x": 411,
                        "y": 258
                    }
                ],
                "width": 22,
                "x": 413,
                "angle": -90,
                "y": 235,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 19,
                        "x": 411,
                        "y": 237,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 24,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 444,
                        "y": 236
                    },
                    {
                        "x": 469,
                        "y": 236
                    },
                    {
                        "x": 469,
                        "y": 256
                    },
                    {
                        "x": 444,
                        "y": 256
                    }
                ],
                "width": 19,
                "x": 447,
                "angle": -90,
                "y": 233,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 17,
                        "x": 453,
                        "y": 237,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 26,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 477,
                        "y": 237
                    },
                    {
                        "x": 567,
                        "y": 237
                    },
                    {
                        "x": 567,
                        "y": 255
                    },
                    {
                        "x": 477,
                        "y": 255
                    }
                ],
                "width": 17,
                "x": 513,
                "angle": -90,
                "y": 201,
                "word": "定盘日为",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 493,
                        "y": 238,
                        "word": "定"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 511,
                        "y": 238,
                        "word": "盘"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 531,
                        "y": 238,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 547,
                        "y": 238,
                        "word": "为"
                    }
                ],
                "direction": 0,
                "height": 90,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 593,
                        "y": 236
                    },
                    {
                        "x": 620,
                        "y": 236
                    },
                    {
                        "x": 620,
                        "y": 255
                    },
                    {
                        "x": 593,
                        "y": 255
                    }
                ],
                "width": 18,
                "x": 598,
                "angle": -90,
                "y": 233,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 597,
                        "y": 237,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 26,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 630,
                        "y": 236
                    },
                    {
                        "x": 655,
                        "y": 236
                    },
                    {
                        "x": 655,
                        "y": 255
                    },
                    {
                        "x": 630,
                        "y": 255
                    }
                ],
                "width": 18,
                "x": 634,
                "angle": -90,
                "y": 233,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 16,
                        "x": 633,
                        "y": 237,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 25,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 657,
                        "y": 237
                    },
                    {
                        "x": 686,
                        "y": 237
                    },
                    {
                        "x": 686,
                        "y": 255
                    },
                    {
                        "x": 657,
                        "y": 255
                    }
                ],
                "width": 17,
                "x": 663,
                "angle": -90,
                "y": 232,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 670,
                        "y": 238,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 28,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 709,
                        "y": 239
                    },
                    {
                        "x": 784,
                        "y": 237
                    },
                    {
                        "x": 785,
                        "y": 255
                    },
                    {
                        "x": 710,
                        "y": 256
                    }
                ],
                "width": 75,
                "x": 709,
                "angle": -1,
                "y": 239,
                "word": "定盘汇率",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 711,
                        "y": 239,
                        "word": "定"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 730,
                        "y": 239,
                        "word": "盘"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 746,
                        "y": 238,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 765,
                        "y": 238,
                        "word": "率"
                    }
                ],
                "direction": 0,
                "height": 16,
                "rowId": 11
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 115,
                        "y": 262
                    },
                    {
                        "x": 283,
                        "y": 260
                    },
                    {
                        "x": 283,
                        "y": 278
                    },
                    {
                        "x": 115,
                        "y": 280
                    }
                ],
                "width": 169,
                "x": 114,
                "angle": 0,
                "y": 260,
                "word": "委托汇率：口市价/口",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 115,
                        "y": 263,
                        "word": "委"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 133,
                        "y": 263,
                        "word": "托"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 151,
                        "y": 263,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 169,
                        "y": 263,
                        "word": "率"
                    },
                    {
                        "prob": 98,
                        "w": 4,
                        "h": 15,
                        "x": 187,
                        "y": 263,
                        "word": "："
                    },
                    {
                        "prob": 100,
                        "w": 16,
                        "h": 15,
                        "x": 203,
                        "y": 262,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 223,
                        "y": 262,
                        "word": "市"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 239,
                        "y": 262,
                        "word": "价"
                    },
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 15,
                        "x": 257,
                        "y": 262,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 267,
                        "y": 262,
                        "word": "口"
                    }
                ],
                "direction": 0,
                "height": 17,
                "rowId": 12
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 375,
                        "y": 261
                    },
                    {
                        "x": 538,
                        "y": 261
                    },
                    {
                        "x": 538,
                        "y": 278
                    },
                    {
                        "x": 375,
                        "y": 278
                    }
                ],
                "width": 18,
                "x": 448,
                "angle": -90,
                "y": 189,
                "word": "(汇率)委托有效期：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 378,
                        "y": 261,
                        "word": "("
                    },
                    {
                        "prob": 100,
                        "w": 16,
                        "h": 15,
                        "x": 387,
                        "y": 261,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 407,
                        "y": 261,
                        "word": "率"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 425,
                        "y": 261,
                        "word": ")"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 441,
                        "y": 261,
                        "word": "委"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 459,
                        "y": 261,
                        "word": "托"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 477,
                        "y": 261,
                        "word": "有"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 492,
                        "y": 261,
                        "word": "效"
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 15,
                        "x": 512,
                        "y": 261,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 527,
                        "y": 261,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 162,
                "rowId": 12
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 577,
                        "y": 258
                    },
                    {
                        "x": 602,
                        "y": 258
                    },
                    {
                        "x": 602,
                        "y": 277
                    },
                    {
                        "x": 577,
                        "y": 277
                    }
                ],
                "width": 18,
                "x": 580,
                "angle": -90,
                "y": 255,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 21,
                        "h": 16,
                        "x": 577,
                        "y": 259,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 25,
                "rowId": 12
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 611,
                        "y": 258
                    },
                    {
                        "x": 635,
                        "y": 258
                    },
                    {
                        "x": 635,
                        "y": 280
                    },
                    {
                        "x": 611,
                        "y": 280
                    }
                ],
                "width": 22,
                "x": 613,
                "angle": -90,
                "y": 257,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 19,
                        "x": 611,
                        "y": 259,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 24,
                "rowId": 12
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 649,
                        "y": 261
                    },
                    {
                        "x": 687,
                        "y": 261
                    },
                    {
                        "x": 687,
                        "y": 277
                    },
                    {
                        "x": 649,
                        "y": 277
                    }
                ],
                "width": 16,
                "x": 661,
                "angle": -90,
                "y": 250,
                "word": "日至",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 14,
                        "x": 651,
                        "y": 262,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 667,
                        "y": 262,
                        "word": "至"
                    }
                ],
                "direction": 0,
                "height": 38,
                "rowId": 12
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 717,
                        "y": 260
                    },
                    {
                        "x": 743,
                        "y": 260
                    },
                    {
                        "x": 743,
                        "y": 278
                    },
                    {
                        "x": 717,
                        "y": 278
                    }
                ],
                "width": 18,
                "x": 721,
                "angle": -90,
                "y": 255,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 16,
                        "x": 720,
                        "y": 261,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 27,
                "rowId": 12
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 752,
                        "y": 262
                    },
                    {
                        "x": 789,
                        "y": 262
                    },
                    {
                        "x": 789,
                        "y": 277
                    },
                    {
                        "x": 752,
                        "y": 277
                    }
                ],
                "width": 14,
                "x": 763,
                "angle": -90,
                "y": 251,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 19,
                        "h": 12,
                        "x": 752,
                        "y": 262,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 37,
                "rowId": 12
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 786,
                        "y": 258
                    },
                    {
                        "x": 810,
                        "y": 258
                    },
                    {
                        "x": 810,
                        "y": 279
                    },
                    {
                        "x": 786,
                        "y": 279
                    }
                ],
                "width": 20,
                "x": 788,
                "angle": -90,
                "y": 257,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 17,
                        "x": 793,
                        "y": 259,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 23,
                "rowId": 12
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 115,
                        "y": 299
                    },
                    {
                        "x": 229,
                        "y": 299
                    },
                    {
                        "x": 229,
                        "y": 317
                    },
                    {
                        "x": 115,
                        "y": 317
                    }
                ],
                "width": 16,
                "x": 164,
                "angle": -90,
                "y": 249,
                "word": "币种1/币种2：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 118,
                        "y": 300,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 135,
                        "y": 300,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 158,
                        "y": 300,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 164,
                        "y": 300,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 175,
                        "y": 300,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 191,
                        "y": 300,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 212,
                        "y": 300,
                        "word": "2"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 222,
                        "y": 300,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 114,
                "rowId": 13
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 344,
                        "y": 299
                    },
                    {
                        "x": 646,
                        "y": 297
                    },
                    {
                        "x": 646,
                        "y": 316
                    },
                    {
                        "x": 344,
                        "y": 318
                    }
                ],
                "width": 19,
                "x": 486,
                "angle": -90,
                "y": 156,
                "word": "交易方向：口近端买入/远端卖出币种1",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 345,
                        "y": 300,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 363,
                        "y": 300,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 378,
                        "y": 300,
                        "word": "方"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 399,
                        "y": 300,
                        "word": "向"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 414,
                        "y": 300,
                        "word": "："
                    },
                    {
                        "prob": 92,
                        "w": 12,
                        "h": 16,
                        "x": 432,
                        "y": 300,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 448,
                        "y": 300,
                        "word": "近"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 468,
                        "y": 299,
                        "word": "端"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 486,
                        "y": 299,
                        "word": "买"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 504,
                        "y": 299,
                        "word": "入"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 520,
                        "y": 299,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 529,
                        "y": 299,
                        "word": "远"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 544,
                        "y": 299,
                        "word": "端"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 565,
                        "y": 299,
                        "word": "卖"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 582,
                        "y": 299,
                        "word": "出"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 598,
                        "y": 299,
                        "word": "币"
                    },
                    {
                        "prob": 100,
                        "w": 19,
                        "h": 16,
                        "x": 614,
                        "y": 299,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 639,
                        "y": 299,
                        "word": "1"
                    }
                ],
                "direction": 0,
                "height": 303,
                "rowId": 13
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 679,
                        "y": 299
                    },
                    {
                        "x": 895,
                        "y": 299
                    },
                    {
                        "x": 895,
                        "y": 317
                    },
                    {
                        "x": 679,
                        "y": 317
                    }
                ],
                "width": 17,
                "x": 779,
                "angle": -90,
                "y": 200,
                "word": "近端卖出/远端买入币种1",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 697,
                        "y": 300,
                        "word": "近"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 715,
                        "y": 300,
                        "word": "端"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 733,
                        "y": 300,
                        "word": "卖"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 753,
                        "y": 300,
                        "word": "出"
                    },
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 15,
                        "x": 769,
                        "y": 300,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 779,
                        "y": 300,
                        "word": "远"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 795,
                        "y": 300,
                        "word": "端"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 813,
                        "y": 300,
                        "word": "买"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 831,
                        "y": 300,
                        "word": "入"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 849,
                        "y": 300,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 865,
                        "y": 300,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 15,
                        "x": 887,
                        "y": 300,
                        "word": "1"
                    }
                ],
                "direction": 0,
                "height": 216,
                "rowId": 13
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 115,
                        "y": 322
                    },
                    {
                        "x": 260,
                        "y": 322
                    },
                    {
                        "x": 260,
                        "y": 340
                    },
                    {
                        "x": 115,
                        "y": 340
                    }
                ],
                "width": 17,
                "x": 179,
                "angle": -90,
                "y": 258,
                "word": "近端：币种1金额",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 116,
                        "y": 322,
                        "word": "近"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 134,
                        "y": 322,
                        "word": "端"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 152,
                        "y": 322,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 15,
                        "x": 172,
                        "y": 322,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 188,
                        "y": 322,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 208,
                        "y": 322,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 221,
                        "y": 322,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 239,
                        "y": 322,
                        "word": "额"
                    }
                ],
                "direction": 0,
                "height": 145,
                "rowId": 14
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 370,
                        "y": 322
                    },
                    {
                        "x": 460,
                        "y": 322
                    },
                    {
                        "x": 460,
                        "y": 340
                    },
                    {
                        "x": 370,
                        "y": 340
                    }
                ],
                "width": 17,
                "x": 406,
                "angle": -90,
                "y": 286,
                "word": "币种2金额",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 15,
                        "x": 373,
                        "y": 322,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 18,
                        "h": 15,
                        "x": 386,
                        "y": 322,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 15,
                        "x": 408,
                        "y": 322,
                        "word": "2"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 424,
                        "y": 322,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 442,
                        "y": 322,
                        "word": "额"
                    }
                ],
                "direction": 0,
                "height": 90,
                "rowId": 14
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 567,
                        "y": 322
                    },
                    {
                        "x": 643,
                        "y": 322
                    },
                    {
                        "x": 643,
                        "y": 340
                    },
                    {
                        "x": 567,
                        "y": 340
                    }
                ],
                "width": 17,
                "x": 597,
                "angle": -90,
                "y": 293,
                "word": "近端汇率",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 570,
                        "y": 322,
                        "word": "近"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 588,
                        "y": 322,
                        "word": "端"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 608,
                        "y": 322,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 624,
                        "y": 322,
                        "word": "率"
                    }
                ],
                "direction": 0,
                "height": 77,
                "rowId": 14
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 700,
                        "y": 324
                    },
                    {
                        "x": 754,
                        "y": 324
                    },
                    {
                        "x": 754,
                        "y": 339
                    },
                    {
                        "x": 700,
                        "y": 339
                    }
                ],
                "width": 15,
                "x": 720,
                "angle": -90,
                "y": 305,
                "word": "交割日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 13,
                        "x": 701,
                        "y": 324,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 13,
                        "x": 721,
                        "y": 324,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 13,
                        "x": 739,
                        "y": 324,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 53,
                "rowId": 14
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 753,
                        "y": 325
                    },
                    {
                        "x": 863,
                        "y": 325
                    },
                    {
                        "x": 863,
                        "y": 341
                    },
                    {
                        "x": 753,
                        "y": 341
                    }
                ],
                "width": 15,
                "x": 799,
                "angle": -90,
                "y": 277,
                "word": "年月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 790,
                        "y": 325,
                        "word": "年"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 826,
                        "y": 325,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 109,
                "rowId": 14
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 862,
                        "y": 325
                    },
                    {
                        "x": 875,
                        "y": 325
                    },
                    {
                        "x": 875,
                        "y": 338
                    },
                    {
                        "x": 862,
                        "y": 338
                    }
                ],
                "width": 13,
                "x": 862,
                "angle": -90,
                "y": 325,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 11,
                        "x": 864,
                        "y": 325,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 13,
                "rowId": 14
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 336
                    },
                    {
                        "x": 101,
                        "y": 336
                    },
                    {
                        "x": 101,
                        "y": 352
                    },
                    {
                        "x": 44,
                        "y": 352
                    }
                ],
                "width": 16,
                "x": 64,
                "angle": -90,
                "y": 315,
                "word": "掉期",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 63,
                        "y": 336,
                        "word": "掉"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 14,
                        "x": 82,
                        "y": 336,
                        "word": "期"
                    }
                ],
                "direction": 0,
                "height": 57,
                "rowId": 15
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 115,
                        "y": 346
                    },
                    {
                        "x": 260,
                        "y": 346
                    },
                    {
                        "x": 260,
                        "y": 363
                    },
                    {
                        "x": 115,
                        "y": 363
                    }
                ],
                "width": 18,
                "x": 178,
                "angle": -90,
                "y": 281,
                "word": "远端：币种1金额",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 116,
                        "y": 346,
                        "word": "远"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 134,
                        "y": 346,
                        "word": "端"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 152,
                        "y": 346,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 15,
                        "x": 172,
                        "y": 346,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 185,
                        "y": 346,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 208,
                        "y": 346,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 221,
                        "y": 346,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 239,
                        "y": 346,
                        "word": "额"
                    }
                ],
                "direction": 0,
                "height": 145,
                "rowId": 16
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 368,
                        "y": 346
                    },
                    {
                        "x": 460,
                        "y": 344
                    },
                    {
                        "x": 460,
                        "y": 362
                    },
                    {
                        "x": 368,
                        "y": 363
                    }
                ],
                "width": 91,
                "x": 368,
                "angle": 0,
                "y": 345,
                "word": "币种2金额",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 374,
                        "y": 347,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 389,
                        "y": 347,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 9,
                        "h": 15,
                        "x": 410,
                        "y": 346,
                        "word": "2"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 425,
                        "y": 346,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 18,
                        "h": 15,
                        "x": 440,
                        "y": 346,
                        "word": "额"
                    }
                ],
                "direction": 0,
                "height": 17,
                "rowId": 16
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 567,
                        "y": 343
                    },
                    {
                        "x": 626,
                        "y": 345
                    },
                    {
                        "x": 625,
                        "y": 364
                    },
                    {
                        "x": 567,
                        "y": 362
                    }
                ],
                "width": 18,
                "x": 587,
                "angle": -88,
                "y": 324,
                "word": "远期点",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 570,
                        "y": 345,
                        "word": "远"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 588,
                        "y": 345,
                        "word": "期"
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 16,
                        "x": 607,
                        "y": 346,
                        "word": "点"
                    }
                ],
                "direction": 0,
                "height": 59,
                "rowId": 16
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 702,
                        "y": 346
                    },
                    {
                        "x": 754,
                        "y": 346
                    },
                    {
                        "x": 754,
                        "y": 360
                    },
                    {
                        "x": 702,
                        "y": 360
                    }
                ],
                "width": 14,
                "x": 721,
                "angle": -90,
                "y": 327,
                "word": "交割日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 12,
                        "x": 703,
                        "y": 346,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 12,
                        "x": 720,
                        "y": 346,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 12,
                        "x": 740,
                        "y": 346,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 52,
                "rowId": 16
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 788,
                        "y": 346
                    },
                    {
                        "x": 809,
                        "y": 346
                    },
                    {
                        "x": 809,
                        "y": 359
                    },
                    {
                        "x": 788,
                        "y": 359
                    }
                ],
                "width": 13,
                "x": 793,
                "angle": -90,
                "y": 343,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 11,
                        "x": 791,
                        "y": 346,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 21,
                "rowId": 16
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 825,
                        "y": 347
                    },
                    {
                        "x": 841,
                        "y": 347
                    },
                    {
                        "x": 841,
                        "y": 360
                    },
                    {
                        "x": 825,
                        "y": 360
                    }
                ],
                "width": 13,
                "x": 826,
                "angle": -90,
                "y": 345,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 11,
                        "x": 825,
                        "y": 347,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 16,
                "rowId": 16
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 862,
                        "y": 347
                    },
                    {
                        "x": 875,
                        "y": 347
                    },
                    {
                        "x": 875,
                        "y": 360
                    },
                    {
                        "x": 862,
                        "y": 360
                    }
                ],
                "width": 13,
                "x": 862,
                "angle": -90,
                "y": 347,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 11,
                        "x": 863,
                        "y": 347,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 13,
                "rowId": 16
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 113,
                        "y": 367
                    },
                    {
                        "x": 212,
                        "y": 366
                    },
                    {
                        "x": 212,
                        "y": 384
                    },
                    {
                        "x": 113,
                        "y": 385
                    }
                ],
                "width": 98,
                "x": 113,
                "angle": -1,
                "y": 366,
                "word": "委托有效期：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 117,
                        "y": 368,
                        "word": "委"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 134,
                        "y": 368,
                        "word": "托"
                    },
                    {
                        "prob": 100,
                        "w": 13,
                        "h": 15,
                        "x": 152,
                        "y": 367,
                        "word": "有"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 169,
                        "y": 367,
                        "word": "效"
                    },
                    {
                        "prob": 100,
                        "w": 15,
                        "h": 15,
                        "x": 186,
                        "y": 367,
                        "word": "期"
                    },
                    {
                        "prob": 94,
                        "w": 5,
                        "h": 15,
                        "x": 205,
                        "y": 367,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 17,
                "rowId": 17
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 253,
                        "y": 368
                    },
                    {
                        "x": 309,
                        "y": 368
                    },
                    {
                        "x": 309,
                        "y": 386
                    },
                    {
                        "x": 253,
                        "y": 386
                    }
                ],
                "width": 18,
                "x": 272,
                "angle": -90,
                "y": 348,
                "word": "年月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 258,
                        "y": 369,
                        "word": "年"
                    },
                    {
                        "prob": 99,
                        "w": 29,
                        "h": 16,
                        "x": 276,
                        "y": 369,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 54,
                "rowId": 17
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 326,
                        "y": 366
                    },
                    {
                        "x": 484,
                        "y": 368
                    },
                    {
                        "x": 484,
                        "y": 388
                    },
                    {
                        "x": 326,
                        "y": 386
                    }
                ],
                "width": 19,
                "x": 395,
                "angle": -88,
                "y": 296,
                "word": "日至年月日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 17,
                        "x": 329,
                        "y": 367,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 17,
                        "x": 345,
                        "y": 367,
                        "word": "至"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 17,
                        "x": 397,
                        "y": 367,
                        "word": "年"
                    },
                    {
                        "prob": 99,
                        "w": 30,
                        "h": 17,
                        "x": 415,
                        "y": 367,
                        "word": "月"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 17,
                        "x": 468,
                        "y": 368,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 159,
                "rowId": 17
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 406
                    },
                    {
                        "x": 900,
                        "y": 406
                    },
                    {
                        "x": 900,
                        "y": 423
                    },
                    {
                        "x": 619,
                        "y": 423
                    }
                ],
                "width": 18,
                "x": 751,
                "angle": -90,
                "y": 275,
                "word": "交易展期原因(仅展期委托时填写)：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 620,
                        "y": 407,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 637,
                        "y": 407,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 654,
                        "y": 407,
                        "word": "展"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 673,
                        "y": 407,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 690,
                        "y": 407,
                        "word": "原"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 707,
                        "y": 407,
                        "word": "因"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 732,
                        "y": 407,
                        "word": "("
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 741,
                        "y": 407,
                        "word": "仅"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 760,
                        "y": 407,
                        "word": "展"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 779,
                        "y": 407,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 794,
                        "y": 407,
                        "word": "委"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 811,
                        "y": 407,
                        "word": "托"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 830,
                        "y": 407,
                        "word": "时"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 847,
                        "y": 407,
                        "word": "填"
                    },
                    {
                        "prob": 100,
                        "w": 16,
                        "h": 15,
                        "x": 864,
                        "y": 407,
                        "word": "写"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 883,
                        "y": 407,
                        "word": ")"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 892,
                        "y": 407,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 280,
                "rowId": 18
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 101,
                        "y": 443
                    },
                    {
                        "x": 193,
                        "y": 443
                    },
                    {
                        "x": 193,
                        "y": 460
                    },
                    {
                        "x": 101,
                        "y": 460
                    }
                ],
                "width": 18,
                "x": 138,
                "angle": -90,
                "y": 405,
                "word": "口择期交割",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 102,
                        "y": 443,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 120,
                        "y": 443,
                        "word": "择"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 138,
                        "y": 443,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 155,
                        "y": 443,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 19,
                        "h": 15,
                        "x": 171,
                        "y": 443,
                        "word": "割"
                    }
                ],
                "direction": 0,
                "height": 91,
                "rowId": 19
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 457
                    },
                    {
                        "x": 416,
                        "y": 457
                    },
                    {
                        "x": 416,
                        "y": 474
                    },
                    {
                        "x": 263,
                        "y": 474
                    }
                ],
                "width": 17,
                "x": 330,
                "angle": -89,
                "y": 388,
                "word": "原交易证实书编号：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 266,
                        "y": 457,
                        "word": "原"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 284,
                        "y": 457,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 302,
                        "y": 457,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 317,
                        "y": 457,
                        "word": "证"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 337,
                        "y": 457,
                        "word": "实"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 355,
                        "y": 457,
                        "word": "书"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 371,
                        "y": 457,
                        "word": "编"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 389,
                        "y": 457,
                        "word": "号"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 406,
                        "y": 457,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 153,
                "rowId": 20
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 101,
                        "y": 478
                    },
                    {
                        "x": 193,
                        "y": 478
                    },
                    {
                        "x": 193,
                        "y": 496
                    },
                    {
                        "x": 101,
                        "y": 496
                    }
                ],
                "width": 18,
                "x": 138,
                "angle": -90,
                "y": 441,
                "word": "口提前交割",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 11,
                        "h": 15,
                        "x": 104,
                        "y": 479,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 118,
                        "y": 479,
                        "word": "提"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 137,
                        "y": 479,
                        "word": "前"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 156,
                        "y": 479,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 173,
                        "y": 479,
                        "word": "割"
                    }
                ],
                "direction": 0,
                "height": 91,
                "rowId": 21
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 264,
                        "y": 478
                    },
                    {
                        "x": 388,
                        "y": 478
                    },
                    {
                        "x": 388,
                        "y": 496
                    },
                    {
                        "x": 264,
                        "y": 496
                    }
                ],
                "width": 17,
                "x": 318,
                "angle": -89,
                "y": 425,
                "word": "交割/展期日期：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 267,
                        "y": 478,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 285,
                        "y": 478,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 300,
                        "y": 478,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 312,
                        "y": 478,
                        "word": "展"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 327,
                        "y": 478,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 347,
                        "y": 478,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 363,
                        "y": 478,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 381,
                        "y": 478,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 124,
                "rowId": 21
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 437,
                        "y": 477
                    },
                    {
                        "x": 462,
                        "y": 477
                    },
                    {
                        "x": 462,
                        "y": 496
                    },
                    {
                        "x": 437,
                        "y": 496
                    }
                ],
                "width": 18,
                "x": 441,
                "angle": -90,
                "y": 474,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 442,
                        "y": 478,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 25,
                "rowId": 21
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 490,
                        "y": 479
                    },
                    {
                        "x": 514,
                        "y": 479
                    },
                    {
                        "x": 514,
                        "y": 497
                    },
                    {
                        "x": 490,
                        "y": 497
                    }
                ],
                "width": 19,
                "x": 493,
                "angle": -90,
                "y": 476,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 492,
                        "y": 480,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 24,
                "rowId": 21
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 542,
                        "y": 478
                    },
                    {
                        "x": 566,
                        "y": 478
                    },
                    {
                        "x": 566,
                        "y": 497
                    },
                    {
                        "x": 542,
                        "y": 497
                    }
                ],
                "width": 18,
                "x": 545,
                "angle": -90,
                "y": 476,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 549,
                        "y": 479,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 23,
                "rowId": 21
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 266,
                        "y": 503
                    },
                    {
                        "x": 321,
                        "y": 503
                    },
                    {
                        "x": 321,
                        "y": 519
                    },
                    {
                        "x": 266,
                        "y": 519
                    }
                ],
                "width": 17,
                "x": 285,
                "angle": -90,
                "y": 483,
                "word": "币种：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 14,
                        "x": 269,
                        "y": 503,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 284,
                        "y": 503,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 14,
                        "x": 304,
                        "y": 503,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 56,
                "rowId": 22
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 369,
                        "y": 502
                    },
                    {
                        "x": 494,
                        "y": 501
                    },
                    {
                        "x": 494,
                        "y": 519
                    },
                    {
                        "x": 370,
                        "y": 521
                    }
                ],
                "width": 124,
                "x": 369,
                "angle": 0,
                "y": 501,
                "word": "交割/展期金额：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 371,
                        "y": 503,
                        "word": "交"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 16,
                        "x": 389,
                        "y": 503,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 406,
                        "y": 503,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 415,
                        "y": 503,
                        "word": "展"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 433,
                        "y": 502,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 451,
                        "y": 502,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 467,
                        "y": 502,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 484,
                        "y": 502,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 18,
                "rowId": 22
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 101,
                        "y": 515
                    },
                    {
                        "x": 193,
                        "y": 515
                    },
                    {
                        "x": 193,
                        "y": 533
                    },
                    {
                        "x": 101,
                        "y": 533
                    }
                ],
                "width": 18,
                "x": 138,
                "angle": -90,
                "y": 478,
                "word": "口向后展期",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 13,
                        "h": 15,
                        "x": 104,
                        "y": 516,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 120,
                        "y": 516,
                        "word": "向"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 137,
                        "y": 516,
                        "word": "后"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 156,
                        "y": 516,
                        "word": "展"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 173,
                        "y": 516,
                        "word": "期"
                    }
                ],
                "direction": 0,
                "height": 91,
                "rowId": 23
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 264,
                        "y": 585
                    },
                    {
                        "x": 327,
                        "y": 585
                    },
                    {
                        "x": 327,
                        "y": 603
                    },
                    {
                        "x": 264,
                        "y": 603
                    }
                ],
                "width": 17,
                "x": 287,
                "angle": -90,
                "y": 563,
                "word": "第一笔：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 265,
                        "y": 586,
                        "word": "第"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 284,
                        "y": 586,
                        "word": "一"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 301,
                        "y": 586,
                        "word": "笔"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 319,
                        "y": 586,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 62,
                "rowId": 24
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 585
                    },
                    {
                        "x": 850,
                        "y": 585
                    },
                    {
                        "x": 850,
                        "y": 603
                    },
                    {
                        "x": 619,
                        "y": 603
                    }
                ],
                "width": 17,
                "x": 727,
                "angle": -90,
                "y": 479,
                "word": "第二笔：(如超过两笔可附页)",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 15,
                        "x": 620,
                        "y": 585,
                        "word": "第"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 638,
                        "y": 585,
                        "word": "二"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 656,
                        "y": 585,
                        "word": "笔"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 674,
                        "y": 585,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 690,
                        "y": 585,
                        "word": "("
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 699,
                        "y": 585,
                        "word": "如"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 717,
                        "y": 585,
                        "word": "超"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 735,
                        "y": 585,
                        "word": "过"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 750,
                        "y": 585,
                        "word": "两"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 771,
                        "y": 585,
                        "word": "笔"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 786,
                        "y": 585,
                        "word": "可"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 804,
                        "y": 585,
                        "word": "附"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 822,
                        "y": 585,
                        "word": "页"
                    },
                    {
                        "prob": 99,
                        "w": 8,
                        "h": 15,
                        "x": 840,
                        "y": 585,
                        "word": ")"
                    }
                ],
                "direction": 0,
                "height": 231,
                "rowId": 25
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 610
                    },
                    {
                        "x": 403,
                        "y": 608
                    },
                    {
                        "x": 404,
                        "y": 626
                    },
                    {
                        "x": 263,
                        "y": 628
                    }
                ],
                "width": 141,
                "x": 262,
                "angle": 0,
                "y": 609,
                "word": "交易币种：货币1",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 16,
                        "x": 266,
                        "y": 610,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 284,
                        "y": 610,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 302,
                        "y": 610,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 318,
                        "y": 610,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 336,
                        "y": 609,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 354,
                        "y": 609,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 372,
                        "y": 609,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 391,
                        "y": 609,
                        "word": "1"
                    }
                ],
                "direction": 0,
                "height": 17,
                "rowId": 26
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 435,
                        "y": 610
                    },
                    {
                        "x": 498,
                        "y": 610
                    },
                    {
                        "x": 498,
                        "y": 626
                    },
                    {
                        "x": 435,
                        "y": 626
                    }
                ],
                "width": 16,
                "x": 459,
                "angle": -90,
                "y": 587,
                "word": "/货币2",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 438,
                        "y": 610,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 446,
                        "y": 610,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 463,
                        "y": 610,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 484,
                        "y": 610,
                        "word": "2"
                    }
                ],
                "direction": 0,
                "height": 63,
                "rowId": 26
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 610
                    },
                    {
                        "x": 760,
                        "y": 610
                    },
                    {
                        "x": 760,
                        "y": 628
                    },
                    {
                        "x": 619,
                        "y": 628
                    }
                ],
                "width": 17,
                "x": 681,
                "angle": -90,
                "y": 549,
                "word": "交易币种：货币1",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 620,
                        "y": 610,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 638,
                        "y": 610,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 656,
                        "y": 610,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 672,
                        "y": 610,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 692,
                        "y": 610,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 708,
                        "y": 610,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 728,
                        "y": 610,
                        "word": "币"
                    },
                    {
                        "prob": 98,
                        "w": 5,
                        "h": 15,
                        "x": 747,
                        "y": 610,
                        "word": "1"
                    }
                ],
                "direction": 0,
                "height": 140,
                "rowId": 26
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 789,
                        "y": 610
                    },
                    {
                        "x": 852,
                        "y": 610
                    },
                    {
                        "x": 852,
                        "y": 626
                    },
                    {
                        "x": 789,
                        "y": 626
                    }
                ],
                "width": 16,
                "x": 812,
                "angle": -90,
                "y": 587,
                "word": "/货币2",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 792,
                        "y": 610,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 800,
                        "y": 610,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 819,
                        "y": 610,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 14,
                        "x": 838,
                        "y": 610,
                        "word": "2"
                    }
                ],
                "direction": 0,
                "height": 63,
                "rowId": 26
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 632
                    },
                    {
                        "x": 395,
                        "y": 632
                    },
                    {
                        "x": 395,
                        "y": 649
                    },
                    {
                        "x": 263,
                        "y": 649
                    }
                ],
                "width": 18,
                "x": 320,
                "angle": -90,
                "y": 574,
                "word": "交易类型：买入",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 266,
                        "y": 633,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 285,
                        "y": 633,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 302,
                        "y": 633,
                        "word": "类"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 319,
                        "y": 633,
                        "word": "型"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 338,
                        "y": 633,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 363,
                        "y": 633,
                        "word": "买"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 380,
                        "y": 633,
                        "word": "入"
                    }
                ],
                "direction": 0,
                "height": 133,
                "rowId": 27
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 448,
                        "y": 632
                    },
                    {
                        "x": 590,
                        "y": 632
                    },
                    {
                        "x": 590,
                        "y": 649
                    },
                    {
                        "x": 448,
                        "y": 649
                    }
                ],
                "width": 18,
                "x": 510,
                "angle": -90,
                "y": 570,
                "word": "口货币1看涨期权",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 451,
                        "y": 633,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 468,
                        "y": 633,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 486,
                        "y": 633,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 507,
                        "y": 633,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 518,
                        "y": 633,
                        "word": "看"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 537,
                        "y": 633,
                        "word": "涨"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 556,
                        "y": 633,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 573,
                        "y": 633,
                        "word": "权"
                    }
                ],
                "direction": 0,
                "height": 142,
                "rowId": 27
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 632
                    },
                    {
                        "x": 752,
                        "y": 632
                    },
                    {
                        "x": 752,
                        "y": 649
                    },
                    {
                        "x": 619,
                        "y": 649
                    }
                ],
                "width": 18,
                "x": 677,
                "angle": -90,
                "y": 575,
                "word": "交易类型：买入",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 620,
                        "y": 633,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 639,
                        "y": 633,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 656,
                        "y": 633,
                        "word": "类"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 675,
                        "y": 633,
                        "word": "型"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 692,
                        "y": 633,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 716,
                        "y": 633,
                        "word": "买"
                    },
                    {
                        "prob": 99,
                        "w": 18,
                        "h": 15,
                        "x": 733,
                        "y": 633,
                        "word": "入"
                    }
                ],
                "direction": 0,
                "height": 132,
                "rowId": 27
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 803,
                        "y": 632
                    },
                    {
                        "x": 945,
                        "y": 632
                    },
                    {
                        "x": 945,
                        "y": 649
                    },
                    {
                        "x": 803,
                        "y": 649
                    }
                ],
                "width": 18,
                "x": 865,
                "angle": -90,
                "y": 570,
                "word": "口货币1看涨期权",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 804,
                        "y": 632,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 822,
                        "y": 632,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 842,
                        "y": 632,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 862,
                        "y": 632,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 873,
                        "y": 632,
                        "word": "看"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 891,
                        "y": 632,
                        "word": "涨"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 911,
                        "y": 632,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 926,
                        "y": 632,
                        "word": "权"
                    }
                ],
                "direction": 0,
                "height": 142,
                "rowId": 27
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 337,
                        "y": 654
                    },
                    {
                        "x": 394,
                        "y": 654
                    },
                    {
                        "x": 394,
                        "y": 670
                    },
                    {
                        "x": 337,
                        "y": 670
                    }
                ],
                "width": 17,
                "x": 357,
                "angle": -90,
                "y": 634,
                "word": "口卖出",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 13,
                        "h": 14,
                        "x": 340,
                        "y": 655,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 14,
                        "x": 356,
                        "y": 655,
                        "word": "卖"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 376,
                        "y": 655,
                        "word": "出"
                    }
                ],
                "direction": 0,
                "height": 57,
                "rowId": 28
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 444,
                        "y": 654
                    },
                    {
                        "x": 586,
                        "y": 654
                    },
                    {
                        "x": 586,
                        "y": 671
                    },
                    {
                        "x": 444,
                        "y": 671
                    }
                ],
                "width": 18,
                "x": 506,
                "angle": -90,
                "y": 592,
                "word": "口货币1看跌期权",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 445,
                        "y": 654,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 463,
                        "y": 654,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 480,
                        "y": 654,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 503,
                        "y": 654,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 514,
                        "y": 654,
                        "word": "看"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 532,
                        "y": 654,
                        "word": "跌"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 550,
                        "y": 654,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 567,
                        "y": 654,
                        "word": "权"
                    }
                ],
                "direction": 0,
                "height": 142,
                "rowId": 28
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 693,
                        "y": 653
                    },
                    {
                        "x": 748,
                        "y": 655
                    },
                    {
                        "x": 747,
                        "y": 672
                    },
                    {
                        "x": 693,
                        "y": 670
                    }
                ],
                "width": 16,
                "x": 712,
                "angle": -87,
                "y": 635,
                "word": "口卖出",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 696,
                        "y": 655,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 14,
                        "x": 712,
                        "y": 655,
                        "word": "卖"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 732,
                        "y": 656,
                        "word": "出"
                    }
                ],
                "direction": 0,
                "height": 55,
                "rowId": 28
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 798,
                        "y": 654
                    },
                    {
                        "x": 941,
                        "y": 654
                    },
                    {
                        "x": 941,
                        "y": 671
                    },
                    {
                        "x": 798,
                        "y": 671
                    }
                ],
                "width": 18,
                "x": 861,
                "angle": -90,
                "y": 592,
                "word": "口货币1看跌期权",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 799,
                        "y": 654,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 817,
                        "y": 654,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 837,
                        "y": 654,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 857,
                        "y": 654,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 868,
                        "y": 654,
                        "word": "看"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 886,
                        "y": 654,
                        "word": "跌"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 904,
                        "y": 654,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 921,
                        "y": 654,
                        "word": "权"
                    }
                ],
                "direction": 0,
                "height": 142,
                "rowId": 28
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 677
                    },
                    {
                        "x": 205,
                        "y": 677
                    },
                    {
                        "x": 205,
                        "y": 695
                    },
                    {
                        "x": 44,
                        "y": 695
                    }
                ],
                "width": 17,
                "x": 116,
                "angle": -90,
                "y": 605,
                "word": "口人民币对外汇期权",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 15,
                        "x": 48,
                        "y": 677,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 66,
                        "y": 677,
                        "word": "人"
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 15,
                        "x": 84,
                        "y": 677,
                        "word": "民"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 100,
                        "y": 677,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 115,
                        "y": 677,
                        "word": "对"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 136,
                        "y": 677,
                        "word": "外"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 152,
                        "y": 677,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 170,
                        "y": 677,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 188,
                        "y": 677,
                        "word": "权"
                    }
                ],
                "direction": 0,
                "height": 161,
                "rowId": 29
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 677
                    },
                    {
                        "x": 346,
                        "y": 677
                    },
                    {
                        "x": 346,
                        "y": 695
                    },
                    {
                        "x": 263,
                        "y": 695
                    }
                ],
                "width": 16,
                "x": 295,
                "angle": -90,
                "y": 644,
                "word": "执行汇率：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 266,
                        "y": 678,
                        "word": "执"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 285,
                        "y": 678,
                        "word": "行"
                    },
                    {
                        "prob": 100,
                        "w": 13,
                        "h": 15,
                        "x": 301,
                        "y": 678,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 318,
                        "y": 678,
                        "word": "率"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 337,
                        "y": 678,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 82,
                "rowId": 29
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 618,
                        "y": 677
                    },
                    {
                        "x": 701,
                        "y": 677
                    },
                    {
                        "x": 701,
                        "y": 695
                    },
                    {
                        "x": 618,
                        "y": 695
                    }
                ],
                "width": 16,
                "x": 650,
                "angle": -90,
                "y": 644,
                "word": "执行汇率：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 621,
                        "y": 678,
                        "word": "执"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 640,
                        "y": 678,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 654,
                        "y": 678,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 673,
                        "y": 678,
                        "word": "率"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 692,
                        "y": 678,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 82,
                "rowId": 30
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 700
                    },
                    {
                        "x": 361,
                        "y": 700
                    },
                    {
                        "x": 361,
                        "y": 718
                    },
                    {
                        "x": 263,
                        "y": 718
                    }
                ],
                "width": 17,
                "x": 304,
                "angle": -90,
                "y": 660,
                "word": "货币1金额：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 266,
                        "y": 700,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 284,
                        "y": 700,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 306,
                        "y": 700,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 318,
                        "y": 700,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 336,
                        "y": 700,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 356,
                        "y": 700,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 99,
                "rowId": 31
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 700
                    },
                    {
                        "x": 719,
                        "y": 700
                    },
                    {
                        "x": 719,
                        "y": 718
                    },
                    {
                        "x": 619,
                        "y": 718
                    }
                ],
                "width": 17,
                "x": 661,
                "angle": -90,
                "y": 660,
                "word": "货币1金额：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 620,
                        "y": 701,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 641,
                        "y": 701,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 662,
                        "y": 701,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 672,
                        "y": 701,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 691,
                        "y": 701,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 709,
                        "y": 701,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 99,
                "rowId": 32
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 710
                    },
                    {
                        "x": 239,
                        "y": 710
                    },
                    {
                        "x": 239,
                        "y": 728
                    },
                    {
                        "x": 44,
                        "y": 728
                    }
                ],
                "width": 16,
                "x": 133,
                "angle": -89,
                "y": 620,
                "word": "口人民币对外汇期权组合",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 15,
                        "h": 15,
                        "x": 47,
                        "y": 711,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 66,
                        "y": 711,
                        "word": "人"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 85,
                        "y": 711,
                        "word": "民"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 102,
                        "y": 711,
                        "word": "币"
                    },
                    {
                        "prob": 100,
                        "w": 15,
                        "h": 15,
                        "x": 117,
                        "y": 711,
                        "word": "对"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 136,
                        "y": 711,
                        "word": "外"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 153,
                        "y": 711,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 170,
                        "y": 711,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 185,
                        "y": 711,
                        "word": "权"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 205,
                        "y": 711,
                        "word": "组"
                    },
                    {
                        "prob": 99,
                        "w": 18,
                        "h": 15,
                        "x": 221,
                        "y": 711,
                        "word": "合"
                    }
                ],
                "direction": 0,
                "height": 197,
                "rowId": 33
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 722
                    },
                    {
                        "x": 361,
                        "y": 722
                    },
                    {
                        "x": 361,
                        "y": 740
                    },
                    {
                        "x": 263,
                        "y": 740
                    }
                ],
                "width": 17,
                "x": 304,
                "angle": -90,
                "y": 682,
                "word": "货币2金额：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 266,
                        "y": 723,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 285,
                        "y": 723,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 306,
                        "y": 723,
                        "word": "2"
                    },
                    {
                        "prob": 100,
                        "w": 13,
                        "h": 15,
                        "x": 318,
                        "y": 723,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 335,
                        "y": 723,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 354,
                        "y": 723,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 99,
                "rowId": 34
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 722
                    },
                    {
                        "x": 717,
                        "y": 722
                    },
                    {
                        "x": 717,
                        "y": 739
                    },
                    {
                        "x": 619,
                        "y": 739
                    }
                ],
                "width": 16,
                "x": 661,
                "angle": -90,
                "y": 682,
                "word": "货币2金额：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 620,
                        "y": 722,
                        "word": "货"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 639,
                        "y": 722,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 9,
                        "h": 14,
                        "x": 660,
                        "y": 722,
                        "word": "2"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 672,
                        "y": 722,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 689,
                        "y": 722,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 708,
                        "y": 722,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 98,
                "rowId": 35
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 746
                    },
                    {
                        "x": 330,
                        "y": 746
                    },
                    {
                        "x": 330,
                        "y": 762
                    },
                    {
                        "x": 263,
                        "y": 762
                    }
                ],
                "width": 16,
                "x": 288,
                "angle": -90,
                "y": 720,
                "word": "起息日：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 266,
                        "y": 746,
                        "word": "起"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 285,
                        "y": 746,
                        "word": "息"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 304,
                        "y": 746,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 14,
                        "x": 320,
                        "y": 746,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 67,
                "rowId": 36
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 357,
                        "y": 743
                    },
                    {
                        "x": 384,
                        "y": 743
                    },
                    {
                        "x": 384,
                        "y": 765
                    },
                    {
                        "x": 357,
                        "y": 765
                    }
                ],
                "width": 22,
                "x": 360,
                "angle": -90,
                "y": 741,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 19,
                        "x": 364,
                        "y": 744,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 27,
                "rowId": 36
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 412,
                        "y": 745
                    },
                    {
                        "x": 432,
                        "y": 745
                    },
                    {
                        "x": 432,
                        "y": 763
                    },
                    {
                        "x": 412,
                        "y": 763
                    }
                ],
                "width": 18,
                "x": 414,
                "angle": -90,
                "y": 744,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 414,
                        "y": 746,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 20,
                "rowId": 36
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 464,
                        "y": 743
                    },
                    {
                        "x": 487,
                        "y": 743
                    },
                    {
                        "x": 487,
                        "y": 764
                    },
                    {
                        "x": 464,
                        "y": 764
                    }
                ],
                "width": 21,
                "x": 465,
                "angle": -90,
                "y": 743,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 18,
                        "x": 468,
                        "y": 744,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 22,
                "rowId": 36
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 744
                    },
                    {
                        "x": 686,
                        "y": 744
                    },
                    {
                        "x": 686,
                        "y": 762
                    },
                    {
                        "x": 619,
                        "y": 762
                    }
                ],
                "width": 17,
                "x": 644,
                "angle": -90,
                "y": 720,
                "word": "起息日：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 620,
                        "y": 745,
                        "word": "起"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 640,
                        "y": 745,
                        "word": "息"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 658,
                        "y": 745,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 675,
                        "y": 745,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 66,
                "rowId": 36
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 712,
                        "y": 743
                    },
                    {
                        "x": 738,
                        "y": 743
                    },
                    {
                        "x": 738,
                        "y": 764
                    },
                    {
                        "x": 712,
                        "y": 764
                    }
                ],
                "width": 21,
                "x": 715,
                "angle": -90,
                "y": 742,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 18,
                        "x": 717,
                        "y": 744,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 25,
                "rowId": 36
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 770,
                        "y": 746
                    },
                    {
                        "x": 786,
                        "y": 746
                    },
                    {
                        "x": 786,
                        "y": 762
                    },
                    {
                        "x": 770,
                        "y": 762
                    }
                ],
                "width": 16,
                "x": 770,
                "angle": -90,
                "y": 746,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 14,
                        "x": 770,
                        "y": 747,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 16,
                "rowId": 36
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 820,
                        "y": 746
                    },
                    {
                        "x": 839,
                        "y": 746
                    },
                    {
                        "x": 839,
                        "y": 769
                    },
                    {
                        "x": 820,
                        "y": 769
                    }
                ],
                "width": 23,
                "x": 819,
                "angle": -90,
                "y": 748,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 20,
                        "x": 823,
                        "y": 747,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 19,
                "rowId": 36
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 768
                    },
                    {
                        "x": 331,
                        "y": 768
                    },
                    {
                        "x": 331,
                        "y": 785
                    },
                    {
                        "x": 263,
                        "y": 785
                    }
                ],
                "width": 18,
                "x": 288,
                "angle": -90,
                "y": 743,
                "word": "到期日：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 266,
                        "y": 768,
                        "word": "到"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 284,
                        "y": 768,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 304,
                        "y": 768,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 326,
                        "y": 768,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 68,
                "rowId": 37
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 359,
                        "y": 764
                    },
                    {
                        "x": 384,
                        "y": 764
                    },
                    {
                        "x": 384,
                        "y": 786
                    },
                    {
                        "x": 359,
                        "y": 786
                    }
                ],
                "width": 23,
                "x": 360,
                "angle": -90,
                "y": 762,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 19,
                        "x": 364,
                        "y": 765,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 26,
                "rowId": 37
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 415,
                        "y": 769
                    },
                    {
                        "x": 431,
                        "y": 769
                    },
                    {
                        "x": 431,
                        "y": 784
                    },
                    {
                        "x": 415,
                        "y": 784
                    }
                ],
                "width": 15,
                "x": 415,
                "angle": -90,
                "y": 768,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 12,
                        "x": 415,
                        "y": 769,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 16,
                "rowId": 37
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 466,
                        "y": 764
                    },
                    {
                        "x": 484,
                        "y": 764
                    },
                    {
                        "x": 484,
                        "y": 809
                    },
                    {
                        "x": 466,
                        "y": 809
                    }
                ],
                "width": 45,
                "x": 453,
                "angle": -90,
                "y": 779,
                "word": "日日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 469,
                        "y": 771,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 16,
                        "x": 467,
                        "y": 792,
                        "word": "日"
                    }
                ],
                "direction": 1,
                "height": 17,
                "rowId": 39
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 768
                    },
                    {
                        "x": 686,
                        "y": 768
                    },
                    {
                        "x": 686,
                        "y": 785
                    },
                    {
                        "x": 619,
                        "y": 785
                    }
                ],
                "width": 18,
                "x": 644,
                "angle": -90,
                "y": 744,
                "word": "到期日：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 622,
                        "y": 769,
                        "word": "到"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 639,
                        "y": 769,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 658,
                        "y": 769,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 674,
                        "y": 769,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 66,
                "rowId": 40
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 714,
                        "y": 765
                    },
                    {
                        "x": 738,
                        "y": 765
                    },
                    {
                        "x": 738,
                        "y": 786
                    },
                    {
                        "x": 714,
                        "y": 786
                    }
                ],
                "width": 21,
                "x": 715,
                "angle": -90,
                "y": 764,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 18,
                        "x": 717,
                        "y": 766,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 24,
                "rowId": 40
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 790
                    },
                    {
                        "x": 339,
                        "y": 790
                    },
                    {
                        "x": 339,
                        "y": 807
                    },
                    {
                        "x": 263,
                        "y": 807
                    }
                ],
                "width": 18,
                "x": 292,
                "angle": -90,
                "y": 760,
                "word": "交割日：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 265,
                        "y": 791,
                        "word": "交"
                    },
                    {
                        "prob": 100,
                        "w": 16,
                        "h": 15,
                        "x": 283,
                        "y": 791,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 15,
                        "x": 305,
                        "y": 791,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 2,
                        "h": 15,
                        "x": 321,
                        "y": 791,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 77,
                "rowId": 42
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 358,
                        "y": 787
                    },
                    {
                        "x": 384,
                        "y": 787
                    },
                    {
                        "x": 384,
                        "y": 807
                    },
                    {
                        "x": 358,
                        "y": 807
                    }
                ],
                "width": 19,
                "x": 362,
                "angle": -90,
                "y": 784,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 21,
                        "h": 17,
                        "x": 358,
                        "y": 788,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 27,
                "rowId": 42
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 412,
                        "y": 788
                    },
                    {
                        "x": 433,
                        "y": 788
                    },
                    {
                        "x": 433,
                        "y": 807
                    },
                    {
                        "x": 412,
                        "y": 807
                    }
                ],
                "width": 18,
                "x": 414,
                "angle": -90,
                "y": 787,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 16,
                        "x": 413,
                        "y": 789,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 21,
                "rowId": 42
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 791
                    },
                    {
                        "x": 686,
                        "y": 791
                    },
                    {
                        "x": 686,
                        "y": 807
                    },
                    {
                        "x": 619,
                        "y": 807
                    }
                ],
                "width": 17,
                "x": 644,
                "angle": -90,
                "y": 766,
                "word": "交割日：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 620,
                        "y": 791,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 639,
                        "y": 791,
                        "word": "割"
                    },
                    {
                        "prob": 100,
                        "w": 11,
                        "h": 14,
                        "x": 658,
                        "y": 791,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 674,
                        "y": 791,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 66,
                "rowId": 44
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 711,
                        "y": 788
                    },
                    {
                        "x": 738,
                        "y": 788
                    },
                    {
                        "x": 738,
                        "y": 808
                    },
                    {
                        "x": 711,
                        "y": 808
                    }
                ],
                "width": 20,
                "x": 715,
                "angle": -90,
                "y": 786,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 17,
                        "x": 715,
                        "y": 789,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 26,
                "rowId": 44
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 767,
                        "y": 788
                    },
                    {
                        "x": 789,
                        "y": 788
                    },
                    {
                        "x": 789,
                        "y": 806
                    },
                    {
                        "x": 767,
                        "y": 806
                    }
                ],
                "width": 19,
                "x": 768,
                "angle": -90,
                "y": 786,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 769,
                        "y": 789,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 22,
                "rowId": 44
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 822,
                        "y": 763
                    },
                    {
                        "x": 837,
                        "y": 763
                    },
                    {
                        "x": 837,
                        "y": 809
                    },
                    {
                        "x": 822,
                        "y": 809
                    }
                ],
                "width": 46,
                "x": 807,
                "angle": -90,
                "y": 778,
                "word": "日日",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 15,
                        "h": 16,
                        "x": 823,
                        "y": 770,
                        "word": "日"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 16,
                        "x": 823,
                        "y": 792,
                        "word": "日"
                    }
                ],
                "direction": 1,
                "height": 14,
                "rowId": 45
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 263,
                        "y": 813
                    },
                    {
                        "x": 531,
                        "y": 813
                    },
                    {
                        "x": 531,
                        "y": 832
                    },
                    {
                        "x": 263,
                        "y": 832
                    }
                ],
                "width": 19,
                "x": 387,
                "angle": -90,
                "y": 688,
                "word": "交割方式：全额交割/口差额交割",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 266,
                        "y": 814,
                        "word": "交"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 16,
                        "x": 284,
                        "y": 814,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 302,
                        "y": 814,
                        "word": "方"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 320,
                        "y": 814,
                        "word": "式"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 16,
                        "x": 338,
                        "y": 814,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 362,
                        "y": 814,
                        "word": "全"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 380,
                        "y": 814,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 398,
                        "y": 814,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 416,
                        "y": 814,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 16,
                        "x": 432,
                        "y": 814,
                        "word": "/"
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 16,
                        "x": 443,
                        "y": 814,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 459,
                        "y": 814,
                        "word": "差"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 477,
                        "y": 814,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 494,
                        "y": 814,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 19,
                        "h": 16,
                        "x": 510,
                        "y": 814,
                        "word": "割"
                    }
                ],
                "direction": 0,
                "height": 269,
                "rowId": 47
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 619,
                        "y": 813
                    },
                    {
                        "x": 886,
                        "y": 813
                    },
                    {
                        "x": 886,
                        "y": 832
                    },
                    {
                        "x": 619,
                        "y": 832
                    }
                ],
                "width": 19,
                "x": 743,
                "angle": -90,
                "y": 689,
                "word": "交割方式：口全额交割/差额交割",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 620,
                        "y": 814,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 638,
                        "y": 814,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 656,
                        "y": 814,
                        "word": "方"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 674,
                        "y": 814,
                        "word": "式"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 16,
                        "x": 692,
                        "y": 814,
                        "word": "："
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 16,
                        "x": 701,
                        "y": 814,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 717,
                        "y": 814,
                        "word": "全"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 735,
                        "y": 814,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 753,
                        "y": 814,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 768,
                        "y": 814,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 786,
                        "y": 814,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 813,
                        "y": 814,
                        "word": "差"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 831,
                        "y": 814,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 848,
                        "y": 814,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 16,
                        "x": 864,
                        "y": 814,
                        "word": "割"
                    }
                ],
                "direction": 0,
                "height": 266,
                "rowId": 47
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 861
                    },
                    {
                        "x": 441,
                        "y": 861
                    },
                    {
                        "x": 441,
                        "y": 880
                    },
                    {
                        "x": 44,
                        "y": 880
                    }
                ],
                "width": 18,
                "x": 232,
                "angle": -89,
                "y": 671,
                "word": "口人民币对外汇期权交易行权原交易证实书编号：",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 16,
                        "h": 16,
                        "x": 45,
                        "y": 862,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 65,
                        "y": 862,
                        "word": "人"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 83,
                        "y": 862,
                        "word": "民"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 101,
                        "y": 862,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 117,
                        "y": 862,
                        "word": "对"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 135,
                        "y": 862,
                        "word": "外"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 150,
                        "y": 862,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 168,
                        "y": 862,
                        "word": "期"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 186,
                        "y": 862,
                        "word": "权"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 204,
                        "y": 862,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 222,
                        "y": 862,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 238,
                        "y": 862,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 16,
                        "x": 256,
                        "y": 862,
                        "word": "权"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 292,
                        "y": 862,
                        "word": "原"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 310,
                        "y": 862,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 326,
                        "y": 862,
                        "word": "易"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 16,
                        "x": 344,
                        "y": 862,
                        "word": "证"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 362,
                        "y": 862,
                        "word": "实"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 380,
                        "y": 862,
                        "word": "书"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 395,
                        "y": 862,
                        "word": "编"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 16,
                        "x": 413,
                        "y": 862,
                        "word": "号"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 16,
                        "x": 430,
                        "y": 862,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 397,
                "rowId": 48
            },
            {
                "prob": 96,
                "pos": [
                    {
                        "x": 97,
                        "y": 883
                    },
                    {
                        "x": 356,
                        "y": 883
                    },
                    {
                        "x": 356,
                        "y": 900
                    },
                    {
                        "x": 97,
                        "y": 900
                    }
                ],
                "width": 17,
                "x": 216,
                "angle": -89,
                "y": 761,
                "word": "口全额交割：结汇口售汇币种",
                "charInfo": [
                    {
                        "prob": 68,
                        "w": 12,
                        "h": 15,
                        "x": 100,
                        "y": 883,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 116,
                        "y": 883,
                        "word": "全"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 134,
                        "y": 883,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 151,
                        "y": 883,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 167,
                        "y": 883,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 185,
                        "y": 883,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 221,
                        "y": 883,
                        "word": "结"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 239,
                        "y": 883,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 257,
                        "y": 883,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 272,
                        "y": 883,
                        "word": "售"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 289,
                        "y": 883,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 318,
                        "y": 883,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 334,
                        "y": 883,
                        "word": "种"
                    }
                ],
                "direction": 0,
                "height": 259,
                "rowId": 49
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 408,
                        "y": 884
                    },
                    {
                        "x": 488,
                        "y": 884
                    },
                    {
                        "x": 488,
                        "y": 900
                    },
                    {
                        "x": 408,
                        "y": 900
                    }
                ],
                "width": 16,
                "x": 440,
                "angle": -90,
                "y": 853,
                "word": "交割金额",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 411,
                        "y": 884,
                        "word": "交"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 14,
                        "x": 431,
                        "y": 884,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 14,
                        "x": 449,
                        "y": 884,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 19,
                        "h": 14,
                        "x": 465,
                        "y": 884,
                        "word": "额"
                    }
                ],
                "direction": 0,
                "height": 80,
                "rowId": 49
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 560,
                        "y": 884
                    },
                    {
                        "x": 634,
                        "y": 884
                    },
                    {
                        "x": 634,
                        "y": 900
                    },
                    {
                        "x": 560,
                        "y": 900
                    }
                ],
                "width": 16,
                "x": 589,
                "angle": -90,
                "y": 856,
                "word": "执行汇率",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 563,
                        "y": 884,
                        "word": "执"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 581,
                        "y": 884,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 598,
                        "y": 884,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 14,
                        "x": 614,
                        "y": 884,
                        "word": "率"
                    }
                ],
                "direction": 0,
                "height": 73,
                "rowId": 49
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 690,
                        "y": 883
                    },
                    {
                        "x": 806,
                        "y": 883
                    },
                    {
                        "x": 806,
                        "y": 900
                    },
                    {
                        "x": 690,
                        "y": 900
                    }
                ],
                "width": 18,
                "x": 740,
                "angle": -90,
                "y": 834,
                "word": "资金交割日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 693,
                        "y": 884,
                        "word": "资"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 712,
                        "y": 884,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 729,
                        "y": 884,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 746,
                        "y": 884,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 765,
                        "y": 884,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 116,
                "rowId": 49
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 812,
                        "y": 883
                    },
                    {
                        "x": 904,
                        "y": 883
                    },
                    {
                        "x": 904,
                        "y": 902
                    },
                    {
                        "x": 812,
                        "y": 902
                    }
                ],
                "width": 19,
                "x": 849,
                "angle": -90,
                "y": 847,
                "word": "年月日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 21,
                        "h": 16,
                        "x": 812,
                        "y": 884,
                        "word": "年"
                    },
                    {
                        "prob": 99,
                        "w": 28,
                        "h": 16,
                        "x": 835,
                        "y": 884,
                        "word": "月"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 16,
                        "x": 889,
                        "y": 884,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 91,
                "rowId": 49
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 97,
                        "y": 906
                    },
                    {
                        "x": 349,
                        "y": 906
                    },
                    {
                        "x": 349,
                        "y": 924
                    },
                    {
                        "x": 97,
                        "y": 924
                    }
                ],
                "width": 17,
                "x": 213,
                "angle": -89,
                "y": 788,
                "word": "口差额交割：差额交割定盘汇率",
                "charInfo": [
                    {
                        "prob": 95,
                        "w": 14,
                        "h": 15,
                        "x": 98,
                        "y": 906,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 116,
                        "y": 906,
                        "word": "差"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 134,
                        "y": 906,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 151,
                        "y": 906,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 167,
                        "y": 906,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 187,
                        "y": 906,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 203,
                        "y": 906,
                        "word": "差"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 221,
                        "y": 906,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 239,
                        "y": 906,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 257,
                        "y": 906,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 274,
                        "y": 906,
                        "word": "定"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 290,
                        "y": 906,
                        "word": "盘"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 307,
                        "y": 906,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 325,
                        "y": 906,
                        "word": "率"
                    }
                ],
                "direction": 0,
                "height": 252,
                "rowId": 50
            },
            {
                "prob": 95,
                "pos": [
                    {
                        "x": 401,
                        "y": 906
                    },
                    {
                        "x": 542,
                        "y": 906
                    },
                    {
                        "x": 542,
                        "y": 924
                    },
                    {
                        "x": 401,
                        "y": 924
                    }
                ],
                "width": 17,
                "x": 462,
                "angle": -90,
                "y": 844,
                "word": "差额交割CNY金额_",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 406,
                        "y": 907,
                        "word": "差"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 423,
                        "y": 907,
                        "word": "额"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 442,
                        "y": 907,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 457,
                        "y": 907,
                        "word": "割"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 476,
                        "y": 907,
                        "word": "C"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 484,
                        "y": 907,
                        "word": "N"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 495,
                        "y": 907,
                        "word": "Y"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 503,
                        "y": 907,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 18,
                        "h": 15,
                        "x": 517,
                        "y": 907,
                        "word": "额"
                    },
                    {
                        "prob": 62,
                        "w": 3,
                        "h": 15,
                        "x": 538,
                        "y": 907,
                        "word": "_"
                    }
                ],
                "direction": 0,
                "height": 140,
                "rowId": 50
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 959
                    },
                    {
                        "x": 116,
                        "y": 959
                    },
                    {
                        "x": 116,
                        "y": 976
                    },
                    {
                        "x": 44,
                        "y": 976
                    }
                ],
                "width": 16,
                "x": 71,
                "angle": -90,
                "y": 931,
                "word": "账户信息",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 44,
                        "y": 960,
                        "word": "账"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 64,
                        "y": 960,
                        "word": "户"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 14,
                        "x": 82,
                        "y": 960,
                        "word": "信"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 14,
                        "x": 100,
                        "y": 960,
                        "word": "息"
                    }
                ],
                "direction": 0,
                "height": 72,
                "rowId": 51
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 983
                    },
                    {
                        "x": 109,
                        "y": 983
                    },
                    {
                        "x": 109,
                        "y": 999
                    },
                    {
                        "x": 44,
                        "y": 999
                    }
                ],
                "width": 16,
                "x": 67,
                "angle": -90,
                "y": 957,
                "word": "币种1在",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 14,
                        "x": 47,
                        "y": 983,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 62,
                        "y": 983,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 82,
                        "y": 983,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 14,
                        "x": 91,
                        "y": 983,
                        "word": "在"
                    }
                ],
                "direction": 0,
                "height": 65,
                "rowId": 52
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 413,
                        "y": 981
                    },
                    {
                        "x": 628,
                        "y": 981
                    },
                    {
                        "x": 628,
                        "y": 999
                    },
                    {
                        "x": 413,
                        "y": 999
                    }
                ],
                "width": 17,
                "x": 512,
                "angle": -90,
                "y": 882,
                "word": "(账号)中扣划，币种2划入",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 416,
                        "y": 982,
                        "word": "("
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 424,
                        "y": 982,
                        "word": "账"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 443,
                        "y": 982,
                        "word": "号"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 460,
                        "y": 982,
                        "word": ")"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 477,
                        "y": 982,
                        "word": "中"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 494,
                        "y": 982,
                        "word": "扣"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 513,
                        "y": 982,
                        "word": "划"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 530,
                        "y": 982,
                        "word": "，"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 549,
                        "y": 982,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 566,
                        "y": 982,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 584,
                        "y": 982,
                        "word": "2"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 593,
                        "y": 982,
                        "word": "划"
                    },
                    {
                        "prob": 99,
                        "w": 18,
                        "h": 15,
                        "x": 609,
                        "y": 982,
                        "word": "入"
                    }
                ],
                "direction": 0,
                "height": 216,
                "rowId": 53
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 890,
                        "y": 983
                    },
                    {
                        "x": 937,
                        "y": 983
                    },
                    {
                        "x": 937,
                        "y": 999
                    },
                    {
                        "x": 890,
                        "y": 999
                    }
                ],
                "width": 16,
                "x": 906,
                "angle": -90,
                "y": 968,
                "word": "银行，",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 890,
                        "y": 984,
                        "word": "银"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 14,
                        "x": 908,
                        "y": 984,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 14,
                        "x": 928,
                        "y": 984,
                        "word": "，"
                    }
                ],
                "direction": 0,
                "height": 46,
                "rowId": 54
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 42,
                        "y": 1005
                    },
                    {
                        "x": 83,
                        "y": 1005
                    },
                    {
                        "x": 83,
                        "y": 1022
                    },
                    {
                        "x": 42,
                        "y": 1022
                    }
                ],
                "width": 18,
                "x": 53,
                "angle": -90,
                "y": 993,
                "word": "账号",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 45,
                        "y": 1006,
                        "word": "账"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 65,
                        "y": 1006,
                        "word": "号"
                    }
                ],
                "direction": 0,
                "height": 40,
                "rowId": 55
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 366,
                        "y": 1005
                    },
                    {
                        "x": 451,
                        "y": 1005
                    },
                    {
                        "x": 451,
                        "y": 1022
                    },
                    {
                        "x": 366,
                        "y": 1022
                    }
                ],
                "width": 18,
                "x": 399,
                "angle": -90,
                "y": 971,
                "word": "，收款方为",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 366,
                        "y": 1005,
                        "word": "，"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 378,
                        "y": 1005,
                        "word": "收"
                    },
                    {
                        "prob": 100,
                        "w": 14,
                        "h": 15,
                        "x": 398,
                        "y": 1005,
                        "word": "款"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 416,
                        "y": 1005,
                        "word": "方"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 433,
                        "y": 1005,
                        "word": "为"
                    }
                ],
                "direction": 0,
                "height": 86,
                "rowId": 56
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 1027
                    },
                    {
                        "x": 109,
                        "y": 1027
                    },
                    {
                        "x": 109,
                        "y": 1044
                    },
                    {
                        "x": 44,
                        "y": 1044
                    }
                ],
                "width": 18,
                "x": 66,
                "angle": -90,
                "y": 1002,
                "word": "币种2在",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 47,
                        "y": 1027,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 62,
                        "y": 1027,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 82,
                        "y": 1027,
                        "word": "2"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 91,
                        "y": 1027,
                        "word": "在"
                    }
                ],
                "direction": 0,
                "height": 65,
                "rowId": 57
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 412,
                        "y": 1027
                    },
                    {
                        "x": 625,
                        "y": 1027
                    },
                    {
                        "x": 625,
                        "y": 1044
                    },
                    {
                        "x": 412,
                        "y": 1044
                    }
                ],
                "width": 17,
                "x": 510,
                "angle": -89,
                "y": 928,
                "word": "(账号)中扣划，币种1划入",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 413,
                        "y": 1027,
                        "word": "("
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 420,
                        "y": 1027,
                        "word": "账"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 438,
                        "y": 1027,
                        "word": "号"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 458,
                        "y": 1027,
                        "word": ")"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 474,
                        "y": 1027,
                        "word": "中"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 489,
                        "y": 1027,
                        "word": "扣"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 507,
                        "y": 1027,
                        "word": "划"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 525,
                        "y": 1027,
                        "word": "，"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 546,
                        "y": 1027,
                        "word": "币"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 561,
                        "y": 1027,
                        "word": "种"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 579,
                        "y": 1027,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 588,
                        "y": 1027,
                        "word": "划"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 606,
                        "y": 1027,
                        "word": "入"
                    }
                ],
                "direction": 0,
                "height": 214,
                "rowId": 58
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 883,
                        "y": 1028
                    },
                    {
                        "x": 928,
                        "y": 1028
                    },
                    {
                        "x": 928,
                        "y": 1043
                    },
                    {
                        "x": 883,
                        "y": 1043
                    }
                ],
                "width": 15,
                "x": 899,
                "angle": -90,
                "y": 1013,
                "word": "银行，",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 13,
                        "x": 886,
                        "y": 1028,
                        "word": "银"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 13,
                        "x": 907,
                        "y": 1028,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 13,
                        "x": 921,
                        "y": 1028,
                        "word": "，"
                    }
                ],
                "direction": 0,
                "height": 45,
                "rowId": 59
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 42,
                        "y": 1050
                    },
                    {
                        "x": 83,
                        "y": 1050
                    },
                    {
                        "x": 83,
                        "y": 1067
                    },
                    {
                        "x": 42,
                        "y": 1067
                    }
                ],
                "width": 18,
                "x": 53,
                "angle": -90,
                "y": 1038,
                "word": "账号",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 45,
                        "y": 1051,
                        "word": "账"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 65,
                        "y": 1051,
                        "word": "号"
                    }
                ],
                "direction": 0,
                "height": 40,
                "rowId": 60
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 360,
                        "y": 1050
                    },
                    {
                        "x": 450,
                        "y": 1050
                    },
                    {
                        "x": 450,
                        "y": 1067
                    },
                    {
                        "x": 360,
                        "y": 1067
                    }
                ],
                "width": 18,
                "x": 396,
                "angle": -90,
                "y": 1013,
                "word": "，收款方为",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 363,
                        "y": 1050,
                        "word": "，"
                    },
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 15,
                        "x": 377,
                        "y": 1050,
                        "word": "收"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 398,
                        "y": 1050,
                        "word": "款"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 414,
                        "y": 1050,
                        "word": "方"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 433,
                        "y": 1050,
                        "word": "为"
                    }
                ],
                "direction": 0,
                "height": 90,
                "rowId": 61
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 1094
                    },
                    {
                        "x": 176,
                        "y": 1094
                    },
                    {
                        "x": 176,
                        "y": 1110
                    },
                    {
                        "x": 44,
                        "y": 1110
                    }
                ],
                "width": 16,
                "x": 101,
                "angle": -90,
                "y": 1034,
                "word": "委托单位体性质：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 46,
                        "y": 1095,
                        "word": "委"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 63,
                        "y": 1095,
                        "word": "托"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 78,
                        "y": 1095,
                        "word": "单"
                    },
                    {
                        "prob": 100,
                        "w": 11,
                        "h": 14,
                        "x": 92,
                        "y": 1095,
                        "word": "位"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 122,
                        "y": 1095,
                        "word": "体"
                    },
                    {
                        "prob": 100,
                        "w": 11,
                        "h": 14,
                        "x": 138,
                        "y": 1095,
                        "word": "性"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 152,
                        "y": 1095,
                        "word": "质"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 14,
                        "x": 167,
                        "y": 1095,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 133,
                "rowId": 62
            },
            {
                "prob": 98,
                "pos": [
                    {
                        "x": 181,
                        "y": 1095
                    },
                    {
                        "x": 377,
                        "y": 1094
                    },
                    {
                        "x": 378,
                        "y": 1111
                    },
                    {
                        "x": 181,
                        "y": 1112
                    }
                ],
                "width": 197,
                "x": 179,
                "angle": 0,
                "y": 1094,
                "word": "01银行自身￥02金融机构",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 204,
                        "y": 1096,
                        "word": "0"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 212,
                        "y": 1096,
                        "word": "1"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 220,
                        "y": 1096,
                        "word": "银"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 235,
                        "y": 1096,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 14,
                        "x": 251,
                        "y": 1096,
                        "word": "自"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 264,
                        "y": 1095,
                        "word": "身"
                    },
                    {
                        "prob": 77,
                        "w": 10,
                        "h": 14,
                        "x": 288,
                        "y": 1095,
                        "word": "￥"
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 14,
                        "x": 301,
                        "y": 1095,
                        "word": "0"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 14,
                        "x": 311,
                        "y": 1095,
                        "word": "2"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 317,
                        "y": 1095,
                        "word": "金"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 332,
                        "y": 1095,
                        "word": "融"
                    },
                    {
                        "prob": 99,
                        "w": 8,
                        "h": 14,
                        "x": 346,
                        "y": 1095,
                        "word": "机"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 362,
                        "y": 1095,
                        "word": "构"
                    }
                ],
                "direction": 0,
                "height": 16,
                "rowId": 62
            },
            {
                "prob": 97,
                "pos": [
                    {
                        "x": 483,
                        "y": 1094
                    },
                    {
                        "x": 815,
                        "y": 1092
                    },
                    {
                        "x": 815,
                        "y": 1110
                    },
                    {
                        "x": 483,
                        "y": 1111
                    }
                ],
                "width": 332,
                "x": 482,
                "angle": 0,
                "y": 1093,
                "word": "交易编码：(同涉外收支交易代码)：0000",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 484,
                        "y": 1095,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 500,
                        "y": 1095,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 514,
                        "y": 1095,
                        "word": "编"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 530,
                        "y": 1095,
                        "word": "码"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 544,
                        "y": 1095,
                        "word": "："
                    },
                    {
                        "prob": 99,
                        "w": 7,
                        "h": 15,
                        "x": 558,
                        "y": 1095,
                        "word": "("
                    },
                    {
                        "prob": 100,
                        "w": 11,
                        "h": 15,
                        "x": 568,
                        "y": 1095,
                        "word": "同"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 582,
                        "y": 1095,
                        "word": "涉"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 598,
                        "y": 1094,
                        "word": "外"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 612,
                        "y": 1094,
                        "word": "收"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 628,
                        "y": 1094,
                        "word": "支"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 642,
                        "y": 1094,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 658,
                        "y": 1094,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 672,
                        "y": 1094,
                        "word": "代"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 688,
                        "y": 1094,
                        "word": "码"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 704,
                        "y": 1094,
                        "word": ")"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 710,
                        "y": 1094,
                        "word": "："
                    },
                    {
                        "prob": 90,
                        "w": 13,
                        "h": 15,
                        "x": 754,
                        "y": 1094,
                        "word": "0"
                    },
                    {
                        "prob": 79,
                        "w": 11,
                        "h": 15,
                        "x": 770,
                        "y": 1094,
                        "word": "0"
                    },
                    {
                        "prob": 95,
                        "w": 13,
                        "h": 15,
                        "x": 784,
                        "y": 1094,
                        "word": "0"
                    },
                    {
                        "prob": 79,
                        "w": 13,
                        "h": 15,
                        "x": 800,
                        "y": 1094,
                        "word": "0"
                    }
                ],
                "direction": 0,
                "height": 17,
                "rowId": 62
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 186,
                        "y": 1113
                    },
                    {
                        "x": 379,
                        "y": 1113
                    },
                    {
                        "x": 379,
                        "y": 1129
                    },
                    {
                        "x": 186,
                        "y": 1129
                    }
                ],
                "width": 17,
                "x": 273,
                "angle": -90,
                "y": 1024,
                "word": "03中资机构04外资机构",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 14,
                        "x": 203,
                        "y": 1114,
                        "word": "0"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 14,
                        "x": 212,
                        "y": 1114,
                        "word": "3"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 220,
                        "y": 1114,
                        "word": "中"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 14,
                        "x": 235,
                        "y": 1114,
                        "word": "资"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 248,
                        "y": 1114,
                        "word": "机"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 264,
                        "y": 1114,
                        "word": "构"
                    },
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 14,
                        "x": 302,
                        "y": 1114,
                        "word": "0"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 14,
                        "x": 311,
                        "y": 1114,
                        "word": "4"
                    },
                    {
                        "prob": 100,
                        "w": 6,
                        "h": 14,
                        "x": 322,
                        "y": 1114,
                        "word": "外"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 331,
                        "y": 1114,
                        "word": "资"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 346,
                        "y": 1114,
                        "word": "机"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 362,
                        "y": 1114,
                        "word": "构"
                    }
                ],
                "direction": 0,
                "height": 192,
                "rowId": 63
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 556,
                        "y": 1117
                    },
                    {
                        "x": 793,
                        "y": 1117
                    },
                    {
                        "x": 793,
                        "y": 1132
                    },
                    {
                        "x": 556,
                        "y": 1132
                    }
                ],
                "width": 14,
                "x": 666,
                "angle": -90,
                "y": 1005,
                "word": "外汇局批件号/备案表号/业务编号：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 12,
                        "x": 558,
                        "y": 1117,
                        "word": "外"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 12,
                        "x": 575,
                        "y": 1117,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 12,
                        "x": 590,
                        "y": 1117,
                        "word": "局"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 12,
                        "x": 605,
                        "y": 1117,
                        "word": "批"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 12,
                        "x": 620,
                        "y": 1117,
                        "word": "件"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 12,
                        "x": 635,
                        "y": 1117,
                        "word": "号"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 12,
                        "x": 650,
                        "y": 1117,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 12,
                        "x": 657,
                        "y": 1117,
                        "word": "备"
                    },
                    {
                        "prob": 100,
                        "w": 12,
                        "h": 12,
                        "x": 674,
                        "y": 1117,
                        "word": "案"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 12,
                        "x": 687,
                        "y": 1117,
                        "word": "表"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 12,
                        "x": 704,
                        "y": 1117,
                        "word": "号"
                    },
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 12,
                        "x": 717,
                        "y": 1117,
                        "word": "/"
                    },
                    {
                        "prob": 100,
                        "w": 10,
                        "h": 12,
                        "x": 726,
                        "y": 1117,
                        "word": "业"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 12,
                        "x": 738,
                        "y": 1117,
                        "word": "务"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 12,
                        "x": 753,
                        "y": 1117,
                        "word": "编"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 12,
                        "x": 770,
                        "y": 1117,
                        "word": "号"
                    },
                    {
                        "prob": 98,
                        "w": 4,
                        "h": 12,
                        "x": 783,
                        "y": 1117,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 236,
                "rowId": 64
            },
            {
                "prob": 96,
                "pos": [
                    {
                        "x": 43,
                        "y": 1133
                    },
                    {
                        "x": 183,
                        "y": 1131
                    },
                    {
                        "x": 183,
                        "y": 1148
                    },
                    {
                        "x": 44,
                        "y": 1150
                    }
                ],
                "width": 139,
                "x": 42,
                "angle": 0,
                "y": 1131,
                "word": "结汇/售汇交易性展：",
                "charInfo": [
                    {
                        "prob": 100,
                        "w": 15,
                        "h": 15,
                        "x": 45,
                        "y": 1133,
                        "word": "结"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 63,
                        "y": 1133,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 77,
                        "y": 1133,
                        "word": "/"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 85,
                        "y": 1133,
                        "word": "售"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 99,
                        "y": 1133,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 115,
                        "y": 1132,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 131,
                        "y": 1132,
                        "word": "易"
                    },
                    {
                        "prob": 96,
                        "w": 13,
                        "h": 15,
                        "x": 145,
                        "y": 1132,
                        "word": "性"
                    },
                    {
                        "prob": 74,
                        "w": 11,
                        "h": 15,
                        "x": 161,
                        "y": 1132,
                        "word": "展"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 175,
                        "y": 1132,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 17,
                "rowId": 65
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 283,
                        "y": 1132
                    },
                    {
                        "x": 423,
                        "y": 1132
                    },
                    {
                        "x": 423,
                        "y": 1148
                    },
                    {
                        "x": 283,
                        "y": 1148
                    }
                ],
                "width": 16,
                "x": 344,
                "angle": -90,
                "y": 1070,
                "word": "(代号参见背页选项)",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 13,
                        "x": 285,
                        "y": 1133,
                        "word": "("
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 13,
                        "x": 294,
                        "y": 1133,
                        "word": "代"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 13,
                        "x": 309,
                        "y": 1133,
                        "word": "号"
                    },
                    {
                        "prob": 100,
                        "w": 11,
                        "h": 13,
                        "x": 325,
                        "y": 1133,
                        "word": "参"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 13,
                        "x": 339,
                        "y": 1133,
                        "word": "见"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 13,
                        "x": 355,
                        "y": 1133,
                        "word": "背"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 13,
                        "x": 369,
                        "y": 1133,
                        "word": "页"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 13,
                        "x": 382,
                        "y": 1133,
                        "word": "选"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 13,
                        "x": 398,
                        "y": 1133,
                        "word": "项"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 13,
                        "x": 416,
                        "y": 1133,
                        "word": ")"
                    }
                ],
                "direction": 0,
                "height": 139,
                "rowId": 65
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 482,
                        "y": 1139
                    },
                    {
                        "x": 554,
                        "y": 1139
                    },
                    {
                        "x": 554,
                        "y": 1155
                    },
                    {
                        "x": 482,
                        "y": 1155
                    }
                ],
                "width": 17,
                "x": 509,
                "angle": -90,
                "y": 1110,
                "word": "结汇用途：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 482,
                        "y": 1140,
                        "word": "结"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 499,
                        "y": 1140,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 514,
                        "y": 1140,
                        "word": "用"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 529,
                        "y": 1140,
                        "word": "途"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 14,
                        "x": 543,
                        "y": 1140,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 74,
                "rowId": 65
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 653,
                        "y": 1140
                    },
                    {
                        "x": 793,
                        "y": 1140
                    },
                    {
                        "x": 793,
                        "y": 1155
                    },
                    {
                        "x": 653,
                        "y": 1155
                    }
                ],
                "width": 15,
                "x": 716,
                "angle": -90,
                "y": 1079,
                "word": "(代号参见背页选项)",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 6,
                        "h": 12,
                        "x": 655,
                        "y": 1140,
                        "word": "("
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 12,
                        "x": 664,
                        "y": 1140,
                        "word": "代"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 12,
                        "x": 681,
                        "y": 1140,
                        "word": "号"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 12,
                        "x": 694,
                        "y": 1140,
                        "word": "参"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 12,
                        "x": 711,
                        "y": 1140,
                        "word": "见"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 12,
                        "x": 726,
                        "y": 1140,
                        "word": "背"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 12,
                        "x": 741,
                        "y": 1140,
                        "word": "页"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 12,
                        "x": 754,
                        "y": 1140,
                        "word": "选"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 12,
                        "x": 770,
                        "y": 1140,
                        "word": "项"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 12,
                        "x": 787,
                        "y": 1140,
                        "word": ")"
                    }
                ],
                "direction": 0,
                "height": 139,
                "rowId": 65
            },
            {
                "prob": 98,
                "pos": [
                    {
                        "x": 113,
                        "y": 1158
                    },
                    {
                        "x": 424,
                        "y": 1158
                    },
                    {
                        "x": 424,
                        "y": 1176
                    },
                    {
                        "x": 113,
                        "y": 1176
                    }
                ],
                "width": 17,
                "x": 260,
                "angle": -90,
                "y": 1011,
                "word": "如为服务贸易，是否为银行卡交易：口是口否",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 115,
                        "y": 1159,
                        "word": "如"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 130,
                        "y": 1159,
                        "word": "为"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 145,
                        "y": 1159,
                        "word": "服"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 160,
                        "y": 1159,
                        "word": "务"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 175,
                        "y": 1159,
                        "word": "贸"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 190,
                        "y": 1159,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 15,
                        "x": 205,
                        "y": 1159,
                        "word": "，"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 220,
                        "y": 1159,
                        "word": "是"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 234,
                        "y": 1159,
                        "word": "否"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 249,
                        "y": 1159,
                        "word": "为"
                    },
                    {
                        "prob": 99,
                        "w": 10,
                        "h": 15,
                        "x": 266,
                        "y": 1159,
                        "word": "银"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 279,
                        "y": 1159,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 294,
                        "y": 1159,
                        "word": "卡"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 309,
                        "y": 1159,
                        "word": "交"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 326,
                        "y": 1159,
                        "word": "易"
                    },
                    {
                        "prob": 99,
                        "w": 2,
                        "h": 15,
                        "x": 341,
                        "y": 1159,
                        "word": "："
                    },
                    {
                        "prob": 80,
                        "w": 10,
                        "h": 15,
                        "x": 355,
                        "y": 1159,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 368,
                        "y": 1159,
                        "word": "是"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 392,
                        "y": 1159,
                        "word": "口"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 407,
                        "y": 1159,
                        "word": "否"
                    }
                ],
                "direction": 0,
                "height": 311,
                "rowId": 66
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 512,
                        "y": 1162
                    },
                    {
                        "x": 793,
                        "y": 1162
                    },
                    {
                        "x": 793,
                        "y": 1178
                    },
                    {
                        "x": 512,
                        "y": 1178
                    }
                ],
                "width": 16,
                "x": 644,
                "angle": -90,
                "y": 1031,
                "word": "如为005、006或099时请填写结汇详细用途",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 513,
                        "y": 1162,
                        "word": "如"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 530,
                        "y": 1162,
                        "word": "为"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 551,
                        "y": 1162,
                        "word": "0"
                    },
                    {
                        "prob": 99,
                        "w": 1,
                        "h": 14,
                        "x": 555,
                        "y": 1162,
                        "word": "0"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 559,
                        "y": 1162,
                        "word": "5"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 14,
                        "x": 568,
                        "y": 1162,
                        "word": "、"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 581,
                        "y": 1162,
                        "word": "0"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 589,
                        "y": 1162,
                        "word": "0"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 14,
                        "x": 598,
                        "y": 1162,
                        "word": "6"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 604,
                        "y": 1162,
                        "word": "或"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 619,
                        "y": 1162,
                        "word": "0"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 14,
                        "x": 628,
                        "y": 1162,
                        "word": "9"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 634,
                        "y": 1162,
                        "word": "9"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 642,
                        "y": 1162,
                        "word": "时"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 657,
                        "y": 1162,
                        "word": "请"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 672,
                        "y": 1162,
                        "word": "填"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 687,
                        "y": 1162,
                        "word": "写"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 702,
                        "y": 1162,
                        "word": "结"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 717,
                        "y": 1162,
                        "word": "汇"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 732,
                        "y": 1162,
                        "word": "详"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 747,
                        "y": 1162,
                        "word": "细"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 14,
                        "x": 762,
                        "y": 1162,
                        "word": "用"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 776,
                        "y": 1162,
                        "word": "途"
                    }
                ],
                "direction": 0,
                "height": 280,
                "rowId": 66
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 44,
                        "y": 1195
                    },
                    {
                        "x": 212,
                        "y": 1195
                    },
                    {
                        "x": 212,
                        "y": 1213
                    },
                    {
                        "x": 44,
                        "y": 1213
                    }
                ],
                "width": 17,
                "x": 118,
                "angle": -90,
                "y": 1119,
                "word": "委托单位签字并盖章：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 47,
                        "y": 1196,
                        "word": "委"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 64,
                        "y": 1196,
                        "word": "托"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 83,
                        "y": 1196,
                        "word": "单"
                    },
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 102,
                        "y": 1196,
                        "word": "位"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 116,
                        "y": 1196,
                        "word": "签"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 135,
                        "y": 1196,
                        "word": "字"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 152,
                        "y": 1196,
                        "word": "并"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 15,
                        "x": 169,
                        "y": 1196,
                        "word": "盖"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 15,
                        "x": 188,
                        "y": 1196,
                        "word": "章"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 15,
                        "x": 205,
                        "y": 1196,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 168,
                "rowId": 67
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 482,
                        "y": 1196
                    },
                    {
                        "x": 599,
                        "y": 1196
                    },
                    {
                        "x": 599,
                        "y": 1214
                    },
                    {
                        "x": 482,
                        "y": 1214
                    }
                ],
                "width": 17,
                "x": 531,
                "angle": -90,
                "y": 1146,
                "word": "银行审核意见：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 483,
                        "y": 1196,
                        "word": "银"
                    },
                    {
                        "prob": 99,
                        "w": 12,
                        "h": 15,
                        "x": 503,
                        "y": 1196,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 518,
                        "y": 1196,
                        "word": "审"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 536,
                        "y": 1196,
                        "word": "核"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 15,
                        "x": 554,
                        "y": 1196,
                        "word": "意"
                    },
                    {
                        "prob": 99,
                        "w": 16,
                        "h": 15,
                        "x": 572,
                        "y": 1196,
                        "word": "见"
                    },
                    {
                        "prob": 99,
                        "w": 3,
                        "h": 15,
                        "x": 592,
                        "y": 1196,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 118,
                "rowId": 68
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 640,
                        "y": 1331
                    },
                    {
                        "x": 721,
                        "y": 1331
                    },
                    {
                        "x": 721,
                        "y": 1347
                    },
                    {
                        "x": 640,
                        "y": 1347
                    }
                ],
                "width": 15,
                "x": 671,
                "angle": -90,
                "y": 1297,
                "word": "银行盖章：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 642,
                        "y": 1332,
                        "word": "银"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 660,
                        "y": 1332,
                        "word": "行"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 678,
                        "y": 1332,
                        "word": "盖"
                    },
                    {
                        "prob": 99,
                        "w": 14,
                        "h": 14,
                        "x": 696,
                        "y": 1332,
                        "word": "章"
                    },
                    {
                        "prob": 99,
                        "w": 4,
                        "h": 14,
                        "x": 713,
                        "y": 1332,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 81,
                "rowId": 69
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 341,
                        "y": 1354
                    },
                    {
                        "x": 366,
                        "y": 1354
                    },
                    {
                        "x": 366,
                        "y": 1375
                    },
                    {
                        "x": 341,
                        "y": 1375
                    }
                ],
                "width": 22,
                "x": 342,
                "angle": -90,
                "y": 1352,
                "word": "年",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 17,
                        "h": 18,
                        "x": 344,
                        "y": 1355,
                        "word": "年"
                    }
                ],
                "direction": 0,
                "height": 24,
                "rowId": 70
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 393,
                        "y": 1355
                    },
                    {
                        "x": 416,
                        "y": 1355
                    },
                    {
                        "x": 416,
                        "y": 1374
                    },
                    {
                        "x": 393,
                        "y": 1374
                    }
                ],
                "width": 18,
                "x": 395,
                "angle": -90,
                "y": 1352,
                "word": "月",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 16,
                        "x": 396,
                        "y": 1356,
                        "word": "月"
                    }
                ],
                "direction": 0,
                "height": 23,
                "rowId": 70
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 447,
                        "y": 1354
                    },
                    {
                        "x": 469,
                        "y": 1354
                    },
                    {
                        "x": 469,
                        "y": 1373
                    },
                    {
                        "x": 447,
                        "y": 1373
                    }
                ],
                "width": 17,
                "x": 448,
                "angle": -87,
                "y": 1351,
                "word": "日",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 11,
                        "h": 15,
                        "x": 452,
                        "y": 1355,
                        "word": "日"
                    }
                ],
                "direction": 0,
                "height": 23,
                "rowId": 70
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 640,
                        "y": 1355
                    },
                    {
                        "x": 704,
                        "y": 1357
                    },
                    {
                        "x": 703,
                        "y": 1373
                    },
                    {
                        "x": 639,
                        "y": 1371
                    }
                ],
                "width": 16,
                "x": 662,
                "angle": -89,
                "y": 1332,
                "word": "经办人：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 643,
                        "y": 1356,
                        "word": "经"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 662,
                        "y": 1356,
                        "word": "办"
                    },
                    {
                        "prob": 99,
                        "w": 13,
                        "h": 14,
                        "x": 678,
                        "y": 1357,
                        "word": "人"
                    },
                    {
                        "prob": 99,
                        "w": 5,
                        "h": 14,
                        "x": 695,
                        "y": 1357,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 64,
                "rowId": 70
            },
            {
                "prob": 99,
                "pos": [
                    {
                        "x": 790,
                        "y": 1355
                    },
                    {
                        "x": 853,
                        "y": 1355
                    },
                    {
                        "x": 853,
                        "y": 1372
                    },
                    {
                        "x": 790,
                        "y": 1372
                    }
                ],
                "width": 16,
                "x": 813,
                "angle": -90,
                "y": 1333,
                "word": "复核人：",
                "charInfo": [
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 791,
                        "y": 1356,
                        "word": "复"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 809,
                        "y": 1356,
                        "word": "核"
                    },
                    {
                        "prob": 99,
                        "w": 15,
                        "h": 14,
                        "x": 827,
                        "y": 1356,
                        "word": "人"
                    },
                    {
                        "prob": 97,
                        "w": 5,
                        "h": 14,
                        "x": 844,
                        "y": 1356,
                        "word": "："
                    }
                ],
                "direction": 0,
                "height": 62,
                "rowId": 70
            }
        ],
        "height": 1403
    },
    "requestId": "9e559ac6-0614-46fc-80d2-a789a89ef124"
}


def imageDiff(resultRoot, originFile, contrastFile, page=1):
    """
    对比两张照片的区别
    :param resultRoot: 输出目录
    :param originFile: 源文件
    :param contrastFile: 扫描件
    :param page: 页数
    :return:
    """
    '''
    # 调用接口返回后的结果
    originResult = getImageInfo(filename=originFile)  # 识别原件内容
    contrastResult = getImageInfo(filename=contrastFile)  # 识别扫描件内容
    '''

    for origin_words in originResult['data']['prism_wordsInfo'][:]:
        # 获取词块的相关位置信息
        left, top = origin_words['pos'][0]['x'], origin_words['pos'][0]['y']
        # right, bottom = left + origin_words['location']['width'], top + origin_words['location']['height']
        for contrast_words in contrastResult['data']['prism_wordsInfo'][:]:
            # 获取词块的相关位置信息
            contrast_words_ll = []
            result_left, result_top = contrast_words['pos'][0]['x'], contrast_words['pos'][0]['y']
            contrast_words_ll.append(contrast_words['word'].replace('口', ''))
            # result_right, result_bottom = result_left + contrast_words['location']['width'], result_top + \
            #                               contrast_words['location']['height']

            # 判断词块距离顶部的位置是否在偏差范围内，可理解为两个词块位置是否一致
            if origin_words['word'].replace('口', '') in contrast_words_ll:
                contrastResult['data']['prism_wordsInfo'].remove(contrast_words)  # 删除原件词块
                originResult['data']['prism_wordsInfo'].remove(origin_words)  # 删除原件词块
                break  # 已找到词块退出循环

            elif origin_words['word'] in contrast_words['word']:
                # 说明扫描件内容和原件不一样
                originResult['data']['prism_wordsInfo'].remove(origin_words)  # 删除原件词块
                contrast_words['word'] = contrast_words['word'].replace(origin_words['word'], '', 1)
                break  # 已找到词块退出循环
    # 文档图像标注，画框标注出不一样的内容
    originImage = Image.open(originFile)
    originDraw = ImageDraw.ImageDraw(originImage)
    originText = ''  # 保存对比不一致的文本
    for origin_words in originResult['data']['prism_wordsInfo'][:]:
        # originText += words['words'] + '\n'
        left, top = origin_words['pos'][0]['x'], origin_words['pos'][0]['y']
        right, bottom = origin_words['pos'][2]['x'], origin_words['pos'][2]['y']
        originDraw.rectangle(((left, top), (right, bottom)), outline='red', width=2)
    # originDic[page] = originText  # 空字典，用于保存原件中每一页对比不一致的文本
    contrastImage = Image.open(contrastFile)
    contrastDraw = ImageDraw.ImageDraw(contrastImage)
    contrastText = ''
    for contrast_words in contrastResult['data']['prism_wordsInfo'][:]:
        # 获取扫描版的每个词块
        # contrastText += words['words'] + '\n'
        left, top = contrast_words['pos'][0]['x'], contrast_words['pos'][0]['y']
        right, bottom = contrast_words['pos'][2]['x'], contrast_words['pos'][2]['y']
        contrastDraw.rectangle(((left, top), (right, bottom)), outline='red', width=2)
    # contrastDic[page] = contrastText  # 文档扫描件
    # 图像合并，生成对比图
    originSize = originImage.size  # 获取原始照片大小
    contrastSize = contrastImage.size  # 获取扫描件大小
    newImage_width = originSize[0] + contrastSize[0]
    newImage_hight = originSize[1] if originSize[1] > contrastSize[1] else contrastSize[1]
    new_Image = Image.new('RGB', (newImage_width, newImage_hight), "#000000")
    new_Image.paste(originImage, (0, 0))
    new_Image.paste(contrastImage, (originSize[0], 0))
    # 展示合成图片
    # new_Image.show()
    # 展示扫描图片
    contrastImage.show()
    contrastImage.save(os.path.join(resultRoot, "第" + str(page) + '页文档.png'))

resultRoot =r'F:\kq\OCR 测试\20221214' #结果输出目录
originFile =r"F:\kq\ocr_20221201\yuantupian\page1.png" # 模板图片位置
contrastFile =r"F:\kq\ocr_20221201\tupian\1111.png"  # 扫描件图片位置
imageDiff(resultRoot, originFile, contrastFile, page=1)